<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:11.4" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:3.4" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:11.4" /><meta name="product" content="air" /><meta name="productver" content="air:3.4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="Worker,flash.system.Worker,current,isPrimordial,isSupported,state,addEventListener,createMessageChannel,getSharedProperty,removeEventListener,setSharedProperty,start,terminate" /><title>Worker - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.system</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public final   class  Worker</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">Worker  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
 Worker &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;Flash &#12521;&#12531;&#12479;&#12452;&#12512;&#12398;&#20206;&#24819;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12354;&#12427;&#12289;&#12527;&#12540;&#12459;&#12540;<i></i>&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#21508; Worker &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#21336;&#19968;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12362;&#12424;&#12403;&#20849;&#26377;&#12487;&#12540;&#12479;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#25552;&#20379;&#12375;&#12289;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>&#12527;&#12540;&#12459;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#65288;&#12513;&#12452;&#12531;&#12398; swf &#12398;&#12527;&#12540;&#12459;&#12540;&#12434;&#21547;&#12416;&#65289;&#21029;&#12398;&#12527;&#12540;&#12459;&#12540;&#12391;&#21029;&#12398;&#25805;&#20316;&#12434;&#23455;&#34892;&#12377;&#12427;&#12398;&#12392;&#21516;&#26178;&#12395;&#12289;&#12300;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12391;&#12301;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12391;&#12365;&#12414;&#12377;&#12290;&#38750;&#12527;&#12540;&#12459;&#12540;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;&#20363;&#12360;&#12400;&#12289;&#24040;&#22823;&#12394;&#12487;&#12540;&#12479;&#12398;&#12523;&#12540;&#12503;&#20966;&#29702;&#12394;&#12393;&#12289;&#19968;&#37096;&#12398;&#20966;&#29702;&#12399;&#23455;&#34892;&#12395;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12398;&#12391;&#12289;&#12513;&#12452;&#12531;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12473;&#12524;&#12483;&#12489;&#12364;&#21313;&#20998;&#12394;&#36895;&#12373;&#12391;&#30011;&#38754;&#12434;&#26356;&#26032;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#30011;&#38754;&#12398;&#36884;&#20999;&#12428;&#12420;&#12501;&#12522;&#12540;&#12474;&#12364;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12527;&#12540;&#12459;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#38263;&#26178;&#38291;&#12398;&#25805;&#20316;&#12420;&#20302;&#36895;&#12394;&#25805;&#20316;&#12434;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12391;&#23455;&#34892;&#12391;&#12365;&#12414;&#12377;&#12290;&#21508;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#20182;&#12398;&#12527;&#12540;&#12459;&#12540;&#12392;&#12399;&#21029;&#12398;&#23455;&#34892;&#12473;&#12524;&#12483;&#12489;&#12391;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#12354;&#12427;&#12527;&#12540;&#12459;&#12540;&#12398;&#38263;&#26178;&#38291;&#12434;&#35201;&#12377;&#12427;&#12467;&#12540;&#12489;&#12364;&#12289;&#21029;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#12398;&#23455;&#34892;&#12434;&#12502;&#12525;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#20195;&#12431;&#12426;&#12395;&#12289;&#12467;&#12540;&#12489;&#12398; 2 &#12388;&#12398;&#12475;&#12483;&#12488;&#12364;&#20006;&#34892;&#12375;&#12390;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#12513;&#12452;&#12531;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12473;&#12524;&#12483;&#12489;&#12391;&#32153;&#32154;&#12375;&#12390;&#30011;&#38754;&#12434;&#26356;&#26032;&#12375;&#12394;&#12364;&#12425;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12391;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12398;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#35079;&#25968;&#12398;&#12467;&#12540;&#12489;&#21629;&#20196;&#12475;&#12483;&#12488;&#12434;&#21516;&#26178;&#12395;&#23455;&#34892;&#12377;&#12427;&#27231;&#33021;&#12399;&#12289;&#12300;&#20006;&#34892;&#20966;&#29702;&#12301;<i></i>&#12392;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#27880;&#24847;&#65306;</b>&#20006;&#21015;&#20966;&#29702;&#12398;&#12383;&#12417;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#20351;&#29992;&#12399;&#12289;Flash Player &#12362;&#12424;&#12403;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12398; AIR &#12391;&#12398;&#12415;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#20006;&#34892;&#20966;&#29702;&#12399;&#12289;&#12514;&#12496;&#12452;&#12523; AIR &#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#38745;&#30340; <code>isSupported</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20006;&#34892;&#20966;&#29702;&#12434;&#20351;&#29992;&#12377;&#12427;&#21069;&#12395;&#12289;&#20006;&#34892;&#20966;&#29702;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#12481;&#12455;&#12483;&#12463;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <code>Worker()</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390; Worker &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#30452;&#25509;&#20316;&#25104;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#20006;&#34892;&#20966;&#29702;&#12398;&#12383;&#12417;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#20351;&#29992;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#36215;&#21205;&#26178;&#12395;&#33258;&#21205;&#30340;&#12395;&#12513;&#12452;&#12531; SWF &#12392;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383; Worker&#65288;&#12300;&#22522;&#26412;&#12527;&#12540;&#12459;&#12540;&#12301;<i></i>&#12392;&#21628;&#12400;&#12428;&#12427;&#65289;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#36861;&#21152;&#12398;&#21508;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#30064;&#12394;&#12427; swf &#12363;&#12425;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;Worker &#12463;&#12521;&#12473;&#12398;&#26032;&#12375;&#12356;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12398; swf &#12398;&#12496;&#12452;&#12488;&#12434;&#24341;&#25968;&#12392;&#12377;&#12427; ByteArray &#12434; WorkerDomain &#12463;&#12521;&#12473;&#12398; <code>createWorker()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#30446;&#30340;&#12391; swf &#12398;&#12496;&#12452;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398; 3 &#12388;&#12398;&#20849;&#36890;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <ul><li>&#13;
                     <p>[Embed] &#12513;&#12479;&#12479;&#12464;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;.swf &#12501;&#12449;&#12452;&#12523;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395; ByteArray &#12392;&#12375;&#12390;&#22475;&#12417;&#36796;&#12415;&#12414;&#12377;&#12290;</p>&#13;
                     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 // Embed the SWF file&#13;
 [Embed(source="../swfs/BgWorker.swf", mimeType="application/octet-stream")]&#13;
 private static var BgWorker_ByteClass:Class;&#13;
 &#13;
 private function createWorker():void&#13;
 {&#13;
   // create the background worker&#13;
   var workerBytes:ByteArray = new BgWorker_ByteClass();&#13;
   var bgWorker:Worker = WorkerDomain.current.createWorker(workerBytes);&#13;
   &#13;
   // listen for worker state changes to know when the worker is running&#13;
   bgWorker.addEventListener(Event.WORKER_STATE, workerStateHandler);&#13;
   &#13;
   // set up communication between workers using &#13;
   // setSharedProperty(), createMessageChannel(), etc.&#13;
   // ... (not shown)&#13;
   &#13;
   bgWorker.start();&#13;
 }</pre></div>&#13;
                  </li>&#13;
                  <li>&#13;
                     <p>URLLoader &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#22806;&#37096; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;</p>&#13;
                     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 // load the SWF file&#13;
 var workerLoader:URLLoader = new URLLoader();&#13;
 workerLoader.dataFormat = URLLoaderDataFormat.BINARY;&#13;
 workerLoader.addEventListener(Event.COMPLETE, loadComplete);&#13;
 workerLoader.load(new URLRequest("BgWorker.swf"));&#13;
 &#13;
 private function loadComplete(event:Event):void&#13;
 {&#13;
   // create the background worker&#13;
   var workerBytes:ByteArray = event.target.data as ByteArray;&#13;
   var bgWorker:Worker = WorkerDomain.current.createWorker(workerBytes);&#13;
   &#13;
   // listen for worker state changes to know when the worker is running&#13;
   bgWorker.addEventListener(Event.WORKER_STATE, workerStateHandler);&#13;
   &#13;
   // set up communication between workers using &#13;
   // setSharedProperty(), createMessageChannel(), etc.&#13;
   // ... (not shown)&#13;
   &#13;
   bgWorker.start();&#13;
 }</pre></div>&#13;
                  </li>&#13;
                  <li>&#13;
                     <p>&#22522;&#26412;&#12527;&#12540;&#12459;&#12540;&#12362;&#12424;&#12403;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12392;&#12375;&#12390;&#21336;&#19968;&#12398; swf &#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
                     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 // The primordial worker's main class constructor&#13;
 public function PrimordialWorkerClass()&#13;
 {&#13;
   init();&#13;
 }&#13;
 &#13;
 private function init():void&#13;
 {&#13;
   var swfBytes:ByteArray = this.loaderInfo.bytes;&#13;
   &#13;
   // Check to see if this is the primordial worker&#13;
   if (Worker.current.isPrimordial)    &#13;
   {&#13;
     // create a background worker&#13;
     var bgWorker:Worker = WorkerDomain.current.createWorker(swfBytes);&#13;
     &#13;
     // listen for worker state changes to know when the worker is running&#13;
     bgWorker.addEventListener(Event.WORKER_STATE, workerStateHandler);&#13;
     &#13;
     // set up communication between workers using &#13;
     // setSharedProperty(), createMessageChannel(), etc.&#13;
     // ... (not shown)&#13;
     &#13;
     bgWorker.start();&#13;
   }&#13;
   else // entry point for the background worker&#13;
   {&#13;
     // set up communication between workers using getSharedProperty()&#13;
     // ... (not shown)&#13;
     &#13;
     // start the background work&#13;
   }&#13;
 }</pre></div>&#13;
                  </li>&#13;
               </ul><p>&#35079;&#25968;&#12398;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#12381;&#12428;&#12382;&#12428;&#12364;&#20998;&#38626;&#12375;&#12383;&#29366;&#24907;&#12391;&#23455;&#34892;&#12373;&#12428;&#12289;&#21516;&#12376;&#12513;&#12514;&#12522;&#12289;&#22793;&#25968;&#12289;&#12362;&#12424;&#12403;&#12467;&#12540;&#12489;&#12395;&#12399;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;Worker &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#38291;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12362;&#12424;&#12403;&#12487;&#12540;&#12479;&#12434;&#28193;&#12377;&#12395;&#12399;&#12289;3 &#12388;&#12398;&#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <ul><li>&#20849;&#26377;&#12503;&#12525;&#12497;&#12486;&#12451;&#65306;&#21508;&#12527;&#12540;&#12459;&#12540;&#12395;&#12399;&#12289;&#12381;&#12398;&#12527;&#12540;&#12459;&#12540;&#33258;&#20307;&#12392;&#20182;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#20001;&#26041;&#12363;&#12425;&#35373;&#23450;&#12362;&#12424;&#12403;&#35501;&#12415;&#21462;&#12426;&#21487;&#33021;&#12394;&#21517;&#21069;&#20184;&#12365;&#12398;&#20516;&#12398;&#20869;&#37096;&#12475;&#12483;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<code>setSharedProperty()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#20516;&#12434;&#35373;&#23450;&#12375;&#12289;<code>getSharedProperty()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#20516;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</li>&#13;
                  <li>MessageChannel&#65306;MessageChannel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12354;&#12427;&#12527;&#12540;&#12459;&#12540;&#12363;&#12425;&#21029;&#12398;&#12527;&#12540;&#12459;&#12540;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12362;&#12424;&#12403;&#12487;&#12540;&#12479;&#12434;&#21336;&#26041;&#21521;&#12391;&#36865;&#20449;&#12391;&#12365;&#12414;&#12377;&#12290;&#21463;&#20449;&#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#21040;&#30528;&#12375;&#12383;&#12425;&#36890;&#30693;&#12373;&#12428;&#12427;&#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12391;&#12365;&#12414;&#12377;&#12290;MessageChannel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>createMessageChannel()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#20849;&#26377;&#21487;&#33021; ByteArray&#65306;ByteArray &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>shareable</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>true</code> &#12398;&#22580;&#21512;&#12289;&#12377;&#12409;&#12390;&#12398;&#12527;&#12540;&#12459;&#12540;&#12395;&#12362;&#12369;&#12427;&#12381;&#12398; ByteArray &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12289;&#22522;&#12395;&#12394;&#12427;&#21516;&#12376;&#12513;&#12514;&#12522;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#12391;&#21516;&#26178;&#12395;&#20849;&#26377;&#12513;&#12514;&#12522;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12398;&#12391;&#12289;&#12467;&#12540;&#12489;&#12391;&#12399; <code>ByteArray.shareable</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35500;&#26126;&#12391;&#31034;&#12375;&#12383;&#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20104;&#26399;&#12375;&#12394;&#12356;&#12487;&#12540;&#12479;&#12398;&#22793;&#26356;&#12395;&#12424;&#12427;&#21839;&#38988;&#12398;&#30330;&#29983;&#12434;&#38450;&#12368;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</li>&#13;
               </ul><p>&#12356;&#12367;&#12388;&#12363;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512; API &#12399;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12391;&#23455;&#34892;&#12377;&#12427;&#12467;&#12540;&#12489;&#12391;&#12399;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12425;&#12399;&#12289;&#20027;&#12395;&#12289;&#12518;&#12540;&#12470;&#12540;&#20837;&#20986;&#21147;&#12513;&#12459;&#12491;&#12474;&#12512;&#12289;&#12414;&#12383;&#12399;&#12454;&#12451;&#12531;&#12489;&#12454;&#12420;&#12489;&#12521;&#12483;&#12464;&#12394;&#12393;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#38306;&#36899;&#12377;&#12427; API &#12391;&#27083;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#21407;&#21063;&#12392;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12394;&#12356; API &#12395;&#12399;&#12289;<code>isSupported</code>&#12289;<code>available</code>&#12289;&#12362;&#12424;&#12403;&#21516;&#27096;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12381;&#12398; API &#12434;&#20351;&#29992;&#12377;&#12427;&#21069;&#12395;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#12513;&#12452;&#12531;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12473;&#12524;&#12483;&#12489;&#12364;&#20182;&#12398;&#12467;&#12540;&#12489;&#12395;&#12502;&#12525;&#12483;&#12463;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#21407;&#22240;&#12391;&#12501;&#12524;&#12540;&#12512;&#12524;&#12540;&#12488;&#12364;&#12489;&#12525;&#12483;&#12503;&#12377;&#12427;&#21487;&#33021;&#24615;&#12434;&#28187;&#12425;&#12377;&#12398;&#12391;&#12289;&#20415;&#21033;&#12391;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12527;&#12540;&#12459;&#12540;&#12399;&#36861;&#21152;&#12398;&#12471;&#12473;&#12486;&#12512;&#12513;&#12514;&#12522;&#12362;&#12424;&#12403; CPU &#12398;&#20351;&#29992;&#12434;&#24517;&#35201;&#12392;&#12375;&#12289;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20840;&#20307;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12395;&#24433;&#38911;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#21508;&#12527;&#12540;&#12459;&#12540;&#12399;&#12381;&#12428;&#12382;&#12428;&#29420;&#33258;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512;&#20206;&#24819;&#12510;&#12471;&#12531;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#20351;&#29992;&#12377;&#12427;&#12398;&#12391;&#12289;&#36890;&#24120;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#12458;&#12540;&#12496;&#12540;&#12504;&#12483;&#12489;&#12391;&#12373;&#12360;&#22823;&#12365;&#12367;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12527;&#12540;&#12459;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23550;&#35937;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12391;&#12467;&#12540;&#12489;&#12434;&#12486;&#12473;&#12488;&#12375;&#12390;&#12289;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#35201;&#27714;&#12364;&#22823;&#12365;&#12377;&#12366;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;&#19968;&#33324;&#30340;&#12395;&#12289;2 &#12388;&#20197;&#19978;&#12398;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
            <p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><p id="moreExamples"><span class="classHeaderTableLabel">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS2f73111e7a180bd0-5856a8af1390d64d08c-8000.html" target="_blank">&#12527;&#12540;&#12459;&#12540;&#12392;&#20006;&#34892;&#20966;&#29702;&#12395;&#12388;&#12356;&#12390;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS2f73111e7a180bd0-5856a8af1390d64d08c-7fff.html" target="_blank">&#12527;&#12540;&#12459;&#12540;&#12398;&#20316;&#25104;&#12392;&#31649;&#29702;</a></div><p id="learnMore"><span class="classHeaderTableLabel">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://gotoandlearn.com/play.php?id=162" target="_blank">Lee Brimelow&#12289;ActionScript &#12527;&#12540;&#12459;&#12540;&#12518;&#12540;&#12470;&#12540;&#12460;&#12452;&#12489;</a><br /><a href="http://esdot.ca/site/2012/intro-to-as3-workers-part-2-image-processing" target="_blank">Shawn Blais&#12289;AS3 &#12527;&#12540;&#12459;&#12540;&#12398;&#32057;&#20171;&#65306;&#12452;&#12513;&#12540;&#12472;&#12398;&#20966;&#29702;</a><br /><a href="http://esdot.ca/site/2012/intro-to-as3-workers-part-3-nape-physics-starling" target="_blank">Shawn Blais&#12289;&#12510;&#12523;&#12481;&#12473;&#12524;&#12483;&#12489;&#29289;&#29702;&#23398;&#65306;&#29289;&#29702;&#12456;&#12531;&#12472;&#12531;&#29992; AS3 &#12527;&#12540;&#12459;&#12540;&#12518;&#12540;&#12470;&#12540;&#12460;&#12452;&#12489;</a></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="WorkerDomain.html" target="">WorkerDomain &#12463;&#12521;&#12473;</a><br /><a href="WorkerDomain.html#createWorker()" target="">WorkerDomain.createWorker() &#12513;&#12477;&#12483;&#12489;</a><br /><a href="MessageChannel.html" target="">MessageChannel &#12463;&#12521;&#12473;</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#current" class="signatureLink">current</a> : <a href="../../flash/system/Worker.html">Worker</a><div class="summaryTableDescription">[&#38745;&#30340;] [&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
    &#29694;&#22312;&#12398;&#12467;&#12540;&#12489;&#12434;&#21547;&#12416;&#12527;&#12540;&#12459;&#12540;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#25552;&#20379;&#12377;&#12427;&#13;
    &#13;
    </div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#isPrimordial" class="signatureLink">isPrimordial</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
    &#12371;&#12398;&#12527;&#12540;&#12459;&#12540;&#12364;&#22522;&#26412;&#12527;&#12540;&#12459;&#12540;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#isSupported" class="signatureLink">isSupported</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#38745;&#30340;] [&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
    &#29694;&#22312;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#21516;&#26178;&#12467;&#12540;&#12489;&#23455;&#34892;&#12391; Worker &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20351;&#29992;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#state" class="signatureLink">state</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
    &#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12395;&#12362;&#12369;&#12427;&#12527;&#12540;&#12459;&#12540;&#12398;&#29694;&#22312;&#12398;&#29366;&#24907;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#addEventListener()" class="signatureLink">addEventListener</a>(type:<a href="../../String.html">String</a>, listener:<a href="../../Function.html">Function</a>, useCapture:<a href="../../Boolean.html">Boolean</a> = false, priority:<a href="../../int.html">int</a> = 0, useWeakReference:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">[&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;] &#13;
    &#13;
	&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; EventDispatcher &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#30331;&#37682;&#12375;&#12289;&#12522;&#12473;&#12490;&#12540;&#12364;&#12452;&#12505;&#12531;&#12488;&#12398;&#36890;&#30693;&#12434;&#21463;&#12369;&#21462;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#createMessageChannel()" class="signatureLink">createMessageChannel</a>(receiver:<a href="../../flash/system/Worker.html">Worker</a>):<a href="../../flash/system/MessageChannel.html">MessageChannel</a></div><div class="summaryTableDescription">&#13;
    &#26032;&#12375;&#12356; MessageChannel &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12390;&#12289;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#12527;&#12540;&#12459;&#12540;&#12363;&#12425;&#21029;&#12398;&#21463;&#20449;&#12527;&#12540;&#12459;&#12540;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#getSharedProperty()" class="signatureLink">getSharedProperty</a>(key:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#*">*</a></div><div class="summaryTableDescription">&#13;
    &#21517;&#21069;&#20184;&#12365;&#12398;&#12461;&#12540;&#12392;&#20849;&#12395;&#12371;&#12398;&#12527;&#12540;&#12459;&#12540;&#12395;&#26684;&#32013;&#12373;&#12428;&#12383;&#20516;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#removeEventListener()" class="signatureLink">removeEventListener</a>(type:<a href="../../String.html">String</a>, listener:<a href="../../Function.html">Function</a>, useCapture:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">[&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;] &#13;
    &#13;
	EventDispatcher &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#setSharedProperty()" class="signatureLink">setSharedProperty</a>(key:<a href="../../String.html">String</a>, value:<a href="../../specialTypes.html#*">*</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
    &#12527;&#12540;&#12459;&#12540;&#12398; swf &#12391;&#23455;&#34892;&#12377;&#12427;&#12467;&#12540;&#12489;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#21517;&#21069;&#20184;&#12365;&#12398;&#20516;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#start()" class="signatureLink">start</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
    &#12527;&#12540;&#12459;&#12540;&#12398;&#23455;&#34892;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#terminate()" class="signatureLink">terminate</a>():<a href="../../Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
    &#12371;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#23455;&#34892;&#12434;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Worker</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:workerState" class="signatureLink">workerState</a></div></td><td class="summaryTableDescription summaryTableCol">&#12527;&#12540;&#12459;&#12540;&#12398; state &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">Worker</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/current" class="dashAnchor" id="//apple_ref/cpp/Property/current"></a><a name="current" id="current"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>current</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>current:<a href="../../flash/system/Worker.html">Worker</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#29694;&#22312;&#12398;&#12467;&#12540;&#12489;&#12434;&#21547;&#12416;&#12527;&#12540;&#12459;&#12540;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#25552;&#20379;&#12377;&#12427;&#13;
    &#13;
    </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public static function get current():<a href="../../flash/system/Worker.html">Worker</a></code><br /></div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/isPrimordial" class="dashAnchor" id="//apple_ref/cpp/Property/isPrimordial"></a><a name="isPrimordial" id="isPrimordial"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>isPrimordial</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>isPrimordial:<a href="../../Boolean.html">Boolean</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#12371;&#12398;&#12527;&#12540;&#12459;&#12540;&#12364;&#22522;&#26412;&#12527;&#12540;&#12459;&#12540;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p>&#12300;&#22522;&#26412;&#12527;&#12540;&#12459;&#12540;&#12301;<i></i>&#12399;&#12289;&#26368;&#21021;&#12398; swf &#12364;&#23455;&#34892;&#20013;&#12398;&#12527;&#12540;&#12459;&#12540;&#12391;&#12377;&#12290;&#12371;&#12398;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#30011;&#38754;&#12408;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12434;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#22522;&#26412;&#12527;&#12540;&#12459;&#12540;&#12362;&#12424;&#12403;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12364;&#21516;&#12376; swf &#12501;&#12449;&#12452;&#12523;&#12398; 2 &#12388;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12354;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#35373;&#35336;&#12377;&#12427;&#12398;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#20182;&#12395;&#12399;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12364;&#12289;&#22522;&#26412;&#12527;&#12540;&#12459;&#12540;&#12363;&#12425;&#30064;&#12394;&#12427; swf &#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12383;&#30064;&#12394;&#12427;&#12467;&#12540;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12467;&#12540;&#12489;&#12434;&#27083;&#31689;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get isPrimordial():<a href="../../Boolean.html">Boolean</a></code><br /></div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/isSupported" class="dashAnchor" id="//apple_ref/cpp/Property/isSupported"></a><a name="isSupported" id="isSupported"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>isSupported</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>isSupported:<a href="../../Boolean.html">Boolean</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#29694;&#22312;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#21516;&#26178;&#12467;&#12540;&#12489;&#23455;&#34892;&#12391; Worker &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20351;&#29992;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p>&#20006;&#34892;&#20966;&#29702;&#12364;&#20351;&#29992;&#21487;&#33021;&#12394;&#22580;&#21512;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399; <code>true</code> &#12391;&#12377;&#12290;</p>&#13;
    &#13;
    <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public static function get isSupported():<a href="../../Boolean.html">Boolean</a></code><br /></div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/state" class="dashAnchor" id="//apple_ref/cpp/Property/state"></a><a name="state" id="state"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>state</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>state:<a href="../../String.html">String</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12395;&#12362;&#12369;&#12427;&#12527;&#12540;&#12459;&#12540;&#12398;&#29694;&#22312;&#12398;&#29366;&#24907;&#12391;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#26377;&#21177;&#12394;&#20516;&#12399; WorkerState &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get state():<a href="../../String.html">String</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="WorkerState.html" target="">flash.system.WorkerState</a></div></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="//apple_ref/cpp/Method/addEventListener()" class="dashAnchor" id="//apple_ref/cpp/Method/addEventListener()"></a><a name="addEventListener()" id="addEventListener()"></a><a name="addEventListener(String,Function,Boolean,int,Boolean)" id="addEventListener(String,Function,Boolean,int,Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>addEventListener</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code>override public function addEventListener(type:<a href="../../String.html">String</a>, listener:<a href="../../Function.html">Function</a>, useCapture:<a href="../../Boolean.html">Boolean</a> = false, priority:<a href="../../int.html">int</a> = 0, useWeakReference:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#13;
	&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; EventDispatcher &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#30331;&#37682;&#12375;&#12289;&#12522;&#12473;&#12490;&#12540;&#12364;&#12452;&#12505;&#12531;&#12488;&#12398;&#36890;&#30693;&#12434;&#21463;&#12369;&#21462;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;<span>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12399;&#12289;&#29305;&#23450;&#12398;&#12479;&#12452;&#12503;&#12398;&#12452;&#12505;&#12531;&#12488;&#12289;&#27573;&#38542;&#12289;&#12362;&#12424;&#12403;&#20778;&#20808;&#24230;&#12395;&#38306;&#12377;&#12427;&#34920;&#31034;&#12522;&#12473;&#12488;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12494;&#12540;&#12489;&#12395;&#30331;&#37682;&#12391;&#12365;&#12414;&#12377;&#12290;</span>&#13;
	&#13;
	&#13;
	&#13;
	</p><p>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#27491;&#24120;&#12395;&#30331;&#37682;&#12373;&#12428;&#12383;&#24460;&#12395;&#12289;<code>addEventListener()</code> &#12434;&#12373;&#12425;&#12395;&#21628;&#12403;&#20986;&#12375;&#12390;&#20778;&#20808;&#24230;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12522;&#12473;&#12490;&#12540;&#12398;&#20778;&#20808;&#24230;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#26368;&#21021;&#12395; <code>removeListener()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#24460;&#12289;&#21516;&#12376;&#12522;&#12473;&#12490;&#12540;&#12434;&#26032;&#12375;&#12356;&#20778;&#20808;&#24230;&#12524;&#12505;&#12523;&#12391;&#20877;&#24230;&#30331;&#37682;&#12391;&#12365;&#12414;&#12377;&#12290; </p>&#13;
	&#13;
	<p>&#12522;&#12473;&#12490;&#12540;&#12364;&#30331;&#37682;&#12373;&#12428;&#12383;&#24460;&#12395;&#12289;<code>addEventListener()</code>&#65288;<code>type</code> &#12414;&#12383;&#12399; <code>useCapture</code> &#12395;&#21029;&#12398;&#20516;&#12434;&#35373;&#23450;&#65289;&#12434;&#20877;&#24230;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;&#21029;&#12398;&#12522;&#12473;&#12490;&#12540;&#30331;&#37682;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<span>&#20363;&#12360;&#12400;&#12289;&#26368;&#21021;&#12395;&#12522;&#12473;&#12490;&#12540;&#12434;&#30331;&#37682;&#12377;&#12427;&#12392;&#12365;&#12395; <code>useCapture</code> &#12434; <code>true</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#12522;&#12473;&#12490;&#12540;&#12399;&#12461;&#12515;&#12503;&#12481;&#12515;&#27573;&#38542;&#12398;&#12415;&#12391;&#12522;&#12473;&#12491;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;&#21516;&#12376;&#12522;&#12473;&#12490;&#12540;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#20877;&#24230; <code>addEventListener()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#65288;&#12371;&#12398;&#12392;&#12365;&#12289;<code>useCapture</code> &#12395; <code>false</code> &#12434;&#35373;&#23450;&#65289;&#12289;&#30064;&#12394;&#12427; 2 &#12388;&#12398;&#12522;&#12473;&#12490;&#12540;&#12364;&#30331;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;1 &#12388;&#12399;&#12461;&#12515;&#12503;&#12481;&#12515;&#27573;&#38542;&#12391;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12522;&#12473;&#12490;&#12540;&#12391;&#12289;&#12418;&#12358; 1 &#12388;&#12399;&#12479;&#12540;&#12466;&#12483;&#12488;&#27573;&#38542;&#12392;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#12391;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12522;&#12473;&#12490;&#12540;&#12391;&#12377;&#12290;</span>&#13;
	</p>&#13;
	&#13;
	<p>&#12479;&#12540;&#12466;&#12483;&#12488;&#27573;&#38542;&#12414;&#12383;&#12399;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#12398;&#12415;&#12434;&#23550;&#35937;&#12392;&#12377;&#12427;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12434;&#30331;&#37682;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#30331;&#37682;&#26178;&#12395;&#12371;&#12428;&#12425;&#12398;&#27573;&#38542;&#12364;&#32068;&#12415;&#21512;&#12431;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;&#12496;&#12502;&#12522;&#12531;&#12464;&#12399;&#12479;&#12540;&#12466;&#12483;&#12488;&#12494;&#12540;&#12489;&#12398;&#31062;&#20808;&#12395;&#12375;&#12363;&#36969;&#29992;&#12373;&#12428;&#12394;&#12356;&#12383;&#12417;&#12391;&#12377;&#12290;</p>&#13;
	&#13;
	<p>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#19981;&#35201;&#12395;&#12394;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;<code>removeEventListener()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#21066;&#38500;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#12513;&#12514;&#12522;&#12398;&#21839;&#38988;&#12364;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#36865;&#20986;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#38480;&#12426;&#12289;&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12375;&#12394;&#12356;&#12398;&#12391;&#12289;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12399;&#33258;&#21205;&#30340;&#12395;&#12399;&#21066;&#38500;&#12373;&#12428;&#12414;&#12379;&#12435;&#65288;<code>useWeakReference</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#65289;&#12290;</p>&#13;
		&#13;
	<p>EventDispatcher &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12467;&#12500;&#12540;&#12375;&#12390;&#12418;&#12289;&#12381;&#12428;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12399;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#26032;&#12375;&#12367;&#20316;&#25104;&#12375;&#12383;&#12494;&#12540;&#12489;&#12395;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12399;&#12289;&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12375;&#12383;&#24460;&#12395;&#12289;&#12522;&#12473;&#12490;&#12540;&#12434;&#38306;&#36899;&#20184;&#12369;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;EventDispatcher &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#31227;&#21205;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12418;&#19968;&#32210;&#12395;&#31227;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	&#13;
	<p>&#12452;&#12505;&#12531;&#12488;&#12364;&#12494;&#12540;&#12489;&#12391;&#20966;&#29702;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#12381;&#12398;&#12494;&#12540;&#12489;&#12395;&#30331;&#37682;&#20013;&#12391;&#12354;&#12428;&#12400;&#12289;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12399;&#29694;&#22312;&#12398;&#27573;&#38542;&#12391;&#12399;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#12394;&#12393;&#12289;&#12452;&#12505;&#12531;&#12488;&#12501;&#12525;&#12540;&#12398;&#24460;&#12398;&#27573;&#38542;&#12391;&#12488;&#12522;&#12460;&#12540;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p>&#12452;&#12505;&#12531;&#12488;&#12364;&#12494;&#12540;&#12489;&#12391;&#20966;&#29702;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#12494;&#12540;&#12489;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12383;&#22580;&#21512;&#12391;&#12418;&#12289;&#12452;&#12505;&#12531;&#12488;&#12399;&#29694;&#22312;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#21066;&#38500;&#12373;&#12428;&#12383;&#24460;&#12399;&#12289;&#12381;&#12398;&#24460;&#12398;&#20966;&#29702;&#12391;&#20877;&#12403;&#30331;&#37682;&#12373;&#12428;&#12394;&#12356;&#38480;&#12426;&#12289;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12399;&#20108;&#24230;&#12392;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; </p>&#13;
	&#13;
	<p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">type</span>:<a href="../../String.html">String</a></code> &#8212; &#12452;&#12505;&#12531;&#12488;&#12398;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;&#13;
	&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">listener</span>:<a href="../../Function.html">Function</a></code> &#8212; &#12452;&#12505;&#12531;&#12488;&#12434;&#20966;&#29702;&#12377;&#12427;&#12522;&#12473;&#12490;&#12540;&#38306;&#25968;&#12391;&#12377;&#12290;&#12371;&#12398;&#38306;&#25968;&#12399;&#12289;<span>&#27425;&#12398;&#20363;&#12398;&#12424;&#12358;&#12395;</span>&#12289;Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21807;&#19968;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390;&#21463;&#12369;&#21462;&#12426;&#12289;&#20309;&#12418;&#36820;&#12373;&#12394;&#12356;&#12418;&#12398;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
	&#13;
	&#13;
    <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>function(evt:Event):void</pre></div>&#13;
	&#13;
	<p>&#38306;&#25968;&#12398;&#21517;&#21069;&#12399;&#20219;&#24847;&#12395;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">useCapture</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>false</code>)<code></code> &#8212; &#13;
	&#13;
	<span>&#12522;&#12473;&#12490;&#12540;&#12364;&#12289;&#12461;&#12515;&#12503;&#12481;&#12515;&#27573;&#38542;&#12289;&#12414;&#12383;&#12399;&#12479;&#12540;&#12466;&#12483;&#12488;&#12362;&#12424;&#12403;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#12391;&#21205;&#20316;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#26029;&#12375;&#12414;&#12377;&#12290;<code>useCapture</code> &#12434; <code>true</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12522;&#12473;&#12490;&#12540;&#12399;&#12461;&#12515;&#12503;&#12481;&#12515;&#27573;&#38542;&#12398;&#12415;&#12391;&#12452;&#12505;&#12531;&#12488;&#12434;&#20966;&#29702;&#12375;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#27573;&#38542;&#12414;&#12383;&#12399;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#12391;&#12399;&#20966;&#29702;&#12375;&#12414;&#12379;&#12435;&#12290;<code>useCapture</code> &#12434; <code>false</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12522;&#12473;&#12490;&#12540;&#12399;&#12479;&#12540;&#12466;&#12483;&#12488;&#27573;&#38542;&#12414;&#12383;&#12399;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#12398;&#12415;&#12391;&#12452;&#12505;&#12531;&#12488;&#12434;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;3 &#12388;&#12398;&#27573;&#38542;&#12377;&#12409;&#12390;&#12391;&#12452;&#12505;&#12531;&#12488;&#12434;&#21463;&#12369;&#21462;&#12427;&#12395;&#12399;&#12289;<code>addEventListener</code> &#12434; 2 &#22238;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;<code>useCapture</code> &#12434; <code>true</code> &#12395;&#35373;&#23450;&#12375;&#12390;&#21628;&#12403;&#20986;&#12375;&#12289;<code>useCapture</code> &#12434; <code>false</code> &#12395;&#35373;&#23450;&#12375;&#12390;&#12418;&#12358;&#19968;&#24230;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;</span>&#13;
	&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">priority</span>:<a href="../../int.html">int</a></code> (default = <code>0</code>)<code></code> &#8212; &#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12398;&#20778;&#20808;&#24230;&#12524;&#12505;&#12523;&#12391;&#12377;&#12290;&#20778;&#20808;&#24230;&#12399;&#12289;&#31526;&#21495;&#20184;&#12365; 32 &#12499;&#12483;&#12488;&#25972;&#25968;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#25968;&#20516;&#12364;&#22823;&#12365;&#12367;&#12394;&#12427;&#12411;&#12393;&#20778;&#20808;&#24230;&#12364;&#39640;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#20778;&#20808;&#24230;&#12364; <i>n</i> &#12398;&#12377;&#12409;&#12390;&#12398;&#12522;&#12473;&#12490;&#12540;&#12399;&#12289;&#20778;&#20808;&#24230;&#12364; <i>n</i>-1 &#12398;&#12522;&#12473;&#12490;&#12540;&#12424;&#12426;&#12418;&#21069;&#12395;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12522;&#12473;&#12490;&#12540;&#12395;&#23550;&#12375;&#12390;&#21516;&#12376;&#20778;&#20808;&#24230;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12381;&#12428;&#12425;&#12399;&#36861;&#21152;&#12373;&#12428;&#12383;&#38918;&#30058;&#12395;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#20778;&#20808;&#24230;&#12399; 0 &#12391;&#12377;&#12290;&#13;
	&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">useWeakReference</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>false</code>)<code></code> &#8212; &#12522;&#12473;&#12490;&#12540;&#12408;&#12398;&#21442;&#29031;&#12364;&#24375;&#21442;&#29031;&#12392;&#24369;&#21442;&#29031;&#12398;&#12356;&#12378;&#12428;&#12391;&#12354;&#12427;&#12363;&#12434;&#21028;&#26029;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12354;&#12427;&#24375;&#21442;&#29031;&#12398;&#22580;&#21512;&#12399;&#12289;&#12522;&#12473;&#12490;&#12540;&#12398;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#22238;&#36991;&#12373;&#12428;&#12414;&#12377;&#12290;&#24369;&#21442;&#29031;&#12391;&#12399;&#22238;&#36991;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; <p>&#12463;&#12521;&#12473;&#12524;&#12505;&#12523;&#12513;&#12531;&#12496;&#12540;&#38306;&#25968;&#12399;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#23550;&#35937;&#22806;&#12391;&#12354;&#12427;&#12383;&#12417;&#12289;&#12463;&#12521;&#12473;&#12524;&#12505;&#12523;&#12513;&#12531;&#12496;&#12540;&#38306;&#25968;&#12398; <code>useWeakReference</code> &#12399;&#12289;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#21046;&#38480;&#12392;&#12399;&#28961;&#38306;&#20418;&#12395; <code>true</code> &#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12493;&#12473;&#12488;&#12373;&#12428;&#12383;&#20869;&#37096;&#12398;&#38306;&#25968;&#12391;&#12354;&#12427;&#12522;&#12473;&#12490;&#12540;&#12395;&#23550;&#12375;&#12390; <code>useWeakReference</code> &#12434; <code>true</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#38306;&#25968;&#12399;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12373;&#12428;&#12289;&#27704;&#32154;&#30340;&#12391;&#12399;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;inner &#38306;&#25968;&#12395;&#23550;&#12377;&#12427;&#21442;&#29031;&#12434;&#20316;&#25104;&#65288;&#21029;&#12398;&#22793;&#25968;&#12395;&#20445;&#23384;&#65289;&#12375;&#12383;&#22580;&#21512;&#12289;&#12381;&#12398;&#38306;&#25968;&#12399;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12373;&#12428;&#12378;&#12289;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#29366;&#24907;&#12398;&#12414;&#12414;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	</td></tr></table></div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="//apple_ref/cpp/Method/createMessageChannel()" class="dashAnchor" id="//apple_ref/cpp/Method/createMessageChannel()"></a><a name="createMessageChannel()" id="createMessageChannel()"></a><a name="createMessageChannel(flash.system.Worker)" id="createMessageChannel(flash.system.Worker)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>createMessageChannel</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function createMessageChannel(receiver:<a href="../../flash/system/Worker.html">Worker</a>):<a href="../../flash/system/MessageChannel.html">MessageChannel</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#26032;&#12375;&#12356; MessageChannel &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12390;&#12289;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#12527;&#12540;&#12459;&#12540;&#12363;&#12425;&#21029;&#12398;&#21463;&#20449;&#12527;&#12540;&#12459;&#12540;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;MessageChannel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;<code>receiver</code> &#24341;&#25968;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383; Worker &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21336;&#26041;&#21521;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#36865;&#20449;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p>MessageChannel &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12354;&#12427; Worker &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#21029;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12362;&#12424;&#12403;&#12487;&#12540;&#12479;&#12434;&#36865;&#20449;&#12377;&#12427;&#12398;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;Worker &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>setSharedProperty()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12391;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418; 1 &#12388;&#12398; MessageChannel &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20849;&#26377;&#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#12375;&#12390;&#23376; Worker &#12395;&#28193;&#12373;&#12428;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
    outgoingChannel = Worker.current.createMessageChannel(bgWorker);&#13;
    incomingChannel = bgWorker.createMessageChannel(Worker.current);&#13;
    &#13;
    bgWorker.setSharedProperty("incoming", outgoingChannel);&#13;
    bgWorker.setSharedProperty("outgoing", incomingChannel);&#13;
    &#13;
    // listen for messages from the receiving MessageChannel&#13;
    // This event is triggered when the background sends a message to this worker&#13;
    incomingChannel.addEventListener(Event.CHANNEL_MESSAGE, incomingMessageHandler);</pre></div>&#13;
    &#13;
    <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">receiver</span>:<a href="../../flash/system/Worker.html">Worker</a></code> &#8212; &#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21463;&#12369;&#21462;&#12427;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#20316;&#25104;&#12373;&#12428;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12481;&#12515;&#12531;&#12493;&#12523;&#12391;&#36865;&#20449;&#12373;&#12428;&#12427;&#13;
    &#13;
    </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/system/MessageChannel.html">MessageChannel</a></code> &#8212; &#25805;&#20316;&#12395;&#12424;&#12387;&#12390;&#20316;&#25104;&#12373;&#12428;&#12383; MessageChannel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#13;
    &#13;
    </td></tr></table></div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="//apple_ref/cpp/Method/getSharedProperty()" class="dashAnchor" id="//apple_ref/cpp/Method/getSharedProperty()"></a><a name="getSharedProperty()" id="getSharedProperty()"></a><a name="getSharedProperty(String)" id="getSharedProperty(String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>getSharedProperty</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function getSharedProperty(key:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#*">*</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#21517;&#21069;&#20184;&#12365;&#12398;&#12461;&#12540;&#12392;&#20849;&#12395;&#12371;&#12398;&#12527;&#12540;&#12459;&#12540;&#12395;&#26684;&#32013;&#12373;&#12428;&#12383;&#20516;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p>&#23376;&#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12527;&#12540;&#12459;&#12540; swf &#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12398;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12395;&#12354;&#12427;&#12398;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#26089;&#12356;&#20516;&#12434;&#25152;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">key</span>:<a href="../../String.html">String</a></code> &#8212; &#21462;&#24471;&#12377;&#12427;&#20849;&#26377;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#13;
    &#13;
    </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../specialTypes.html#*">*</a></code> &#8212; &#25351;&#23450;&#12373;&#12428;&#12383;&#12461;&#12540;&#12392;&#20849;&#12395;&#26684;&#32013;&#12373;&#12428;&#12383;&#20849;&#26377;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12289;&#12414;&#12383;&#12399;&#25351;&#23450;&#12373;&#12428;&#12383;&#12461;&#12540;&#12395;&#20516;&#12364;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399; <code>null</code> &#12391;&#12377;&#12290;&#13;
    &#13;
    </td></tr></table></div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="//apple_ref/cpp/Method/removeEventListener()" class="dashAnchor" id="//apple_ref/cpp/Method/removeEventListener()"></a><a name="removeEventListener()" id="removeEventListener()"></a><a name="removeEventListener(String,Function,Boolean)" id="removeEventListener(String,Function,Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>removeEventListener</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>override public function removeEventListener(type:<a href="../../String.html">String</a>, listener:<a href="../../Function.html">Function</a>, useCapture:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#13;
	EventDispatcher &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#23550;&#24540;&#12377;&#12427;&#12522;&#12473;&#12490;&#12540;&#12364; EventDispatcher &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12418;&#21177;&#26524;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#13;
	&#13;
	</p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">type</span>:<a href="../../String.html">String</a></code> &#8212; &#12452;&#12505;&#12531;&#12488;&#12398;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;&#13;
	&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">listener</span>:<a href="../../Function.html">Function</a></code> &#8212; &#21066;&#38500;&#12377;&#12427;&#12522;&#12473;&#12490;&#12540;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
	&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">useCapture</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>false</code>)<code></code> &#8212; &#13;
	&#13;
	<span>&#12522;&#12473;&#12490;&#12540;&#12364;&#12289;&#12461;&#12515;&#12503;&#12481;&#12515;&#27573;&#38542;&#12289;&#12414;&#12383;&#12399;&#12479;&#12540;&#12466;&#12483;&#12488;&#12362;&#12424;&#12403;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#12395;&#23550;&#12375;&#12390;&#30331;&#37682;&#12373;&#12428;&#12383;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12522;&#12473;&#12490;&#12540;&#12364;&#12461;&#12515;&#12503;&#12481;&#12515;&#27573;&#38542;&#12384;&#12369;&#12391;&#12394;&#12367;&#12479;&#12540;&#12466;&#12483;&#12488;&#27573;&#38542;&#12392;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#12395;&#12418;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;<code>removeEventListener()</code> &#12434; 2 &#22238;&#21628;&#12403;&#20986;&#12375;&#12390;&#20001;&#26041;&#12398;&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;1 &#22238;&#12399; <code>useCapture()</code> &#12434; <code>true</code> &#12395;&#35373;&#23450;&#12375;&#12289;&#12418;&#12358; 1 &#22238;&#12399; <code>useCapture()</code> &#12434; <code>false</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</span>&#13;
	&#13;
	</td></tr></table></div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="//apple_ref/cpp/Method/setSharedProperty()" class="dashAnchor" id="//apple_ref/cpp/Method/setSharedProperty()"></a><a name="setSharedProperty()" id="setSharedProperty()"></a><a name="setSharedProperty(String,any)" id="setSharedProperty(String,any)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>setSharedProperty</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function setSharedProperty(key:<a href="../../String.html">String</a>, value:<a href="../../specialTypes.html#*">*</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#12527;&#12540;&#12459;&#12540;&#12398; swf &#12391;&#23455;&#34892;&#12377;&#12427;&#12467;&#12540;&#12489;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#21517;&#21069;&#20184;&#12365;&#12398;&#20516;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p>&#12527;&#12540;&#12459;&#12540;&#12398; <code>start()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#21069;&#12395;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;&#20849;&#26377;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#27083;&#31689;&#26178;&#12395;&#12527;&#12540;&#12459;&#12540;&#12398; swf &#12398;&#12467;&#12540;&#12489;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <p><code>value</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#12399;&#12289;&#12411;&#12392;&#12435;&#12393;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20516;&#12392;&#12375;&#12390;&#28193;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#24460;&#36848;&#12398;&#20363;&#22806;&#12434;&#38500;&#12356;&#12390;&#12289;<code>value</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28193;&#12373;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#21442;&#29031;&#12363;&#12425;&#12399;&#28193;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;<code>setSharedProperty()</code> &#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#12363;&#12425;&#12354;&#12427;&#12527;&#12540;&#12459;&#12540;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#34892;&#12431;&#12428;&#12383;&#22793;&#26356;&#12399;&#12289;&#21029;&#12398;&#12527;&#12540;&#12459;&#12540;&#12395;&#12399;&#24341;&#12365;&#32153;&#12364;&#12428;&#12414;&#12379;&#12435;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; AMF3 &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#30452;&#21015;&#21270;&#12375;&#12289;&#21463;&#20449;&#12527;&#12540;&#12459;&#12540;&#12398;&#26032;&#12375;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#30452;&#21015;&#21270;&#35299;&#38500;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12289;AMF3 &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#30452;&#21015;&#21270;&#12391;&#12365;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;<code>value</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28193;&#12379;&#12414;&#12379;&#12435;&#12290;&#12459;&#12473;&#12479;&#12512;&#12463;&#12521;&#12473;&#12364;&#36969;&#20999;&#12395;&#28193;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12463;&#12521;&#12473;&#23450;&#32681;&#12399;&#12289;<code>flash.net.registerClassAlias()</code> &#38306;&#25968;&#12414;&#12383;&#12399; <code>[RemoteClass]</code> &#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20351;&#29992;&#12375;&#12390;&#30331;&#37682;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12393;&#12385;&#12425;&#12398;&#26041;&#27861;&#12391;&#12418;&#12289;&#20001;&#26041;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#12463;&#12521;&#12473;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#21516;&#12376;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12527;&#12540;&#12459;&#12540;&#38291;&#12391;&#20849;&#26377;&#12373;&#12428;&#12394;&#12356;&#12392;&#12356;&#12358;&#35215;&#21063;&#12398;&#20363;&#22806;&#12392;&#12375;&#12390;&#12289;5 &#12388;&#12398;&#12479;&#12452;&#12503;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <ul><li>Worker</li><li>MessageChannel</li><li>&#20849;&#26377;&#21487;&#33021; ByteArray&#65288;<code>shareable</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code>true</code> &#12395;&#35373;&#23450;&#12375;&#12383; ByteArray &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;</li><li>Mutex</li><li>Condition</li></ul><p>&#12371;&#12428;&#12425;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434; <code>value</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28193;&#12377;&#12392;&#12289;&#21508;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#21516;&#12376;&#22522;&#12395;&#12394;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#12354;&#12427;&#12527;&#12540;&#12459;&#12540;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#34892;&#12431;&#12428;&#12383;&#22793;&#26356;&#12399;&#12289;&#21029;&#12398;&#12527;&#12540;&#12459;&#12540;&#12391;&#21363;&#24231;&#12395;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<code>setSharedProperty()</code> &#12434;&#20351;&#29992;&#12375;&#12390; 2 &#22238;&#20197;&#19978;&#12381;&#12428;&#12425;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21516;&#12376;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#28193;&#12377;&#12392;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#21463;&#20449;&#12527;&#12540;&#12459;&#12540;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26032;&#12375;&#12356;&#12467;&#12500;&#12540;&#12434;&#20316;&#25104;&#12375;&#12414;&#12379;&#12435;&#12290;&#20195;&#12431;&#12426;&#12395;&#12289;&#21516;&#12376;&#21442;&#29031;&#12364;&#20877;&#21033;&#29992;&#12373;&#12428;&#12289;&#12471;&#12473;&#12486;&#12512;&#12513;&#12514;&#12522;&#12398;&#20351;&#29992;&#12434;&#28187;&#12425;&#12375;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <p><code>value</code> &#24341;&#25968;&#12395; <code>null</code> &#12414;&#12383;&#12399; <code>undefined</code> &#12434;&#25351;&#23450;&#12375;&#12390;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383; <code>key</code> &#24341;&#25968;&#12395;&#20197;&#21069;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12383;&#20516;&#12434;&#12463;&#12522;&#12450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#26041;&#27861;&#12391;&#20516;&#12434;&#12463;&#12522;&#12540;&#12531;&#12450;&#12483;&#12503;&#12377;&#12427;&#12392;&#12289;&#20516;&#12408;&#12398;&#21442;&#29031;&#12434;&#21066;&#38500;&#12375;&#12289;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#21454;&#38598;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <p>key &#24341;&#25968;&#12395;&#12377;&#12409;&#12390;&#12398; String &#20516;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#20849;&#26377;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12527;&#12540;&#12459;&#12540;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#25345;&#12388;&#12377;&#12409;&#12390;&#12398;&#12467;&#12540;&#12489;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#24847;&#22259;&#12375;&#12394;&#12356;&#20516;&#12398;&#19978;&#26360;&#12365;&#12434;&#22238;&#36991;&#12377;&#12427;&#12395;&#12399;&#12289;&#12461;&#12540;&#21517;&#12364;&#19968;&#24847;&#12395;&#12394;&#12427;&#12424;&#12358;&#12395;&#12375;&#12289;&#25509;&#38957;&#36766;&#12289;&#25509;&#23614;&#36766;&#12289;&#12414;&#12383;&#12399;&#21516;&#27096;&#12398;&#12513;&#12459;&#12491;&#12474;&#12512;&#12398;&#20351;&#29992;&#12434;&#26908;&#35342;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
    &#13;
    <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">key</span>:<a href="../../String.html">String</a></code> &#8212; &#20849;&#26377;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#26684;&#32013;&#12373;&#12428;&#12427;&#21517;&#21069;&#12391;&#12377;&#12290;&#13;
    </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">value</span>:<a href="../../specialTypes.html#*">*</a></code> &#8212; &#20849;&#26377;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12391;&#12377;&#12290;&#13;
    &#13;
    </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="MessageChannel.html" target="">MessageChannel &#12463;&#12521;&#12473;</a><br /><a href="../../flash/utils/ByteArray.html#shareable" target="">ByteArray.shareable &#12503;&#12525;&#12497;&#12486;&#12451;</a><br /><a href="../../flash/concurrent/Mutex.html" target="">Mutex &#12463;&#12521;&#12473;</a><br /><a href="../../flash/concurrent/Condition.html" target="">Condition &#12463;&#12521;&#12473;</a></div></div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="//apple_ref/cpp/Method/start()" class="dashAnchor" id="//apple_ref/cpp/Method/start()"></a><a name="start()" id="start()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>start</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function start():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#12527;&#12540;&#12459;&#12540;&#12398;&#23455;&#34892;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12527;&#12540;&#12459;&#12540;&#12473;&#12524;&#12483;&#12489;&#12434;&#20316;&#25104;&#12375;&#12289;&#12527;&#12540;&#12459;&#12540; swf &#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12398;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p>&#12371;&#12398;&#25805;&#20316;&#12399;&#38750;&#21516;&#26399;&#12391;&#12377;&#12290;&#12527;&#12540;&#12459;&#12540;&#12398;&#36215;&#21205;&#12364;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;&#12527;&#12540;&#12459;&#12540;&#12399; <code>state</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code>WorkerState.RUNNING</code> &#12395;&#22793;&#26356;&#12375;&#12289;<code>workerState</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12375;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    &#13;
    </div></span><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="//apple_ref/cpp/Method/terminate()" class="dashAnchor" id="//apple_ref/cpp/Method/terminate()"></a><a name="terminate()" id="terminate()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>terminate</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function terminate():<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
    &#12371;&#12398;&#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#23455;&#34892;&#12434;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;&#12527;&#12540;&#12459;&#12540;&#12398; swf &#12398;&#29694;&#22312;&#12398;&#12377;&#12409;&#12390;&#12398; ActionScript &#12434;&#20013;&#27490;&#12375;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Boolean.html">Boolean</a></code> &#8212; &#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12390;&#20013;&#26029;&#12375;&#12383;&#22580;&#21512;&#12399; <code>true</code>&#12289;&#12527;&#12540;&#12459;&#12540;&#12364;&#36215;&#21205;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399; <code>false</code>&#13;
    &#13;
    </td></tr></table></div></span><div class="detailSectionHeader"> &#12452;&#12505;&#12531;&#12488;&#12398;&#35443;&#32048; </div><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="event:workerState" id="event:workerState"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>workerState</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/Event.html"><code>flash.events.Event</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; Event.type  =  </span><a href="../../flash/events/Event.html#WORKER_STATE"><code>flash.events.Event.WORKER_STATE</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
&#12527;&#12540;&#12459;&#12540;&#12398; <code>state</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;  &#13;
&#13;
</p>&#13;
	<code>Event.WORKER_STATE</code> &#23450;&#25968;&#12399;&#12289;<code>workerState</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#13;
 	&#13;
 	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 	&#13;
 	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12375;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr></table></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">WorkerExample.as</div><br /><div class="detailBody"> &#27425;&#12395;&#12289;&#12479;&#12473;&#12463;&#12434;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12391;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12398; Worker &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20351;&#29992;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12527;&#12540;&#12459;&#12540;&#38291;&#12391;&#12459;&#12473;&#12479;&#12512;&#12463;&#12521;&#12473;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#28193;&#12377;&#12398;&#12434;&#21547;&#12416;&#12289;&#35242;&#12527;&#12540;&#12459;&#12540;&#12392;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#38291;&#12398;&#36890;&#20449;&#12418;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>&#12371;&#12398;&#20363;&#12399;&#12289;3 &#12388;&#12398; ActionScript &#12463;&#12521;&#12473;&#12391;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;WorkerExample &#12399;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12391;&#12289;&#35242;&#12527;&#12540;&#12459;&#12540;&#12391;&#12377;&#12290;BackgroundWorker &#12399;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12391;&#21205;&#20316;&#12377;&#12427;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540; swf &#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12392;&#12375;&#12390;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;CountResult &#12399;&#12289;&#35079;&#25968;&#12398;&#20516;&#12391;&#12394;&#12367;&#21336;&#19968;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390; 2 &#12388;&#12398;&#12527;&#12540;&#12459;&#12540;&#38291;&#12391;&#12487;&#12540;&#12479;&#12434;&#28193;&#12377;&#12398;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12459;&#12473;&#12479;&#12512;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;</p>&#13;
 &#13;
 <p>&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12399;&#35242;&#12527;&#12540;&#12459;&#12540;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#25968;&#12414;&#12391;&#12523;&#12540;&#12503;&#12375;&#12390;&#12459;&#12454;&#12531;&#12488;&#12375;&#12414;&#12377;&#12290;&#20316;&#26989;&#12364;&#36914;&#12416;&#12395;&#24467;&#12387;&#12390;&#12289;&#36914;&#34892;&#29366;&#27841;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35242;&#12527;&#12540;&#12459;&#12540;&#12395;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;&#26368;&#24460;&#12395;&#12289;&#12459;&#12454;&#12531;&#12488;&#12364;&#32066;&#20102;&#12377;&#12427;&#12392;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#32066;&#20102;&#12375;&#12383;&#12371;&#12392;&#12392;&#12459;&#12454;&#12531;&#12488;&#12395;&#12363;&#12363;&#12387;&#12383;&#26178;&#38291;&#12434;&#36890;&#30693;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35242;&#12527;&#12540;&#12459;&#12540;&#12395;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
 <p>WorkerExample &#12463;&#12521;&#12473;&#12399; swf &#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12394;&#12398;&#12391;&#12289;&#22522;&#26412;&#12527;&#12540;&#12459;&#12540;&#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;<code>initialize()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#12399;&#12289;&#12467;&#12540;&#12489;&#12399;&#12289;BackgroundWorker &#12463;&#12521;&#12473;&#12398;&#12496;&#12452;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;<code>[Embed]</code> &#12479;&#12464;&#12434;&#20351;&#29992;&#12375;&#12390;&#22475;&#12417;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
 <p><code>WorkerDomain.createWorker()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12434;&#20316;&#25104;&#12375;&#12383;&#24460;&#12289;&#12467;&#12540;&#12489;&#12399;&#12527;&#12540;&#12459;&#12540;&#38291;&#12398;&#36890;&#20449;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#26368;&#21021;&#12395;&#12289;&#12467;&#12540;&#12489;&#12399; MessageChannel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12475;&#12483;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;<code>setSharedProperty()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12395;&#12371;&#12428;&#12425;&#12434;&#28193;&#12375;&#12414;&#12377;&#12290;&#26368;&#24460;&#12395;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489; Worker &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>workerState</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#30331;&#37682;&#12375;&#12289;<code>start()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12527;&#12540;&#12459;&#12540;&#12434;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
 <p>&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12364;&#20316;&#26989;&#12434;&#36914;&#12417;&#12427;&#12395;&#24467;&#12387;&#12390;&#12289;&#36914;&#34892;&#29366;&#27841;&#65288;&#12362;&#12424;&#12403;&#26368;&#32066;&#32080;&#26524;&#65289;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35242;&#12527;&#12540;&#12459;&#12540;&#12395;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;&#35242;&#12527;&#12540;&#12459;&#12540;&#12399;&#12289;&#12371;&#12398;&#24773;&#22577;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12503;&#12525;&#12464;&#12524;&#12473;&#12496;&#12540;&#12392;&#12486;&#12461;&#12473;&#12488;&#12452;&#12531;&#12472;&#12465;&#12540;&#12479;&#12540;&#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;</p>&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
package&#13;
{&#13;
    import com.adobe.example.vo.CountResult;&#13;
    &#13;
    import flash.display.Shape;&#13;
    import flash.display.Sprite;&#13;
    import flash.display.StageAlign;&#13;
    import flash.display.StageScaleMode;&#13;
    import flash.events.Event;&#13;
    import flash.net.registerClassAlias;&#13;
    import flash.system.MessageChannel;&#13;
    import flash.system.Worker;&#13;
    import flash.system.WorkerDomain;&#13;
    import flash.system.WorkerState;&#13;
    import flash.text.TextField;&#13;
    import flash.text.TextFormat;&#13;
    import flash.text.TextFormatAlign;&#13;
    import flash.utils.ByteArray;&#13;
    &#13;
    public class WorkerExample extends Sprite&#13;
    {&#13;
        // ------- Embed the background worker swf as a ByteArray -------&#13;
        [Embed(source="../workerswfs/BackgroundWorker.swf", mimeType="application/octet-stream")]&#13;
        private static var BackgroundWorker_ByteClass:Class;&#13;
        public static function get BackgroundWorker():ByteArray&#13;
        {&#13;
            return new BackgroundWorker_ByteClass();&#13;
        }&#13;
        &#13;
        &#13;
        private var bgWorker:Worker;&#13;
        private var bgWorkerCommandChannel:MessageChannel;&#13;
        private var progressChannel:MessageChannel;&#13;
        private var resultChannel:MessageChannel;&#13;
        &#13;
        &#13;
        public function WorkerExample()&#13;
        {&#13;
            initialize();&#13;
        }&#13;
        &#13;
        &#13;
        private function initialize():void&#13;
        {&#13;
            // create the user interface&#13;
            setupStage();&#13;
            createStatusText();&#13;
            createProgressBar();&#13;
            &#13;
            // Register the alias so we can pass CountResult objects between workers&#13;
            registerClassAlias("com.adobe.test.vo.CountResult", CountResult);&#13;
            &#13;
            // Create the background worker&#13;
            bgWorker = WorkerDomain.current.createWorker(BackgroundWorker);&#13;
            &#13;
            // Set up the MessageChannels for communication between workers&#13;
            bgWorkerCommandChannel = Worker.current.createMessageChannel(bgWorker);&#13;
            bgWorker.setSharedProperty("incomingCommandChannel", bgWorkerCommandChannel);&#13;
            &#13;
            progressChannel = bgWorker.createMessageChannel(Worker.current);&#13;
            progressChannel.addEventListener(Event.CHANNEL_MESSAGE, handleProgressMessage)&#13;
            bgWorker.setSharedProperty("progressChannel", progressChannel);&#13;
            &#13;
            resultChannel = bgWorker.createMessageChannel(Worker.current);&#13;
            resultChannel.addEventListener(Event.CHANNEL_MESSAGE, handleResultMessage);&#13;
            bgWorker.setSharedProperty("resultChannel", resultChannel);&#13;
            &#13;
            // Start the worker&#13;
            bgWorker.addEventListener(Event.WORKER_STATE, handleBGWorkerStateChange);&#13;
            bgWorker.start();&#13;
        }&#13;
        &#13;
        &#13;
        private function handleBGWorkerStateChange(event:Event):void&#13;
        {&#13;
            if (bgWorker.state == WorkerState.RUNNING) &#13;
            {&#13;
                _statusText.text = "Background worker started";&#13;
                bgWorkerCommandChannel.send(["startCount", 100000000]);&#13;
            }&#13;
        }&#13;
        &#13;
        &#13;
        private function handleProgressMessage(event:Event):void&#13;
        {&#13;
            var percentComplete:Number = progressChannel.receive();&#13;
            setPercentComplete(percentComplete);&#13;
            _statusText.text = Math.round(percentComplete).toString() + "% complete";&#13;
        }&#13;
        &#13;
        &#13;
        private function handleResultMessage(event:Event):void&#13;
        {&#13;
            var result:CountResult = resultChannel.receive() as CountResult;&#13;
            setPercentComplete(100);&#13;
            _statusText.text = "Counted to " + result.countTarget + " in " + (Math.round(result.countDurationSeconds * 10) / 10) + " seconds";&#13;
        }&#13;
        &#13;
        &#13;
        // ------- Create UI -------&#13;
        &#13;
        private var _currentPercentComplete:int = 0;&#13;
        private var _needsValidation:Boolean = false;&#13;
        private var _statusText:TextField;&#13;
        private var _progressBarRect:Shape;&#13;
        private var _progressBar:Shape;&#13;
        &#13;
        private function setupStage():void&#13;
        {&#13;
            stage.align = StageAlign.TOP_LEFT;&#13;
            stage.scaleMode = StageScaleMode.NO_SCALE;&#13;
            stage.stageWidth = 800;&#13;
            stage.stageHeight = 600;&#13;
            stage.color = 0xffffff;&#13;
        }&#13;
        &#13;
        &#13;
        private function createStatusText():void&#13;
        {&#13;
            _statusText = new TextField();&#13;
            _statusText.width = 400;&#13;
            _statusText.height = 25;&#13;
            _statusText.x = (stage.stageWidth - _statusText.width) / 2;&#13;
            _statusText.y = 150;&#13;
            &#13;
            var statusTextFormat:TextFormat = new TextFormat();&#13;
            statusTextFormat.color = 0xeeeeee;&#13;
            statusTextFormat.font = "Verdana";&#13;
            statusTextFormat.align = TextFormatAlign.CENTER;&#13;
            statusTextFormat.size = 16;&#13;
            _statusText.defaultTextFormat = statusTextFormat;&#13;
            _statusText.wordWrap = false;&#13;
            _statusText.opaqueBackground = 0x999999;&#13;
            _statusText.selectable = false;&#13;
            &#13;
            _statusText.text = "Initializing...";&#13;
            &#13;
            addChild(_statusText);&#13;
        }&#13;
        &#13;
        &#13;
        private function createProgressBar():void&#13;
        {&#13;
            _progressBarRect = new Shape();&#13;
            _progressBarRect.graphics.beginFill(0x000000, 0);&#13;
            _progressBarRect.graphics.lineStyle(2, 0x000000);&#13;
            _progressBarRect.graphics.drawRect(0, 0, 400, 30);&#13;
            _progressBarRect.graphics.endFill();&#13;
            &#13;
            _progressBarRect.x = (stage.stageWidth - _progressBarRect.width) / 2;&#13;
            _progressBarRect.y = 100;&#13;
            &#13;
            addChild(_progressBarRect);&#13;
            &#13;
            _progressBar = new Shape();&#13;
            _progressBar.graphics.beginFill(0x0000ee);&#13;
            _progressBar.graphics.drawRect(0, 0, 391, 21);&#13;
            _progressBar.x = _progressBarRect.x + 4;&#13;
            _progressBar.y = _progressBarRect.y + 4;&#13;
            &#13;
            addChild(_progressBar);&#13;
            &#13;
            _progressBar.scaleX = 0;&#13;
        }&#13;
        &#13;
        private function setPercentComplete(percentComplete:int):void&#13;
        {&#13;
            if (_currentPercentComplete == percentComplete)&#13;
                return;&#13;
            &#13;
            _currentPercentComplete = percentComplete;&#13;
            invalidateValue();&#13;
        }&#13;
        &#13;
        &#13;
        private function invalidateValue():void&#13;
        {&#13;
            if (_needsValidation)&#13;
                return;&#13;
            &#13;
            _needsValidation = true;&#13;
            addEventListener(Event.EXIT_FRAME, validate);&#13;
        }&#13;
        &#13;
        private function validate(event:Event):void&#13;
        {&#13;
            removeEventListener(Event.EXIT_FRAME, validate);&#13;
            _needsValidation = false;&#13;
            &#13;
            _redrawProgressBar();&#13;
        }&#13;
        &#13;
        private function _redrawProgressBar():void&#13;
        {&#13;
            _progressBar.scaleX = _currentPercentComplete / 100;&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><span id="pageFilter"><div class="exampleHeader">WorkerExample.BackgroundWorker.as</div><br /><div class="detailBody"> &#12371;&#12398;&#12463;&#12521;&#12473;&#12395;&#12399;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12398;&#12467;&#12540;&#12489;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12463;&#12521;&#12473;&#12399;&#12289;&#29420;&#33258;&#12398; swf &#12501;&#12449;&#12452;&#12523;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12381;&#12398; swf &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12513;&#12452;&#12531; swf &#12395;&#22475;&#12417;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p><code>initialize()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#12289;&#35242;&#12527;&#12540;&#12459;&#12540;&#12364;&#28193;&#12375;&#12383; MessageChannel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21463;&#20449;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;2 &#12388;&#12398;&#12527;&#12540;&#12459;&#12540;&#38291;&#12398;&#36890;&#20449;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
 <p>&#35242;&#12527;&#12540;&#12459;&#12540;&#12399; <code>commandChannel</code> &#12513;&#12483;&#12475;&#12540;&#12472;&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#23550;&#12375;&#12390; <code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#20869;&#12391;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#12364; <code>handleCommandMessage()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390; <code>channelMessage</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
 <p>&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12398;&#23455;&#38555;&#12398;&#20316;&#26989;&#12399;&#12289;<code>count()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12527;&#12540;&#12459;&#12540;&#12364;&#12459;&#12454;&#12531;&#12488;&#12434;&#36914;&#12417;&#12427;&#12395;&#24467;&#12387;&#12390;&#12289;<code>progressChannel</code> MessageChannel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390; <code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#36914;&#34892;&#29366;&#27841;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35242;&#12527;&#12540;&#12459;&#12540;&#12395;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;&#12459;&#12454;&#12531;&#12488;&#12364;&#32066;&#20102;&#12377;&#12427;&#12392;&#12289;<code>resultChannel</code> MessageChannel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390; <code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;</p>&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
package com.adobe.example.workers&#13;
{&#13;
    import com.adobe.example.vo.CountResult;&#13;
    &#13;
    import flash.display.Sprite;&#13;
    import flash.events.Event;&#13;
    import flash.net.registerClassAlias;&#13;
    import flash.system.MessageChannel;&#13;
    import flash.system.Worker;&#13;
    import flash.utils.getTimer;&#13;
    &#13;
    public class BackgroundWorker extends Sprite&#13;
    {&#13;
        private var commandChannel:MessageChannel;&#13;
        private var progressChannel:MessageChannel;&#13;
        private var resultChannel:MessageChannel;&#13;
        &#13;
        &#13;
        public function BackgroundWorker()&#13;
        {&#13;
            initialize();&#13;
        }&#13;
        &#13;
        &#13;
        private function initialize():void&#13;
        {&#13;
            registerClassAlias("com.adobe.test.vo.CountResult", CountResult);&#13;
            &#13;
            // Get the MessageChannel objects to use for communicating between workers&#13;
            // This one is for receiving messages from the parent worker&#13;
            commandChannel = Worker.current.getSharedProperty("incomingCommandChannel") as MessageChannel;&#13;
            commandChannel.addEventListener(Event.CHANNEL_MESSAGE, handleCommandMessage);&#13;
            // These are for sending messages to the parent worker&#13;
            progressChannel = Worker.current.getSharedProperty("progressChannel") as MessageChannel;&#13;
            resultChannel = Worker.current.getSharedProperty("resultChannel") as MessageChannel;&#13;
        }        &#13;
        &#13;
        &#13;
        private function handleCommandMessage(event:Event):void&#13;
        {&#13;
            if (!commandChannel.messageAvailable)&#13;
                return;&#13;
            &#13;
            var message:Array = commandChannel.receive() as Array;&#13;
            &#13;
            if (message != null &amp;&amp; message[0] == "startCount")&#13;
            {&#13;
                count(uint(message[1]));&#13;
            }&#13;
        }&#13;
        &#13;
        &#13;
        private function count(targetValue:uint):void&#13;
        {&#13;
            var startTime:int = getTimer();&#13;
            var onePercent:uint = uint(Math.ceil(targetValue / 100));&#13;
            var oneHalfPercent:Number = onePercent / 2;&#13;
            &#13;
            var i:uint = 0;&#13;
            while (i &lt; targetValue)&#13;
            {&#13;
                i++;&#13;
                // only send progress messages every one-half-percent milestone&#13;
                // to avoid flooding the message channel&#13;
                if (i % oneHalfPercent == 0)&#13;
                {&#13;
                    progressChannel.send(i / onePercent);&#13;
                }&#13;
            }&#13;
            &#13;
            var elapsedTime:int = getTimer() - startTime;&#13;
            var result:CountResult = new CountResult(targetValue, elapsedTime / 1000);&#13;
            resultChannel.send(result);&#13;
            &#13;
            trace("counted to", targetValue.toString(), "in", elapsedTime, "milliseconds");&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><span id="pageFilter"><div class="exampleHeader">WorkerExample.CountResult.as</div><br /><div class="detailBody"> &#12371;&#12398;&#12463;&#12521;&#12473;&#12399;&#12289;CountResult &#20516;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;2 &#12388;&#12398;&#12527;&#12540;&#12459;&#12540;&#38291;&#12391;&#28193;&#12373;&#12428;&#12427;&#12459;&#12473;&#12479;&#12512;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;&#12527;&#12540;&#12459;&#12540;&#38291;&#12391;&#12459;&#12473;&#12479;&#12512;&#12463;&#12521;&#12473;&#12434;&#28193;&#12377;&#12395;&#12399;&#12289;&#21508;&#12527;&#12540;&#12459;&#12540;&#12364;&#12289;&#21516;&#12376;&#12456;&#12452;&#12522;&#12450;&#12473;&#21517;&#12434;&#20351;&#29992;&#12375;&#12390; <code>registerClassAlias()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
package com.adobe.example.vo&#13;
{&#13;
    public class CountResult&#13;
    {&#13;
        public function CountResult(countTarget:uint=0, countTime:Number=0)&#13;
        {&#13;
            this.countTarget = countTarget;&#13;
            this.countDurationSeconds = countTime;&#13;
        }&#13;
        &#13;
        public var countTarget:uint;&#13;
        public var countDurationSeconds:Number;&#13;
    }&#13;
}&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>