<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:10" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:1.5" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:10" /><meta name="product" content="air" /><meta name="productver" content="air:1.5" /><meta name="product" content="flex" /><meta name="prodver" content="flex:4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="DataGridAccImpl,spark.accessibility.DataGridAccImpl,enableAccessibility" /><title>DataGridAccImpl - Adobe ActionScript&#174; 3&#65288;AS3  Flex&#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">spark.accessibility</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  DataGridAccImpl</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">DataGridAccImpl  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../spark/accessibility/ListBaseAccImpl.html">ListBaseAccImpl</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../mx/accessibility/AccImpl.html">AccImpl</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/accessibility/AccessibilityImplementation.html">AccessibilityImplementation</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
  &#12371;&#12428;&#12399;&#12289;spark.components.DataGrid &#12398;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;&#13;
 &#13;
  <p>Spark &#12398; DataGrid &#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#12392;&#12289;&#12381;&#12398; <code>focusOwner</code> &#23376;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>accessibilityImplementation</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12371;&#12398;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12399;&#12289;&#12371;&#12398;&#12503;&#12524;&#12540;&#12473;&#12507;&#12523;&#12480;&#12540; <code>focusOwner</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#37197;&#32622;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;DataGrid &#12398;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12364;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12434;&#35206;&#12356;&#38560;&#12377;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;DataGrid &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#33258;&#20307;&#12399;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12434;&#25345;&#12385;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#24037;&#31243;&#12399;&#12289;&#29694;&#22312;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; Flash Player &#12391;&#35079;&#25968;&#12524;&#12505;&#12523;&#12398; MSAA &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12395;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#20219;&#24847;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#23436;&#20840;&#12394; MSAA &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; MSAA &#12484;&#12522;&#12540;&#27083;&#36896;&#20869;&#12391;&#12289;DataGrid &#12398;&#20804;&#24351;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#21508;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12399;&#12289;&#12381;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12395;&#12424;&#12387;&#12390;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;CheckBox &#12398;&#22580;&#21512;&#12399; <code>CheckBoxAccImpl</code> &#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12364;&#23384;&#22312;&#12377;&#12427;&#12398;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#23384;&#22312;&#20013;&#12398;&#12415;&#12391;&#12377;&#12290;&#12414;&#12383;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12427;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12399;&#19968;&#24230;&#12395; 1 &#12388;&#12398;&#12415;&#12391;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12398;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#24120;&#12395; 1 &#12414;&#12383;&#12399; 0 &#20491;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <code>DataGrid</code> &#12463;&#12521;&#12473;&#12391; 2 &#12388;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#19978;&#26360;&#12365;&#12373;&#12428;&#12289;<code>DataGrid</code> &#12392; <code>DataGrid</code> &#12398;&#23376; <code>focusOwner</code> &#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12364;&#36969;&#20999;&#12395;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;<code>GridItemRenderer</code> &#12463;&#12521;&#12473;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12524;&#12531;&#12480;&#12521;&#12540;&#12398;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#12434;&#12458;&#12501;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12450;&#12452;&#12486;&#12512;&#12524;&#12531;&#12480;&#12521;&#12540;&#12399;&#12289;DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#37197;&#19979;&#12398;&#21336;&#32020;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#20966;&#29702;&#12373;&#12428;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#38750;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#65288;CheckBox &#12420; Panel &#12394;&#12393;&#65289;&#12398; DataGrid &#20869;&#12391;&#12398;&#20351;&#29992;&#29992;&#36884;&#12364;&#21046;&#38480;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12425;&#12398;&#12450;&#12452;&#12486;&#12512;&#12364; MSAA &#12484;&#12522;&#12540;&#20869;&#12391; DataGrid &#12398;&#20804;&#24351;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;MSAA &#12484;&#12522;&#12540;&#20869;&#12391;&#12377;&#12409;&#12390;&#12398;&#12464;&#12522;&#12483;&#12489;&#12450;&#12452;&#12486;&#12512;&#12524;&#12531;&#12480;&#12521;&#12540;&#12434; DataGrid &#12398;&#20804;&#24351;&#12392;&#12375;&#12390;&#34920;&#31034;&#12377;&#12427;&#12392;&#12289;&#12473;&#12463;&#12522;&#12540;&#12531;&#12522;&#12540;&#12480;&#12540;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#22823;&#12365;&#12394;&#28151;&#20081;&#12434;&#19982;&#12360;&#12414;&#12377;&#12290;&#12450;&#12452;&#12486;&#12512;&#12524;&#12531;&#12480;&#12521;&#12540;&#12395;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12420;&#38306;&#36899;&#24615;&#12364;&#27424;&#33853;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12524;&#12531;&#12480;&#12521;&#12540;&#12391;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12484;&#12522;&#12540;&#12395;&#34920;&#31034;&#12373;&#12379;&#12427;&#24517;&#35201;&#12364;&#12354;&#12428;&#12400;&#12289;&#38283;&#30330;&#32773;&#12364;&#12371;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12381;&#12398;&#24460;&#12289;Flash Player &#12391;&#12371;&#12398;&#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#12473;&#12463;&#12522;&#12540;&#12531;&#12522;&#12540;&#12480;&#12540;&#12394;&#12393;&#12398; MSAA &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391; DataGrid &#12398;&#34920;&#31034;&#12392;&#25805;&#20316;&#12364;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12463;&#12521;&#12473;&#12392; MSAA &#12398;&#32972;&#26223;&#24773;&#22577;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;mx.accessibility.AccImpl &#12362;&#12424;&#12403; flash.accessibility.AccessibilityImplementation &#12463;&#12521;&#12473;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <code>DataGridAccImpl</code> &#12399; <code>ListBaseAccImpl</code> &#12434;&#25313;&#24373;&#12375;&#12414;&#12377;&#65288;<code>DataGrid</code> &#12364;&#12289;<code>ListBase</code> &#12463;&#12521;&#12473;&#12434;&#25313;&#24373;&#12377;&#12427; <code>DataGridBase</code> &#12434;&#25313;&#24373;&#12377;&#12427;&#12383;&#12417;&#65289;&#12290;Spark <code>DataGridAccImpl</code> &#12395;&#26368;&#12418;&#39006;&#20284;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399; MX <code>AdvancedDataGridAccImpl</code> &#12391;&#12377;&#12290;AdvancedDataGrid &#12391;&#12418;&#21336;&#19968;&#12475;&#12523;&#12392;&#21336;&#19968;&#34892;&#12398;&#36984;&#25246;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399; MX DataGrid &#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#23376;</b>&#13;
               </p>&#13;
 &#13;
               <p>DataGrid &#12398;&#23376; MSAA &#12399;&#27425;&#12398;&#38918;&#24207;&#12395;&#12394;&#12426;&#12414;&#12377;</p>&#13;
               <ul><li>&#21508;&#21487;&#35222;&#12504;&#12483;&#12480;&#12540;&#12475;&#12523;&#12395;&#12388;&#12365; 1 &#12388;&#12398;&#23376;&#65288;&#24038;&#12363;&#12425;&#38918;&#12395;&#65289;&#12290;&#12371;&#12371;&#12391;&#12398;&#12300;&#21487;&#35222;&#12301;&#12392;&#12399;&#12289;&#38283;&#30330;&#32773;&#12364;&#38750;&#34920;&#31034;&#65288;<code>column.visible=false</code>&#65289;&#12395;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;&#12290;&#38283;&#30330;&#32773;&#12364;&#19981;&#21487;&#35222;&#12395;&#12375;&#12390;&#12356;&#12394;&#12356;&#21015;&#12398;&#12504;&#12483;&#12480;&#12540;&#12391;&#12289;&#12473;&#12463;&#12525;&#12540;&#12523;&#12395;&#12424;&#12387;&#12390;&#30011;&#38754;&#22806;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#21015;&#12398;&#12504;&#12483;&#12480;&#12540;&#12399;&#12300;&#21487;&#35222;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#34892;&#36984;&#25246;&#12514;&#12540;&#12489;&#12398;&#22580;&#21512;&#12289;&#12464;&#12522;&#12483;&#12489;&#20869;&#12398;&#21508;&#12487;&#12540;&#12479;&#34892;&#12395;&#12388;&#12356;&#12390; 1 &#12388;&#12398;&#23376;&#12289;&#12414;&#12383;&#12399;&#12289;</li>&#13;
                  <li>&#12475;&#12523;&#36984;&#25246;&#12514;&#12540;&#12489;&#12398;&#22580;&#21512;&#12289;&#12464;&#12522;&#12483;&#12489;&#20869;&#12398;&#21508;&#12475;&#12523;&#12395;&#12388;&#12356;&#12390; 1 &#12388;&#12398;&#23376;&#12290;&#19981;&#21487;&#35222;&#65288;&#35500;&#26126;&#12398;&#12392;&#12362;&#12426;&#65289;&#21015;&#12398;&#23376;&#12399;&#38500;&#12365;&#12414;&#12377;&#12290;</li>&#13;
               </ul><p>&#23376;&#12398;&#25968;&#12399;&#12289;&#29694;&#22312;&#30011;&#38754;&#12395;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12452;&#12486;&#12512;&#12398;&#25968;&#12391;&#12399;&#12394;&#12367;&#12289;<code>dataProvider</code> &#20869;&#12398;&#34892;&#12392;&#21015;&#12398;&#25968;&#12391;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <code>ListBase</code> &#12398;&#22580;&#21512;&#12392;&#30064;&#12394;&#12426;&#12289;DataGrid &#12398;&#23376;&#12398;&#25968;&#12399;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#20869;&#12398;&#12487;&#12540;&#12479;&#34892;&#25968;&#12434;&#21453;&#26144;&#12375;&#12383;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;&#35036;&#21161;&#12486;&#12463;&#12494;&#12525;&#12472;&#12391; <code>AccChildCount</code> &#12434;&#34892;&#25968;&#12398;&#36890;&#30693;&#25163;&#27573;&#12392;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#36991;&#12369;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398; DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12391;&#12399;&#20966;&#29702;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#24441;&#21106;</b>&#13;
               </p>&#13;
 &#13;
               <p>DataGrid &#12398; MSAA Role &#12399; <code>ROLE_SYSTEM_LIST</code> &#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>DataGrid &#20869;&#12398;&#21508;&#12487;&#12540;&#12479;&#34892;&#12414;&#12383;&#12399;&#21508;&#12487;&#12540;&#12479;&#12475;&#12523;&#12398; Role &#12399; <code>ROLE_SYSTEM_LISTITEM</code> &#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>DataGrid &#20869;&#12398;&#21508;&#12504;&#12483;&#12480;&#12540;&#12475;&#12523;&#12398; Role &#12399; <code>ROLE_SYSTEM_COLUMNHEADER</code> &#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398; DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12391;&#12399;&#20966;&#29702;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#21517;&#21069;</b>&#13;
               </p>&#13;
 &#13;
               <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;DataGrid &#12398; MSAA Name &#12399;&#31354;&#12398;&#25991;&#23383;&#21015;&#12391;&#12377;&#12290;<code>FormItem</code> &#12456;&#12524;&#12513;&#12531;&#12488;&#20869;&#12395;&#12521;&#12483;&#12503;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398; Name &#12399; FormItem &#12398;&#12521;&#12505;&#12523;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#21205;&#20316;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12377;&#12427;&#12395;&#12399;&#12289;DataGrid &#12398; <code>accessibilityName</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<code>accessibilityName</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;DataGrid &#12434;&#34920;&#12377; DataGrid &#12398; <code>focusOwner</code> &#23376;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12371;&#12398;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#21517;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#21508;&#12487;&#12540;&#12479;&#34892;&#12398; Name&#65288;&#34892;&#36984;&#25246;&#12514;&#12540;&#12489;&#12398;&#22580;&#21512;&#65289;&#12399;&#12289;&#12300;_column1Name_: _column1Value_, _column2Name_: _column2Value_, ..., _columnNName_: _columnNValue_, Row _m_ of _n_&#12301;&#12392;&#12356;&#12358;&#24418;&#24335;&#12398;&#25991;&#23383;&#21015;&#12391;&#12377;&#12290;&#21508;&#21015;&#12399;&#12459;&#12531;&#12510;&#12391;&#21306;&#20999;&#12425;&#12428;&#12289;&#21015;&#21517;&#12392;&#21015;&#20516;&#12398;&#38291;&#12399;&#12467;&#12525;&#12531;&#12391;&#21306;&#20999;&#12425;&#12428;&#12414;&#12377;&#12290;&#38283;&#30330;&#32773;&#12395;&#12424;&#12387;&#12390;&#38750;&#34920;&#31034;&#12395;&#12373;&#12428;&#12383;&#21015;&#12399; Name &#25991;&#23383;&#21015;&#12363;&#12425;&#23436;&#20840;&#12395;&#38500;&#22806;&#12373;&#12428;&#12414;&#12377;&#12290;Name &#25991;&#23383;&#21015;&#12398;&#20363;&#65306;&#12300;Contact Name: Doug, Contact Phone: 555-1212, Contact Zip: 12345, row 3 of 7&#12301;&#12290;</p>&#13;
               <p>&#12300;Row _m_ of _n_&#12301;&#12398;&#37096;&#20998;&#12399;&#21508;&#22269;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#21015; 1 &#12398;&#21508;&#12487;&#12540;&#12479;&#12475;&#12523;&#12398; Name &#12399;&#65288;&#12475;&#12523;&#36984;&#25246;&#12514;&#12540;&#12489;&#12398;&#22580;&#21512;&#65289;&#12289;&#12300;_columnName_: _columnValue_, Row _m_ of _n_&#12301;&#12392;&#12356;&#12358;&#24418;&#24335;&#12398;&#25991;&#23383;&#21015;&#12391;&#12377;&#12290;&#20363;&#65306;&#12300;Contact Phone: 555-1212, Row 2 of 5&#12301;&#12290;&#20197;&#38477;&#12398;&#21015;&#12418;&#21516;&#12376;&#24418;&#24335;&#12434;&#12392;&#12426;&#12414;&#12377;&#12364;&#12289;&#12300;Row _m_ of _n_&#12301;&#12398;&#37096;&#20998;&#12399;&#21547;&#12414;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
               <p>&#12300;Row _m_ of _n_&#12301;&#12398;&#37096;&#20998;&#12399;&#21508;&#22269;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#21015;&#12504;&#12483;&#12480;&#12540;&#12398; Name &#25991;&#23383;&#21015;&#12399;&#65288;&#12475;&#12523;&#12414;&#12383;&#12399;&#34892;&#36984;&#25246;&#12514;&#12540;&#12489;&#12398;&#22580;&#21512;&#65289;&#12289;&#36890;&#24120;&#12399;&#12504;&#12483;&#12480;&#12540;&#12398;&#12486;&#12461;&#12473;&#12488;&#12391;&#12377;&#12290;&#20363;&#65306;&#12300;Contact Phone&#12301;&#12290;&#12464;&#12522;&#12483;&#12489;&#12364;&#21015;&#12391;&#12477;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12477;&#12540;&#12488;&#12398;&#36969;&#29992;&#12392;&#26041;&#21521;&#12434;&#34920;&#12377;&#12383;&#12417;&#12289;&#21015;&#21517;&#12395;&#12399;&#12300;sorted&#12301;&#12420;&#12300;sorted descending&#12301;&#12394;&#12393;&#12398;&#25991;&#23383;&#21015;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#65306;&#12300;Contact Name sorted&#12301;&#12290;&#35079;&#25968;&#21015;&#12398;&#12477;&#12540;&#12488;&#12398;&#22580;&#21512;&#12289;&#12524;&#12505;&#12523;&#25991;&#23383;&#21015;&#12418;&#36861;&#21152;&#12373;&#12428;&#12289;&#12477;&#12540;&#12488;&#21015;&#12475;&#12483;&#12488;&#12395;&#12362;&#12369;&#12427;&#21015;&#12398;&#12524;&#12505;&#12523;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12464;&#12522;&#12483;&#12489;&#12364;&#21015; 3&#12289;&#21015; 2 &#12398;&#38918;&#12391;&#12477;&#12540;&#12488;&#12373;&#12428;&#12289;&#21015; 2 &#12399;&#38477;&#38918;&#12391;&#12477;&#12540;&#12488;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#21015; 3 &#12398;&#21517;&#21069;&#12398;&#26411;&#23614;&#12399;&#12300;Sorted Level 1&#12301;&#12392;&#12394;&#12426;&#12289;&#21015; 2 &#12398;&#21517;&#21069;&#12398;&#26411;&#23614;&#12399;&#12300;Sorted descending level 2&#12301;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12477;&#12540;&#12488;&#12398;&#26119;&#38918;&#12289;&#38477;&#38918;&#12362;&#12424;&#12403;&#12477;&#12540;&#12488;&#12524;&#12505;&#12523;&#12434;&#34920;&#12377;&#25991;&#23383;&#21015;&#12399;&#12289;&#21508;&#22269;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>DataGrid &#12414;&#12383;&#12399;&#12356;&#12378;&#12428;&#12363;&#12398;&#12464;&#12522;&#12483;&#12489;&#12450;&#12452;&#12486;&#12512;&#12398; Name &#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392;&#12289;&#35442;&#24403;&#12377;&#12427; childID&#65288;&#34892;&#12414;&#12383;&#12399;&#21015;&#12398;&#22580;&#21512;&#65289;&#12414;&#12383;&#12399; 0&#65288;DataGrid &#26412;&#20307;&#12398;&#22580;&#21512;&#65289;&#12434;&#21547;&#12416; MSAA &#12452;&#12505;&#12531;&#12488; <code>EVENT_OBJECT_NAMECHANGE</code> &#12364; DataGrid &#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12395;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#21517;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12475;&#12523;&#12398;&#21015;&#12504;&#12483;&#12480;&#12540;&#21517;&#12395;&#22522;&#12389;&#12356;&#12390;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#21517;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#35500;&#26126;</b>&#13;
               </p>&#13;
 &#13;
               <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;DataGrid &#12398; MSAA Description &#12399;&#31354;&#12398;&#25991;&#23383;&#21015;&#12391;&#12377;&#12364;&#12289;DataGrid &#12398; <code>accessibilityDescription</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#35500;&#26126;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#21508;&#34892;&#12289;&#12475;&#12523;&#12362;&#12424;&#12403;&#12504;&#12483;&#12480;&#12540;&#12398; Description &#12399;&#31354;&#12398;&#25991;&#23383;&#21015;&#12391;&#12377;&#12364;&#12289;AccImpl &#12391;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398; DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12391;&#12399;&#20966;&#29702;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#29366;&#24907;</b>&#13;
               </p>&#13;
 &#13;
               <p>DataGrid &#12398; MSAA State &#12399;&#12289;&#27425;&#12398;&#20516;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
               <ul><li>&#13;
                     <code>STATE_SYSTEM_UNAVAILABLE</code>&#65288;<code>enabled</code> &#12364; <code>false</code> &#12391;&#12354;&#12427;&#22580;&#21512;&#65289;</li>&#13;
                  <li>&#13;
                     <code>STATE_SYSTEM_FOCUSABLE</code>&#65288;<code>enabled</code> &#12364; <code>true</code> &#12391;&#12354;&#12427;&#22580;&#21512;&#65289;</li>&#13;
                  <li>&#13;
                     <code>STATE_SYSTEM_FOCUSED</code>&#65288;<code>enabled</code> &#12364; <code>true</code> &#12391;&#12354;&#12426;&#12289;DataGrid &#12395;&#12501;&#12457;&#12540;&#12459;&#12473;&#12364;&#12354;&#12427;&#22580;&#21512;&#65289;</li>&#13;
                  <li>&#13;
                     <code>STATE_SYSTEM_MULTISELECTABLE</code>&#65288;<code>allowMultipleSelection</code> &#12364; true &#12391;&#12354;&#12427;&#22580;&#21512;&#65289;</li>&#13;
               </ul><p>&#12487;&#12540;&#12479;&#34892;&#12414;&#12383;&#12399;&#12475;&#12523;&#12398; State &#12399;&#12289;&#27425;&#12398;&#20516;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
               <ul><li>&#13;
                     <code>STATE_SYSTEM_FOCUSABLE</code>&#13;
                  </li>&#13;
                  <li>&#13;
                     <code>STATE_SYSTEM_FOCUSED</code>&#65288;&#12501;&#12457;&#12540;&#12459;&#12473;&#12364;&#12354;&#12427;&#22580;&#21512;&#65289;</li>&#13;
                  <li>&#13;
                     <code>STATE_SYSTEM_OFFSCREEN</code>&#65288;&#34892;&#12414;&#12383;&#12399;&#12475;&#12523;&#12364;&#30011;&#38754;&#22806;&#12395;&#12473;&#12463;&#12525;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#65289;</li>&#13;
                  <li>&#13;
                     <code>STATE_SYSTEM_SELECTABLE</code>&#13;
                  </li>&#13;
                  <li>&#13;
                     <code>STATE_SYSTEM_SELECTED</code>&#65288;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#65289;</li>&#13;
               </ul><p>&#12504;&#12483;&#12480;&#12540;&#12475;&#12523;&#12399;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21463;&#12369;&#12394;&#12363;&#12387;&#12383;&#12426;&#12289;&#36984;&#25246;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#12426;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#12504;&#12483;&#12480;&#12540;&#12475;&#12523;&#12398; State &#12399; <code>STATE_SYSTEM_NORMAL</code> &#12391;&#12377;&#12290;&#29694;&#22312;&#12398;&#23455;&#35013;&#12391;&#12399;&#12289;&#12504;&#12483;&#12480;&#12540;&#12364;&#30011;&#38754;&#22806;&#12395;&#12394;&#12427;&#12424;&#12358;&#12395;&#12464;&#12522;&#12483;&#12489;&#33258;&#20307;&#12364;&#31227;&#21205;&#12373;&#12428;&#12383;&#22580;&#21512;&#12391;&#12418;&#12289;&#12504;&#12483;&#12480;&#12540;&#12475;&#12523;&#12364; <code>STATE_SYSTEM_OFFSCREEN</code> &#12434;&#22577;&#21578;&#12375;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>DataGrid &#12414;&#12383;&#12399;&#12356;&#12378;&#12428;&#12363;&#12398;&#12464;&#12522;&#12483;&#12489;&#12450;&#12452;&#12486;&#12512;&#12398; State &#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392;&#12289;&#35442;&#24403;&#12377;&#12427; childID&#65288;&#34892;&#12414;&#12383;&#12399;&#21015;&#12398;&#22580;&#21512;&#65289;&#12414;&#12383;&#12399; 0&#65288;DataGrid &#26412;&#20307;&#12398;&#22580;&#21512;&#65289;&#12434;&#21547;&#12416; MSAA &#12452;&#12505;&#12531;&#12488; <code>EVENT_OBJECT_STATECHANGE</code> &#12364; DataGrid &#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398; DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12391;&#12399;&#20966;&#29702;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#20516;</b>&#13;
               </p>&#13;
 &#13;
               <p>DataGrid &#12392;&#12381;&#12398;&#23376;&#65288;&#34892;&#12289;&#12475;&#12523;&#12362;&#12424;&#12403;&#12504;&#12483;&#12480;&#12540;&#65289;&#12395; MSAA &#20516;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#22580;&#25152;</b>&#13;
               </p>&#13;
 &#13;
               <p>DataGrid &#12414;&#12383;&#12399; DataGrid &#20869;&#12398;&#34892;&#12289;&#12487;&#12540;&#12479;&#12475;&#12523;&#12414;&#12383;&#12399;&#12504;&#12483;&#12480;&#12540;&#12475;&#12523;&#12398; MSAA Location &#12399;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#22659;&#30028;&#30697;&#24418;&#12391;&#12377;&#12290;&#29694;&#22312;&#30011;&#38754;&#12395;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12450;&#12452;&#12486;&#12512;&#12398;&#20301;&#32622;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398; DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12391;&#12399;&#20966;&#29702;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;</b>&#13;
               </p>&#13;
 &#13;
               <p>DataGrid &#12395;&#12399; MSAA DefaultAction &#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#34892;&#12414;&#12383;&#12399;&#21015;&#12398; MSAA DefaultAction &#12399;&#12300;Double Click&#12301;&#12391;&#12289;&#12504;&#12483;&#12480;&#12540;&#12475;&#12523;&#12398; DefaultAction &#12399;&#12300;Click&#12301;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;&#25991;&#23383;&#21015;&#12364;&#35201;&#27714;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12399;&#12289;&#21508;&#22269;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12383;&#23550;&#24540;&#12377;&#12427;&#25991;&#23383;&#21015;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12487;&#12540;&#12479;&#34892;&#12414;&#12383;&#12399;&#12475;&#12523;&#12395;&#23550;&#12375;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;&#12487;&#12540;&#12479;&#34892;&#12414;&#12383;&#12399;&#12475;&#12523;&#12364;&#12501;&#12457;&#12540;&#12459;&#12473;&#12373;&#12428;&#12390;&#36984;&#25246;&#12373;&#12428;&#12289;&#12475;&#12523;&#12414;&#12383;&#12399;&#34892;&#12398;&#12479;&#12452;&#12503;&#12395;&#12424;&#12387;&#12390;&#12399;&#20182;&#12398;&#21205;&#20316;&#12364;&#30330;&#29983;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12504;&#12483;&#12480;&#12540;&#12395;&#23550;&#12375;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;&#12464;&#12522;&#12483;&#12489;&#12364;&#12381;&#12398;&#21015;&#12434;&#22522;&#28310;&#12395;&#12477;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12504;&#12483;&#12480;&#12540;&#12395;&#23550;&#12375;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#32368;&#12426;&#36820;&#12375;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;&#12477;&#12540;&#12488;&#12398;&#38918;&#24207;&#12364;&#26119;&#38918;&#12392;&#38477;&#38918;&#12391;&#20999;&#12426;&#26367;&#12431;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12510;&#12491;&#12517;&#12450;&#12523;&#12398;&#22519;&#31558;&#26178;&#28857;&#12391;&#12399;&#12289;AccImpl &#12391;&#12289;&#35079;&#25968;&#21015;&#12398;&#35079;&#25968;&#12524;&#12505;&#12523;&#12398;&#12477;&#12540;&#12488;&#12434;&#19968;&#24230;&#12395;&#35373;&#23450;&#12377;&#12427;&#26041;&#27861;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398; DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12391;&#12399;&#20966;&#29702;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#12501;&#12457;&#12540;&#12459;&#12473;</b>&#13;
               </p>&#13;
 &#13;
               <p>&#12464;&#12522;&#12483;&#12489;&#12391;&#29305;&#23450;&#12398;&#12450;&#12452;&#12486;&#12512;&#65288;&#36984;&#25246;&#12514;&#12540;&#12489;&#12395;&#24540;&#12376;&#12390;&#34892;&#12414;&#12383;&#12399;&#12475;&#12523;&#65289;&#12364;&#12501;&#12457;&#12540;&#12459;&#12473;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;Focus &#12399;&#12289;&#12464;&#12522;&#12483;&#12489;&#33258;&#20307;&#12395;&#12501;&#12457;&#12540;&#12459;&#12473;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12377; 0 &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12364;&#30330;&#29983;&#12377;&#12427;&#12398;&#12399;&#12289;&#12464;&#12522;&#12483;&#12489;&#20869;&#12395;&#12487;&#12540;&#12479;&#12364;&#12394;&#12356;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#34892;&#65288;&#34892;&#36984;&#25246;&#12514;&#12540;&#12489;&#65289;&#12414;&#12383;&#12399;&#12475;&#12523;&#65288;&#12475;&#12523;&#36984;&#25246;&#12514;&#12540;&#12489;&#65289;&#12395;&#12501;&#12457;&#12540;&#12459;&#12473;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;Focus &#12399;&#12289;&#12501;&#12457;&#12540;&#12459;&#12473;&#12398;&#12354;&#12427;&#12450;&#12452;&#12486;&#12512;&#12398; childID &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>DataGrid &#12364;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#24471;&#12427;&#12392;&#12289;MSAA &#12452;&#12505;&#12531;&#12488; <code>EVENT_OBJECT_FOCUS</code> &#12434;&#36865;&#20986;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12464;&#12522;&#12483;&#12489;&#20869;&#12398;&#34892;&#12414;&#12383;&#12399;&#12475;&#12523;&#38291;&#12391;&#12501;&#12457;&#12540;&#12459;&#12473;&#12364;&#31227;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#12418;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12364;&#38283;&#22987;&#12414;&#12383;&#12399;&#34920;&#31034;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12399;&#12289;&#12501;&#12457;&#12540;&#12459;&#12473;&#22793;&#26356;&#12452;&#12505;&#12531;&#12488;&#12364;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12364;&#20445;&#23384;&#12414;&#12383;&#12399;&#38281;&#12376;&#12425;&#12428;&#12383;&#12392;&#12365;&#12395;&#12399;&#12289;&#12501;&#12457;&#12540;&#12459;&#12473;&#22793;&#26356;&#12452;&#12505;&#12531;&#12488;&#12364; DataGrid &#12391;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#36984;&#25246;</b>&#13;
               </p>&#13;
 &#13;
               <p>DataGrid &#12391;&#12399;&#12289;<code>allowMultipleSelection</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#24540;&#12376;&#12390;&#12289;&#21336;&#19968;&#34892;&#12414;&#12383;&#12399;&#21336;&#19968;&#12475;&#12523;&#12289;&#12354;&#12427;&#12356;&#12399;&#35079;&#25968;&#34892;&#12414;&#12383;&#12399;&#35079;&#25968;&#12475;&#12523;&#12398;&#36984;&#25246;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#36984;&#25246;&#12375;&#12383;&#12450;&#12452;&#12486;&#12512;&#12398;&#25972;&#25968;&#12398; childID &#12398;&#37197;&#21015;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12450;&#12452;&#12486;&#12512;&#12364;&#25490;&#20182;&#30340;&#12395;&#36984;&#25246;&#12373;&#12428;&#12427;&#12392;&#12289;MSAA &#12452;&#12505;&#12531;&#12488; <code>EVENT_OBJECT_SELECTION</code> &#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12475;&#12523;&#65288;&#12475;&#12523;&#36984;&#25246;&#12514;&#12540;&#12489;&#65289;&#12414;&#12383;&#12399;&#34892;&#65288;&#34892;&#36984;&#25246;&#12514;&#12540;&#12489;&#65289;&#12364;&#29694;&#22312;&#12398;&#36984;&#25246;&#12475;&#12483;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#12392;&#12289;<code>EVENT_OBJECT_SELECTIONADD</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12392;&#21516;&#27096;&#12395;&#12289;&#12450;&#12452;&#12486;&#12512;&#65288;&#12475;&#12523;&#12414;&#12383;&#12399;&#34892;&#65289;&#12364;&#36984;&#25246;&#31684;&#22258;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;<code>EVENT_OBJECT_SELECTIONREMOVE</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#36984;&#25246;&#12364;&#12377;&#12409;&#12390;&#12463;&#12522;&#12450;&#12373;&#12428;&#12383;&#22580;&#21512;&#65288;&#36984;&#25246;&#25968;&#12395;&#38306;&#20418;&#12394;&#12367;&#65289;&#12420;&#12289;&#12377;&#12409;&#12390;&#36984;&#25246;&#12414;&#12383;&#12399;&#38936;&#22495;&#36984;&#25246;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#23455;&#34892;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;<code>EVENT_OBJECT_SELECTIONWITHIN</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#20197;&#22806;&#12398;&#36984;&#25246;&#25805;&#20316;&#12391;&#12399;&#12289;<code>EVENT_OBJECT_SELECTION</code> &#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398; DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12391;&#12399;&#20966;&#29702;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#36984;&#25246;</b>&#13;
               </p>&#13;
 &#13;
               <p>&#13;
                  <code>accSelect</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;MSAA &#32076;&#30001;&#12395;&#12424;&#12427; DataGrid &#20869;&#12398;&#36984;&#25246;&#12398;&#22793;&#26356;&#12420;&#12501;&#12457;&#12540;&#12459;&#12473;&#12398;&#22793;&#26356;&#12398;&#35201;&#27714;&#12434;&#23455;&#35013;&#12375;&#12414;&#12377;&#12290;DataGrid &#12398; AccImpl &#12391;&#12399;&#12289;DataGrid &#33258;&#20307;&#12289;&#12414;&#12383;&#12399; DataGrid &#20869;&#12398;&#12487;&#12540;&#12479;&#12450;&#12452;&#12486;&#12512;&#65288;&#36984;&#25246;&#12514;&#12540;&#12489;&#12395;&#24540;&#12376;&#12390;&#34892;&#12414;&#12383;&#12399;&#12475;&#12523;&#65289;&#12420;&#12450;&#12452;&#12486;&#12512;&#12475;&#12483;&#12488;&#12395;&#23550;&#12377;&#12427;&#12501;&#12457;&#12540;&#12459;&#12473;&#12398;&#35373;&#23450;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12395;&#12399;&#12289;&#12501;&#12457;&#12540;&#12459;&#12473;&#35373;&#23450;&#12289;1 &#12388;&#12398;&#12450;&#12452;&#12486;&#12512;&#12398;&#25490;&#20182;&#30340;&#36984;&#25246;&#12289;&#36984;&#25246;&#31684;&#22258;&#12363;&#12425;&#12398;&#12450;&#12452;&#12486;&#12512;&#12414;&#12383;&#12399;&#12450;&#12452;&#12486;&#12512;&#12475;&#12483;&#12488;&#12398;&#36861;&#21152;&#12392;&#21066;&#38500;&#12364;&#12354;&#12426;&#12289;&#12371;&#12428;&#12425;&#12399;&#12377;&#12409;&#12390; Microsoft Active Accessibility &#12398;&#20181;&#27096;&#12395;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12510;&#12491;&#12517;&#12450;&#12523;&#12398;&#22519;&#31558;&#26178;&#28857;&#12391;&#12399;&#12289;&#12475;&#12523;&#12398;&#35079;&#25968;&#36984;&#25246;&#12514;&#12540;&#12489;&#12391;&#12289;&#26082;&#12395;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#35079;&#25968;&#12475;&#12523;&#38936;&#22495;&#12434; <code>accSelect</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#25313;&#24373;&#12375;&#12289;&#38936;&#22495;&#12398;&#34892;&#12392;&#21015;&#12434;&#19968;&#24230;&#12395;&#22679;&#12420;&#12381;&#12358;&#12392;&#12375;&#12383;&#22580;&#21512;&#12289;&#21516;&#12376;&#25805;&#20316;&#12434;&#12510;&#12454;&#12473;&#12391;&#23455;&#34892;&#12375;&#12383;&#22580;&#21512;&#12392;&#12399;&#30064;&#12394;&#12427;&#32080;&#26524;&#12395;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12398; DataGrid &#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#23455;&#35013;&#12391;&#12399;&#20966;&#29702;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12450;&#12452;&#12486;&#12512;&#12456;&#12487;&#12451;&#12479;&#12540;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
            <p></p><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProperty" id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="protectedPropertySummary" id="protectedPropertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12503;&#12525;&#12486;&#12463;&#12488;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProtectedProperty" id="summaryTableProtectedProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#DataGridAccImpl()" class="signatureLink">DataGridAccImpl</a>(master:<a href="../../mx/core/UIComponent.html">UIComponent</a>)</div><div class="summaryTableDescription">&#13;
      &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">DataGridAccImpl</td></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#enableAccessibility()" class="signatureLink">enableAccessibility</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">[&#38745;&#30340;] &#13;
      DataGrid &#12463;&#12521;&#12473;&#12391;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">DataGridAccImpl</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="protectedMethodSummary" id="protectedMethodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12503;&#12525;&#12486;&#12463;&#12488;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProtectedMethod" id="summaryTableProtectedMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><a name="//apple_ref/cpp/Constructor/DataGridAccImpl()" class="dashAnchor" id="//apple_ref/cpp/Constructor/DataGridAccImpl()"></a><a name="DataGridAccImpl()" id="DataGridAccImpl()"></a><a name="DataGridAccImpl(mx.core.UIComponent)" id="DataGridAccImpl(mx.core.UIComponent)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>DataGridAccImpl</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function DataGridAccImpl(master:<a href="../../mx/core/UIComponent.html">UIComponent</a>)</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p>&#13;
      &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">master</span>:<a href="../../mx/core/UIComponent.html">UIComponent</a></code> &#8212; &#12371;&#12398; AccImpl &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12424;&#12387;&#12390;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12395;&#12394;&#12427; UIComponent &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><a name="//apple_ref/cpp/Method/enableAccessibility()" class="dashAnchor" id="//apple_ref/cpp/Method/enableAccessibility()"></a><a name="enableAccessibility()" id="enableAccessibility()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>enableAccessibility</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public static function enableAccessibility():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p></p><p>&#13;
      DataGrid &#12463;&#12521;&#12473;&#12391;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;MXML &#12467;&#12531;&#12497;&#12452;&#12521;&#12540;&#12395;&#12424;&#12387;&#12390;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#36215;&#21205;&#12467;&#12540;&#12489;&#12363;&#12425;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#24460;&#12289;DataGrid &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21021;&#26399;&#21270;&#12373;&#12428;&#12427;&#12392;&#12289;<code>accessibilityImplementation</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12371;&#12398;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      </div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>