<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:2.5" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:10.2" /><meta name="product" content="air" /><meta name="productver" content="air:2.5" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:10.2" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="StageVideo,flash.media.StageVideo,colorSpaces,depth,pan,videoHeight,videoWidth,viewPort,zoom,attachCamera,attachNetStream" /><title>StageVideo - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.media</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  StageVideo</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">StageVideo  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
    &#12521;&#12452;&#12502;&#12499;&#12487;&#12458;&#12414;&#12383;&#12399;&#37682;&#30011;&#12373;&#12428;&#12383;&#12499;&#12487;&#12458;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12392;&#12365;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#12487;&#12496;&#12452;&#12473;&#12398;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12471;&#12519;&#12531;&#27231;&#33021;&#12364;&#20351;&#29992;&#21487;&#33021;&#12394;&#22580;&#21512;&#12399;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12471;&#12519;&#12531;&#27231;&#33021;&#12399;&#22823;&#21322;&#12398;&#12487;&#12496;&#12452;&#12473;&#12395;&#25645;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#24418;&#24335;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;flash.net.NetStream &#12463;&#12521;&#12473;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
	&#13;
    <p>&#13;
                  <i>AIR &#12503;&#12525;&#12501;&#12449;&#12452;&#12523;&#12469;&#12509;&#12540;&#12488;&#65306;</i>AIR 3 &#12391;&#12399;&#12289;&#12486;&#12524;&#12499;&#29992; AIR &#12487;&#12496;&#12452;&#12473;&#12398;&#12377;&#12409;&#12390;&#12392;&#19968;&#37096;&#12398;&#12514;&#12496;&#12452;&#12523;&#12487;&#12496;&#12452;&#12473;&#12391;&#12371;&#12398;&#27231;&#33021;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;AIR 3 for iOS &#12399;&#12289;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12487;&#12467;&#12540;&#12489;&#27231;&#33021;&#20184;&#12365; H.264 &#12499;&#12487;&#12458;&#23550;&#24540; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;NetStream &#27231;&#33021;&#12398;&#12469;&#12509;&#12540;&#12488;&#12395;&#12399;&#21046;&#38480;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;AIR 3 for iOS &#12399; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36890;&#12376;&#12390;&#12289;On2 &#12362;&#12424;&#12403; Sorenson &#12467;&#12540;&#12487;&#12483;&#12463;&#12418;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12469;&#12509;&#12540;&#12488;&#12391;&#12399;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12487;&#12467;&#12540;&#12489;&#12399;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;NetStream &#27231;&#33021;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;AIR 2.5 &#12391;&#12399;&#12289;&#12371;&#12398;&#27231;&#33021;&#12399;&#12486;&#12524;&#12499;&#29992; AIR &#12487;&#12496;&#12452;&#12473;&#12398;&#12415;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12373;&#12425;&#12395;&#12289;&#12486;&#12524;&#12499;&#29992; AIR 2.5 &#20869;&#12398;&#12371;&#12398;&#27231;&#33021;&#29992;&#12398; ActionScript &#12399;&#12289;AIR 3 &#12414;&#12383;&#12399; Flash Player 10.2 &#29992;&#12398; ActionScript &#12392;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#30456;&#36949;&#28857;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;ActionScript &#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#35079;&#25968;&#12398;&#12503;&#12525;&#12501;&#12449;&#12452;&#12523;&#38291;&#12391;&#12398; API &#12469;&#12509;&#12540;&#12488;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;<a href="http://help.adobe.com/en_US/air/build/WS144092a96ffef7cc16ddeea2126bb46b82f-8000.html">AIR &#12503;&#12525;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12509;&#12540;&#12488;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;AIR &#12487;&#12473;&#12463;&#12488;&#12483;&#12503; &#12414;&#12383;&#12399; extendedDesktop &#12503;&#12525;&#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#12289;StageVideo &#12463;&#12521;&#12473;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#13;
    </p>&#13;
       &#13;
	              <p>StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12427;&#12499;&#12487;&#12458;&#12399;&#12289;&#24120;&#12395;&#12289;&#12393;&#12398; Flash &#34920;&#31034;&#12522;&#12473;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12424;&#12426;&#12418;&#32972;&#38754;&#12395;&#12354;&#12427;&#38263;&#26041;&#24418;&#12398;&#38936;&#22495;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12471;&#12519;&#12531;&#12434;&#21033;&#29992;&#12375;&#12388;&#12388;&#12289;&#12499;&#12487;&#12458;&#12398;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#34920;&#31034;&#26041;&#27861;&#65288;&#12499;&#12487;&#12458;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12364;&#12458;&#12540;&#12496;&#12540;&#12524;&#12452;&#34920;&#31034;&#12373;&#12428;&#12427;&#38263;&#26041;&#24418;&#12398;&#34920;&#31034;&#38936;&#22495;&#65289;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>	&#13;
	&#13;
	&#13;
	              <p>Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12394;&#12367; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12513;&#12522;&#12483;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
 	             <p>&#13;
                  </p><ul><li>&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12499;&#12487;&#12458;&#34920;&#31034;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#21521;&#19978;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                     <li>CPU &#21344;&#26377;&#29575;&#12364;&#20302;&#28187;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12394;&#12393;&#12434; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21069;&#38754;&#12395;&#34920;&#31034;&#12391;&#12365;&#12427;&#12398;&#12391;&#12289;&#12424;&#12426;&#26580;&#36575;&#12391;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12394;&#12467;&#12531;&#12486;&#12531;&#12484;&#38283;&#30330;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</li>&#13;
                  </ul><p>&#12499;&#12487;&#12458;&#12398;&#34920;&#31034;&#12364;&#12487;&#12496;&#12452;&#12473;&#12398;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12391;&#23455;&#34892;&#12373;&#12428;&#12427;&#12398;&#12391;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#27604;&#36611;&#12375;&#12390;&#27425;&#12398;&#12424;&#12358;&#12394;&#21046;&#32004;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
 	             <p>&#13;
                  </p><ul><li>&#21508; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#12388;&#12356;&#12390;&#12289;&#21516;&#26178;&#12395;&#12499;&#12487;&#12458;&#12434;&#34920;&#31034;&#12391;&#12365;&#12427; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#25968;&#12399;&#12289;Flash Player &#12395;&#12424;&#12426; 4 &#12395;&#21046;&#38480;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12487;&#12496;&#12452;&#12473;&#12398;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12522;&#12477;&#12540;&#12473;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#23455;&#38555;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25968;&#12364;&#12424;&#12426;&#23569;&#12394;&#12356;&#25968;&#12395;&#21046;&#38480;&#12373;&#12428;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12486;&#12524;&#12499;&#29992; AIR &#12487;&#12496;&#12452;&#12473;&#12391;&#12399;&#12289;&#19968;&#24230;&#12395; 1 &#12388;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12398;&#12415;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12391;&#12365;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12398;&#12479;&#12452;&#12511;&#12531;&#12464;&#12364;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#12395;&#12424;&#12426;&#34920;&#31034;&#12373;&#12428;&#12427; Flash &#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#12479;&#12452;&#12511;&#12531;&#12464;&#12392;&#21516;&#26399;&#12375;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#34920;&#31034;&#38936;&#22495;&#12398;&#24418;&#12399;&#38263;&#26041;&#24418;&#12398;&#12415;&#12391;&#12377;&#12290;&#26965;&#20870;&#24418;&#12420;&#19981;&#35215;&#21063;&#12394;&#24418;&#12394;&#12393;&#12398;&#35079;&#38609;&#12394;&#38936;&#22495;&#12395;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12434;&#22238;&#36578;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12434;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12383;&#12426;&#12289;BitmapData &#12434;&#20351;&#29992;&#12375;&#12390;&#12499;&#12487;&#12458;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12395;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12395;&#12459;&#12521;&#12540;&#22793;&#25563;&#12434;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12395;&#12450;&#12523;&#12501;&#12449;&#20516;&#12434;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12398;&#21069;&#38754;&#12395;&#12354;&#12427;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#36969;&#29992;&#12375;&#12383;&#12502;&#12524;&#12531;&#12489;&#12514;&#12540;&#12489;&#12399;&#12289;&#12499;&#12487;&#12458;&#12395;&#23550;&#12375;&#12390;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#12434;&#37197;&#32622;&#12391;&#12365;&#12427;&#20301;&#32622;&#12399;&#12501;&#12523;&#12500;&#12463;&#12475;&#12523;&#22659;&#30028;&#12398;&#12415;&#12391;&#12377;&#12290;</li>&#13;
                     <li>&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12496;&#12452;&#12473;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12395;&#12362;&#12356;&#12390;&#12289;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12399;&#26368;&#12418;&#36969;&#12375;&#12383;&#25163;&#27573;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12487;&#12496;&#12452;&#12473;&#38291;&#12391;&#23436;&#20840;&#12394;&#12500;&#12463;&#12475;&#12523;&#25972;&#21512;&#24615;&#12364;&#20445;&#12383;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12489;&#12521;&#12452;&#12496;&#12540;&#12420;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12395;&#12424;&#12426;&#12289;&#20123;&#32048;&#12394;&#19981;&#25972;&#21512;&#12364;&#30330;&#29983;&#12377;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#12487;&#12496;&#12452;&#12473;&#12398;&#20013;&#12395;&#12399;&#12289;&#24517;&#35201;&#12394;&#12377;&#12409;&#12390;&#12398;&#12459;&#12521;&#12540;&#12473;&#12506;&#12540;&#12473;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;H.264 &#27161;&#28310;&#12398; BT.709 &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356;&#12487;&#12496;&#12452;&#12473;&#12418;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12395;&#12399;&#12289;&#34920;&#31034;&#36895;&#24230;&#12434;&#36895;&#12417;&#12427;&#12383;&#12417;&#12289;BT.601 &#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#12473;&#12486;&#12540;&#12472;&#12499;&#12487;&#12458;&#12434; <code>normal</code>&#12289;<code>opaque</code>&#12289;<code>transparent</code> &#12394;&#12393;&#12398; WMODE &#35373;&#23450;&#12392;&#20849;&#12395;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12395;&#12394;&#12356;&#22580;&#21512;&#12289;&#12473;&#12486;&#12540;&#12472;&#12499;&#12487;&#12458;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12399; <code>WMODE=direct</code> &#12398;&#12415;&#12391;&#12377;&#12290;WMODE &#12399;&#12289;Safari 4 &#12414;&#12383;&#12399;&#12381;&#12428;&#20197;&#38477;&#12289;IE 9 &#12414;&#12383;&#12399;&#12381;&#12428;&#20197;&#38477;&#12289;&#12486;&#12524;&#12499;&#29992; AIR &#12391;&#12399;&#20309;&#12398;&#24433;&#38911;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>AIR for Android &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391; StageVideo &#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#23376;&#12391;&#12289;<code>colorDepth</code> &#12434; 32bit<i></i> &#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#33394;&#28145;&#24230; 16 bit &#12398; StageVideo &#12398;&#20351;&#29992;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290; </li>&#13;
                     <li>Android &#12398;&#22580;&#21512;&#12289;StageVideo &#12399; Android 3&#65288;Honeycomb&#65289;&#20197;&#19978;&#12391;&#21205;&#20316;&#12377;&#12427;&#12487;&#12496;&#12452;&#12473;&#12391;&#12398;&#12415;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12391;&#12365;&#12427;&#12384;&#12369;&#22810;&#12367;&#12398; Android &#12487;&#12496;&#12452;&#12473;&#12391;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#21205;&#20316;&#12377;&#12427;&#12424;&#12358;&#12395;&#12289;StageVideo &#12434;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#29872;&#22659;&#12391;&#12399; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#34920;&#31034;&#12377;&#12427;&#12424;&#12358;&#12394;&#12525;&#12472;&#12483;&#12463;&#12434;&#24517;&#12378;&#29992;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</li>&#13;
                  </ul><p>StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12377;&#12427;&#25163;&#38918;&#12398;&#35201;&#32004;&#12434;&#27425;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	              <p>&#13;
                  </p><ol><li>Stage.stageVideos &#12505;&#12463;&#12479;&#12540;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12479;&#12452;&#12511;&#12531;&#12464;&#12434;&#30693;&#12427;&#12383;&#12417;&#12395;&#12289;StageVideoAvailabilityEvent.STAGE_VIDEO_AVAILABILITY &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#65288;&#12486;&#12524;&#12499;&#29992; AIR 2.5 &#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#65289;&#12290; </li>&#13;
                     <li>StageVideoAvailabilityEvent.STAGE_VIDEO_AVAILABILITY &#12452;&#12505;&#12531;&#12488;&#12395;&#12424;&#12426;&#12473;&#12486;&#12540;&#12472;&#12499;&#12487;&#12458;&#12364;&#20351;&#29992;&#21487;&#33021;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12524;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#12392;&#12289;&#12381;&#12398;&#12452;&#12505;&#12531;&#12488;&#12495;&#12531;&#12489;&#12521;&#12540;&#20869;&#12398; <code>Stage.stageVideos</code> &#12505;&#12463;&#12479;&#12540;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12377;&#12290;&#12486;&#12524;&#12499;&#29992; AIR 2.5 &#12391;&#12399;&#12289;&#26368;&#21021;&#12398; SWF &#12501;&#12524;&#12540;&#12512;&#12364;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12383;&#24460;&#12289;<code>Stage.stageVideos</code> &#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12377;&#12290;<b>&#27880;&#24847;&#65306;</b>StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</li>&#13;
                     <li>&#13;
                        <code>StageVideo.attachNetStream()</code> &#12434;&#20351;&#29992;&#12375;&#12390; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#28155;&#20184;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#13;
                        <code>NetStream.play()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#12499;&#12487;&#12458;&#20877;&#29983;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12434;&#30693;&#12427;&#12383;&#12417;&#12395;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12398; <code>StageVideoEvent.RENDER_STATE</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12398;&#21463;&#38936;&#12399;&#12289;&#12499;&#12487;&#12458;&#12398; width &#12362;&#12424;&#12403; height &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#21021;&#26399;&#21270;&#12414;&#12383;&#12399;&#22793;&#26356;&#12373;&#12428;&#12383;&#12371;&#12392;&#12418;&#31034;&#12375;&#12414;&#12377;&#12290; </li>&#13;
                     <li>Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12398; <code>VideoEvent.RENDER_STATE</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12289;StageVideoEvent.RENDER_STATE &#12392;&#21516;&#12376;&#12473;&#12486;&#12540;&#12479;&#12473;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390; GPU &#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12471;&#12519;&#12531;&#12364;&#20351;&#29992;&#21487;&#33021;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#26029;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12398;&#21463;&#38936;&#12399;&#12289;&#12499;&#12487;&#12458;&#12398; width &#12362;&#12424;&#12403; height &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#21021;&#26399;&#21270;&#12414;&#12383;&#12399;&#22793;&#26356;&#12373;&#12428;&#12383;&#12371;&#12392;&#12418;&#31034;&#12375;&#12414;&#12377;&#65288;&#12486;&#12524;&#12499;&#29992; AIR 2.5 &#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#65289;&#12290;</li>&#13;
                  </ol><p>&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12364; <code>StageVideoEvent.RENDER_STATE</code> &#12452;&#12505;&#12531;&#12488;&#12395;&#12424;&#12387;&#12390;&#31034;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12394;&#12367; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#24467;&#26469;&#12398;&#26041;&#27861;&#12395;&#20999;&#12426;&#26367;&#12360;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12499;&#12487;&#12458;&#12364; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12450;&#12479;&#12483;&#12481;&#12373;&#12428;&#12289;&#20877;&#29983;&#12373;&#12428;&#12383;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#20877;&#29983;&#12473;&#12486;&#12540;&#12479;&#12473;&#12395;&#20309;&#12425;&#12363;&#12398;&#22793;&#21270;&#12364;&#29983;&#12376;&#12427;&#12383;&#12403;&#12395;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;<code>StageVideoEvent.RENDER_STATE</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12499;&#12487;&#12458;&#12364;&#30906;&#23455;&#12395;&#20877;&#29983;&#12373;&#12428;&#12427;&#12424;&#12358;&#12289;&#12414;&#12383;&#12399;&#20877;&#29983;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#13;
	</p>&#13;
    &#13;
               <p>&#12499;&#12487;&#12458;&#12398;&#23455;&#34892;&#12364;&#12473;&#12486;&#12540;&#12472;&#12499;&#12487;&#12458;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356; WMODE &#12363;&#12425;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12395;&#31227;&#34892;&#12377;&#12427;&#12392;&#12289;&#12473;&#12486;&#12540;&#12472;&#12499;&#12487;&#12458;&#12364;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#21516;&#27096;&#12395;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12434;&#32066;&#20102;&#12377;&#12427;&#12392;&#12289;&#12473;&#12486;&#12540;&#12472;&#12499;&#12487;&#12458;&#12399;&#20351;&#29992;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12289;Stage.stageVideos &#12505;&#12463;&#12479;&#12540;&#12364;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#22793;&#26356;&#12398;&#36890;&#30693;&#12434;&#21462;&#24471;&#12377;&#12427;&#12395;&#12399;&#12289;StageVideoAvailabilityEvent.STAGE_VIDEO_AVAILABITY &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;<b>&#27880;&#24847;&#65306;</b>&#12371;&#12398;&#36890;&#30693;&#12399;&#12289;&#12486;&#12524;&#12499;&#29992; AIR 2.5 &#12391;&#12399;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>&#13;
            <p></p><p id="learnMore"><span class="classHeaderTableLabel">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d50.html" target="_blank">&#12499;&#12487;&#12458;&#12398;&#22522;&#30990;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d46.html" target="_blank">&#12499;&#12487;&#12458;&#24418;&#24335;&#12395;&#12388;&#12356;&#12390;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WSF5341774-D3CE-4749-93AE-3BA62B73733C.html" target="_blank">Flash Player &#12362;&#12424;&#12403; AIR &#12392;&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12383;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12392;&#12398;&#20114;&#25563;&#24615;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS513F633F-460F-43aa-9A10-839853A1ECA4.html" target="_blank">Adobe F4V &#12362;&#12424;&#12403; FLV &#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#24418;&#24335;&#12395;&#12388;&#12356;&#12390;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d48.html" target="_blank">&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#12377;&#12427;&#39640;&#24230;&#12394;&#12488;&#12500;&#12483;&#12463;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d47.html" target="_blank">&#12499;&#12487;&#12458;&#12398;&#20363;&#65306;&#12499;&#12487;&#12458;&#12472;&#12517;&#12540;&#12463;&#12508;&#12483;&#12463;&#12473;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WSe9ecd9e6b89aefd2-68d5ef8f12cc8511f6c-8000.html" target="_blank">&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#34920;&#31034;&#12398;&#12383;&#12417;&#12398; StageVideo &#12463;&#12521;&#12473;&#12398;&#20351;&#29992;</a><br /><a href="http://www.adobe.com/go/learn_as3_stageVideo_en" target="_blank">StageVideo &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12434;&#23455;&#34892;&#12377;&#12427;&#26041;&#27861;</a></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/events/StageVideoEvent.html" target="">flash.events.StageVideoEvent</a><br /><a href="../../flash/events/StageVideoAvailabilityEvent.html" target="">flash.events.StageVideoAvailabilityEvent</a><br /><a href="../../flash/events/VideoEvent.html" target="">flash.events.VideoEvent</a><br /><a href="../../flash/display/Stage.html#stageVideos" target="">flash.display.Stage.stageVideos</a><br /><a href="Video.html" target="">flash.media.Video</a><br /><a href="../../flash/net/NetStream.html" target="">flash.net.NetStream</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#colorSpaces" class="signatureLink">colorSpaces</a> : <a href="../../Vector.html">Vector</a>.&lt;<a href="../../String.html">String</a>&gt;<div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
        &#12381;&#12398;&#12499;&#12487;&#12458;&#30011;&#38754;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12459;&#12521;&#12540;&#12473;&#12506;&#12540;&#12473;&#12398;&#21517;&#21069;&#12398;&#12522;&#12473;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#depth" class="signatureLink">depth</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">&#13;
        &#12381;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#37197;&#32622;&#12373;&#12428;&#12383;&#28145;&#12373;&#12524;&#12505;&#12523;&#12434;&#12289;&#20182;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12398;&#30456;&#23550;&#20516;&#12391;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#pan" class="signatureLink">pan</a> : <a href="../../flash/geom/Point.html">Point</a><div class="summaryTableDescription">&#13;
        Point &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#24231;&#27161;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12427;&#12289;&#12499;&#12487;&#12458;&#34920;&#31034;&#12398;&#12497;&#12531;&#35373;&#23450;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#videoHeight" class="signatureLink">videoHeight</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
		&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#39640;&#12373;&#12434;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#12391;&#25351;&#23450;&#12377;&#12427;&#25972;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#videoWidth" class="signatureLink">videoWidth</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
		&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#24133;&#12434;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#12391;&#25351;&#23450;&#12377;&#12427;&#25972;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#viewPort" class="signatureLink">viewPort</a> : <a href="../../flash/geom/Rectangle.html">Rectangle</a><div class="summaryTableDescription">&#13;
        &#12499;&#12487;&#12458;&#34920;&#31034;&#38936;&#22495;&#12398;&#32118;&#23550;&#20301;&#32622;&#12392;&#12469;&#12452;&#12474;&#65288;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#65289;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#zoom" class="signatureLink">zoom</a> : <a href="../../flash/geom/Point.html">Point</a><div class="summaryTableDescription">&#13;
        Point &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12427;&#12289;&#12499;&#12487;&#12458;&#12398;&#12474;&#12540;&#12512;&#35373;&#23450;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::11.4##AIR::3.4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#attachCamera()" class="signatureLink">attachCamera</a>(theCamera:<a href="../../flash/media/Camera.html">Camera</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22659;&#30028;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12459;&#12513;&#12521;&#12363;&#12425;&#12398;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12395; GPU &#12434;&#21033;&#29992;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#attachNetStream()" class="signatureLink">attachNetStream</a>(netStream:<a href="../../flash/net/NetStream.html">NetStream</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
        &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22659;&#30028;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">StageVideo</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="AIR::2.5##Flash::10.2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:renderState" class="signatureLink">renderState</a></div></td><td class="summaryTableDescription summaryTableCol">StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#29366;&#24907;&#12364;&#22793;&#21270;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">StageVideo</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/colorSpaces" class="dashAnchor" id="//apple_ref/cpp/Property/colorSpaces"></a><a name="colorSpaces" id="colorSpaces"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>colorSpaces</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>colorSpaces:<a href="../../Vector.html">Vector</a>.&lt;<a href="../../String.html">String</a>&gt;</code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
        &#12381;&#12398;&#12499;&#12487;&#12458;&#30011;&#38754;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12459;&#12521;&#12540;&#12473;&#12506;&#12540;&#12473;&#12398;&#21517;&#21069;&#12398;&#12522;&#12473;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#26222;&#36890;&#12289;&#12371;&#12398;&#12522;&#12473;&#12488;&#12395;&#12399;&#12300;BT.601&#12301;&#12392;&#12300;BT.709&#12301;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#27083;&#25104;&#12395;&#12424;&#12387;&#12390;&#12399;&#12300;BT.601&#12301;&#12398;&#12415;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#22580;&#21512;&#12289;&#12499;&#12487;&#12458;&#12364;&#27491;&#12375;&#12356;&#12459;&#12521;&#12540;&#12473;&#12506;&#12540;&#12473;&#12391;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
		&#13;
		</p><p><b>&#27880;&#24847;&#65306;</b>&#12486;&#12524;&#12499;&#29992; AIR &#12487;&#12496;&#12452;&#12473;&#12391;&#12399;&#12289;&#12300;BT.601&#12301;&#12398;&#20516;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#20877;&#29983;&#12434;&#12289;&#12300;BT.709&#12301;&#12398;&#20516;&#12399;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#20877;&#29983;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290; </p>&#13;
		&#13;
        <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get colorSpaces():<a href="../../Vector.html">Vector</a>.&lt;<a href="../../String.html">String</a>&gt;</code><br /></div></span><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/depth" class="dashAnchor" id="//apple_ref/cpp/Property/depth"></a><a name="depth" id="depth"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>depth</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>depth:<a href="../../int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
        &#12381;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#37197;&#32622;&#12373;&#12428;&#12383;&#28145;&#12373;&#12524;&#12505;&#12523;&#12434;&#12289;&#20182;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12398;&#30456;&#23550;&#20516;&#12391;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
		&#13;
		</p><p>StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#24120;&#12395;&#12473;&#12486;&#12540;&#12472;&#19978;&#12398;&#20182;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#32972;&#38754;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12364;&#35079;&#25968;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>depth</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#28145;&#12373;&#12524;&#12505;&#12523;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#26368;&#32972;&#38754;&#12395;&#12354;&#12427; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>depth</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#26368;&#12418;&#23567;&#12373;&#12356;&#20516;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#21516;&#12376;&#28145;&#12373;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12381;&#12428;&#12425;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#30456;&#23550;&#30340;&#12394;&#38918;&#24207;&#12399;&#12289;<code>stageVideos</code> Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12395;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#38918;&#24207;&#12395;&#12424;&#12387;&#12390;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;</p>	&#13;
		&#13;
        <p><b>&#27880;&#24847;&#65306;</b>&#12486;&#12524;&#12499;&#29992; AIR &#12487;&#12496;&#12452;&#12473;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#25968;&#12399; 1 &#12388;&#12384;&#12369;&#12391;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12486;&#12524;&#12499;&#29992; AIR &#12487;&#12496;&#12452;&#12473;&#12391;&#12399;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p> &#13;
		&#13;
        <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get depth():<a href="../../int.html">int</a></code><br /><code>&#160;&#160;&#160;&#160;public function set depth(value:<a href="../../int.html">int</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/display/Stage.html#stageVideos" target="">flash.display.Stage.stageVideos</a></div></div></span><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/pan" class="dashAnchor" id="//apple_ref/cpp/Property/pan"></a><a name="pan" id="pan"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>pan</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>pan:<a href="../../flash/geom/Point.html">Point</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
        Point &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#24231;&#27161;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12427;&#12289;&#12499;&#12487;&#12458;&#34920;&#31034;&#12398;&#12497;&#12531;&#35373;&#23450;&#12391;&#12377;&#12290; &#13;
        &#13;
        </p><p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;<code>pan</code> &#12398;&#20516;&#12399; <code>(0,0)</code> &#12391;&#12377;&#12290;&#12371;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#29366;&#24907;&#12391;&#12399;&#12289;<code>StageVideo.viewPort</code> &#12391;&#25351;&#23450;&#12373;&#12428;&#12427;&#38263;&#26041;&#24418;&#12398;&#20013;&#22830;&#12395;&#12499;&#12487;&#12458;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
		&#13;
		<p><code>pan</code> &#20516;&#12399;&#12289;<code>zoom</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398; <code>(1.0, 1.0)</code> &#20197;&#22806;&#12398;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#24847;&#21619;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398; <code>zoom</code> &#20516;&#12434;&#20351;&#29992;&#12375;&#12390; <code>StageVideo.viewPort</code> &#38263;&#26041;&#24418;&#20869;&#12395;&#12499;&#12487;&#12458;&#12434;&#34920;&#31034;&#12377;&#12427;&#12392;&#12289;&#12499;&#12487;&#12458;&#12398;&#12469;&#12452;&#12474;&#12399;&#12289;&#12381;&#12398;&#38263;&#26041;&#24418;&#12395;&#12385;&#12423;&#12358;&#12393;&#21512;&#12358;&#12424;&#12358;&#12395;&#35519;&#25972;&#12373;&#12428;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12499;&#12487;&#12458;&#12398;&#30011;&#20687;&#20840;&#20307;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12474;&#12540;&#12512;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12499;&#12487;&#12458;&#12398;&#30011;&#20687;&#20840;&#20307;&#12399;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12381;&#12398;&#22580;&#21512;&#12395; <code>pan</code> &#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12393;&#12398;&#37096;&#20998;&#12434; <code>StageVideo.viewPort</code> &#12398;&#38263;&#26041;&#24418;&#38936;&#22495;&#12395;&#34920;&#31034;&#12377;&#12427;&#12363;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
		&#13;
		<p><code>pan</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#35373;&#23450;&#12391;&#12365;&#12427;&#26377;&#21177;&#12394;&#20516;&#12398;&#31684;&#22258;&#12399;&#12289;<code>(-1.0, -1.0)</code> &#65374; <code>(1.0, 1.0)</code> &#12391;&#12377;&#12290;&#35373;&#23450;&#20516;&#12395;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
		&#13;
		<p></p><ul><li>&#13;
		<code>pan</code> &#20516;&#12364; <code>(-1.0, -1.0)</code> &#12398;&#22580;&#21512;&#12399;&#12289;&#12499;&#12487;&#12458;&#12398;&#24038;&#19978;&#38533;&#12500;&#12463;&#12475;&#12523;&#12364; <code>StageVideo.viewPort</code> &#38936;&#22495;&#12398;&#24038;&#19978;&#38533;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
		</li><li>&#13;
		<code>pan</code> &#20516;&#12364; <code>(1.0, 1.0)</code> &#12398;&#22580;&#21512;&#12399;&#12289;&#12499;&#12487;&#12458;&#12398;&#21491;&#19979;&#38533;&#12500;&#12463;&#12475;&#12523;&#12364; <code>StageVideo.viewPort</code> &#38936;&#22495;&#12398;&#21491;&#19979;&#38533;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
		</li><li>&#13;
		<code>pan</code> &#20516;&#12364; <code>(1.0, -1.0)</code> &#12398;&#22580;&#21512;&#12399;&#12289;&#12499;&#12487;&#12458;&#12398;&#21491;&#19978;&#38533;&#12500;&#12463;&#12475;&#12523;&#12364; <code>StageVideo.viewPort</code> &#38936;&#22495;&#12398;&#21491;&#19978;&#38533;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
		</li><li>&#13;
		<code>pan</code> &#20516;&#12364; <code>(-1.0, 1.0)</code> &#12398;&#22580;&#21512;&#12399;&#12289;&#12499;&#12487;&#12458;&#12398;&#24038;&#19979;&#38533;&#12500;&#12463;&#12475;&#12523;&#12364; <code>StageVideo.viewPort</code> &#38936;&#22495;&#12398;&#24038;&#19979;&#38533;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
		</li></ul><p>-1.0 &#12392; 1.0 &#12398;&#38291;&#12398;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25313;&#22823;&#29575;&#12395;&#24540;&#12376;&#12390;&#34920;&#31034;&#12364;&#12497;&#12531;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
        &#13;
        <p><code>pan</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#26377;&#21177;&#31684;&#22258;&#22806;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;<code>RangeError</code> &#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#20516;&#12399;&#12381;&#12398;&#21069;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12383;&#26377;&#21177;&#12394;&#20516;&#12395;&#25147;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
        &#13;
        <p>&#12414;&#12383;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20351;&#29992;&#26178;&#12395;&#12399; <code>Stage.stageVideos</code> Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35201;&#32032;&#12434; StageVideo &#22793;&#25968;&#12395;&#20195;&#20837;&#12375;&#12390;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#28857;&#12418;&#32771;&#24942;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;StageVideo &#22793;&#25968;&#12398; <code>pan</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#35442;&#24403;&#12377;&#12427; <code>Stage.stageVideos</code> Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35201;&#32032;&#12418;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#24460;&#12391;&#12289;&#21029;&#12398; StageVideo &#22793;&#25968;&#12395;&#21516;&#12376;&#35201;&#32032;&#12434;&#20195;&#20837;&#12375;&#12390;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;<code>pan</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#30452;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
        &#13;
        <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get pan():<a href="../../flash/geom/Point.html">Point</a></code><br /><code>&#160;&#160;&#160;&#160;public function set pan(value:<a href="../../flash/geom/Point.html">Point</a>):<a href="../../specialTypes.html#void">void</a></code><br /><br /><span class="label"> &#20363;&#22806; </span><br /><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../RangeError.html">RangeError</a> </code> &#8212; Point &#20516;&#12364;&#28961;&#21177;&#12391;&#12377;&#12290;&#13;
		&#13;
		</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="StageVideo.html#zoom" target="">zoom</a></div></div></span><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/videoHeight" class="dashAnchor" id="//apple_ref/cpp/Property/videoHeight"></a><a name="videoHeight" id="videoHeight"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>videoHeight</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>videoHeight:<a href="../../int.html">int</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
		&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#39640;&#12373;&#12434;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#12391;&#25351;&#23450;&#12377;&#12427;&#25972;&#25968;&#12391;&#12377;&#12290;&#13;
		&#13;
		</p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;<code>StageVideo.viewPort</code> &#12398;&#38263;&#26041;&#24418;&#38936;&#22495;&#12398;&#12469;&#12452;&#12474;&#12392;&#12399;&#38306;&#20418;&#12394;&#12367;&#12289;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12383;&#12398;&#12392;&#21516;&#12376;&#39640;&#12373;&#12391;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#12499;&#12487;&#12458;&#12434;&#34920;&#31034;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>		&#13;
		NetStream.Video.DimensionChange &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12371;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12499;&#12487;&#12458;&#12364;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
		&#13;
        <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get videoHeight():<a href="../../int.html">int</a></code><br /></div></span><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/videoWidth" class="dashAnchor" id="//apple_ref/cpp/Property/videoWidth"></a><a name="videoWidth" id="videoWidth"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>videoWidth</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>videoWidth:<a href="../../int.html">int</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
		&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#24133;&#12434;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#12391;&#25351;&#23450;&#12377;&#12427;&#25972;&#25968;&#12391;&#12377;&#12290;&#13;
		&#13;
		</p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;<code>StageVideo.viewPort</code> &#12398;&#38263;&#26041;&#24418;&#38936;&#22495;&#12398;&#12469;&#12452;&#12474;&#12392;&#12399;&#38306;&#20418;&#12394;&#12367;&#12289;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12383;&#12398;&#12392;&#21516;&#12376;&#24133;&#12391;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#12499;&#12487;&#12458;&#12434;&#34920;&#31034;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>		&#13;
		NetStream.Video.DimensionChange &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12371;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12499;&#12487;&#12458;&#12364;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
		&#13;
        <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get videoWidth():<a href="../../int.html">int</a></code><br /></div></span><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/viewPort" class="dashAnchor" id="//apple_ref/cpp/Property/viewPort"></a><a name="viewPort" id="viewPort"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>viewPort</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>viewPort:<a href="../../flash/geom/Rectangle.html">Rectangle</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
        &#12499;&#12487;&#12458;&#34920;&#31034;&#38936;&#22495;&#12398;&#32118;&#23550;&#20301;&#32622;&#12392;&#12469;&#12452;&#12474;&#65288;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#65289;&#12391;&#12377;&#12290;&#13;
        &#13;
        </p><p>&#12499;&#12487;&#12458;&#12398;&#20301;&#32622;&#12399;&#12289;&#12473;&#12486;&#12540;&#12472;&#12398;&#24038;&#19978;&#38533;&#12434;&#22522;&#28310;&#12392;&#12377;&#12427;&#30456;&#23550;&#20301;&#32622;&#12391;&#12377;&#12290;</p>&#13;
        &#13;
        <p>&#13;
        <code>viewPort</code> Rectangle &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>x</code> &#12362;&#12424;&#12403; <code>y</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#35373;&#23450;&#12391;&#12365;&#12427;&#20516;&#12398;&#26377;&#21177;&#31684;&#22258;&#12399; -8192 &#65374; 8191 &#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12499;&#12487;&#12458;&#12398;&#19968;&#37096;&#12414;&#12383;&#12399;&#20840;&#20307;&#12434;&#12473;&#12486;&#12540;&#12472;&#12398;&#22806;&#12395;&#20986;&#12377;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<code>viewPort</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398; <code>width</code> &#12362;&#12424;&#12403; <code>height</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12473;&#12486;&#12540;&#12472;&#12424;&#12426;&#12418;&#22823;&#12365;&#12367;&#12377;&#12428;&#12400;&#12289;&#12499;&#12487;&#12458;&#12398;&#12469;&#12452;&#12474;&#12434;&#12473;&#12486;&#12540;&#12472;&#12424;&#12426;&#12418;&#22823;&#12365;&#12367;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
        &#13;
        <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get viewPort():<a href="../../flash/geom/Rectangle.html">Rectangle</a></code><br /><code>&#160;&#160;&#160;&#160;public function set viewPort(value:<a href="../../flash/geom/Rectangle.html">Rectangle</a>):<a href="../../specialTypes.html#void">void</a></code><br /><br /><span class="label"> &#20363;&#22806; </span><br /><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../RangeError.html">RangeError</a> </code> &#8212; Rectangle &#20516;&#12364;&#28961;&#21177;&#12391;&#12377;&#12290;&#13;
        </td></tr></table></div></span><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/zoom" class="dashAnchor" id="//apple_ref/cpp/Property/zoom"></a><a name="zoom" id="zoom"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>zoom</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>zoom:<a href="../../flash/geom/Point.html">Point</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
        Point &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12427;&#12289;&#12499;&#12487;&#12458;&#12398;&#12474;&#12540;&#12512;&#35373;&#23450;&#12391;&#12377;&#12290; &#13;
        &#13;
        </p><p>&#12474;&#12540;&#12512;&#12398; Point &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#25313;&#22823;&#20493;&#29575;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;<code>zoom</code> &#12398;&#20516;&#12399; <code>(1.0, 1.0)</code> &#12391;&#12377;&#12290;&#12371;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#29366;&#24907;&#12391;&#12399;&#12289;<code>StageVideo.viewPort</code> &#38263;&#26041;&#24418;&#38936;&#22495;&#12395;&#12499;&#12487;&#12458;&#12398;&#30011;&#20687;&#20840;&#20307;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
        &#13;
	    <p><code>zoom</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#35373;&#23450;&#12391;&#12365;&#12427;&#26377;&#21177;&#12394;&#20516;&#12398;&#31684;&#22258;&#12399;&#12289;<code>(1.0, 1.0)</code> &#65374; <code>(8.0, 8.0)</code> &#12391;&#12377;&#12290;&#12474;&#12540;&#12512;&#12398; Point &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>x</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12424;&#12387;&#12390;&#27700;&#24179;&#26041;&#21521;&#12500;&#12463;&#12475;&#12523;&#12398;&#12474;&#12540;&#12512;&#20516;&#12434;&#25351;&#23450;&#12375;&#12289;y &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12424;&#12387;&#12390;&#22402;&#30452;&#26041;&#21521;&#12500;&#12463;&#12475;&#12523;&#12398;&#12474;&#12540;&#12512;&#20516;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>&#13;
		&#13;
		<p>&#20363;&#12360;&#12400;&#12289;<code>zoom</code> &#20516;&#12364; <code>(2.0, 2.0)</code> &#12398;&#22580;&#21512;&#12399;&#12289;&#27700;&#24179;&#12500;&#12463;&#12475;&#12523;&#12398;&#21322;&#25968;&#12392;&#22402;&#30452;&#12500;&#12463;&#12475;&#12523;&#12398;&#21322;&#25968;&#12384;&#12369;&#12364; <code>StageVideo.viewPort</code> &#12398;&#38263;&#26041;&#24418;&#38936;&#22495;&#20869;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;<code>StageVideo.viewPort</code> &#38936;&#22495;&#20840;&#20307;&#12364;&#12499;&#12487;&#12458;&#12391;&#21344;&#12417;&#12425;&#12428;&#12414;&#12377;&#12364;&#12289;&#12499;&#12487;&#12458;&#12398;&#21322;&#20998;&#12384;&#12369;&#12364;&#35211;&#12360;&#12427; 2 &#20493;&#12474;&#12540;&#12512;&#34920;&#31034;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289;<code>zoom</code> &#20516;&#12364; <code>(8.0, 8.0)</code> &#12398;&#22580;&#21512;&#12399;&#12289;&#27700;&#24179;&#12500;&#12463;&#12475;&#12523;&#12398; 1/8 &#12392;&#22402;&#30452;&#12500;&#12463;&#12475;&#12523;&#12398; 1/8 &#12384;&#12369;&#12364; <code>StageVideo.viewPort</code> &#12398;&#38263;&#26041;&#24418;&#38936;&#22495;&#20869;&#12395;&#34920;&#31034;&#12373;&#12428;&#12289;&#26368;&#22823;&#20493;&#29575;&#12391;&#12354;&#12427; 8 &#20493;&#12474;&#12540;&#12512;&#34920;&#31034;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
		&#13;
		<p><code>zoom</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12499;&#12487;&#12458;&#20869;&#12398;&#36969;&#20999;&#12394;&#37096;&#20998;&#12364; <code>StageVideo.viewPort</code> &#38936;&#22495;&#20869;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395; <code>pan</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
		&#13;
		<p>&#12371;&#12371;&#12391;&#12289;<code>zoom</code> Point &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>x</code> &#12362;&#12424;&#12403; <code>y</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#30064;&#12394;&#12427;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#26377;&#29992;&#12394;&#22580;&#21512;&#12398;&#20363;&#12434;&#25369;&#12370;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398; <code>zoom</code> &#20516;&#12434;&#20351;&#29992;&#12375;&#12390; <code>StageVideo.viewPort</code> &#38263;&#26041;&#24418;&#20869;&#12395;&#12499;&#12487;&#12458;&#12434;&#34920;&#31034;&#12377;&#12427;&#12392;&#12289;&#12499;&#12487;&#12458;&#12398;&#12469;&#12452;&#12474;&#12399;&#12289;&#12381;&#12398;&#38263;&#26041;&#24418;&#12395;&#12385;&#12423;&#12358;&#12393;&#21512;&#12358;&#12424;&#12358;&#12395;&#35519;&#25972;&#12373;&#12428;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12398;&#38263;&#26041;&#24418;&#12364; <code>StageVideo.viewPort</code> &#12398;&#38263;&#26041;&#24418;&#12395;&#21512;&#12431;&#12379;&#12390;&#25313;&#22823;&#12373;&#12428;&#12394;&#12356;&#12392;&#12289;&#12499;&#12487;&#12458;&#12398;&#34920;&#31034;&#12364;&#12422;&#12364;&#12416;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12499;&#12487;&#12458;&#12398;&#12450;&#12473;&#12506;&#12463;&#12488;&#27604;&#12364; <code>StageVideo.viewPort</code> &#12392;&#30064;&#12394;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#12499;&#12487;&#12458;&#12398;&#34920;&#31034;&#12364;&#12422;&#12364;&#12416;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>StageVideo.viewPort</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#27491;&#26041;&#24418;&#12398;&#12469;&#12452;&#12474;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#24133;&#12392;&#39640;&#12373;&#12364;&#30064;&#12394;&#12427;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12377;&#12427;&#12424;&#12358;&#12394;&#22580;&#21512;&#12364;&#35442;&#24403;&#12375;&#12414;&#12377;&#12290;&#12371;&#12358;&#12375;&#12383;&#29366;&#27841;&#12391;&#34920;&#31034;&#12398;&#12422;&#12364;&#12415;&#12434;&#35299;&#28040;&#12377;&#12427;&#12395;&#12399;&#12289;<code>zoom</code> Point &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>x</code> &#12362;&#12424;&#12403; <code>y</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#30064;&#12394;&#12427;&#20516;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12373;&#12425;&#12395;&#12289;&#12499;&#12487;&#12458;&#20869;&#12398;&#36969;&#20999;&#12394;&#37096;&#20998;&#12364; <code>StageVideo.viewPort</code> &#38936;&#22495;&#20869;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395; <code>pan</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p> &#13;
        &#13;
        <p><code>zoom</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#26377;&#21177;&#31684;&#22258;&#22806;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;<code>RangeError</code> &#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#20516;&#12399;&#12381;&#12398;&#21069;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12383;&#26377;&#21177;&#12394;&#20516;&#12395;&#25147;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
        &#13;
        <p>&#12414;&#12383;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20351;&#29992;&#26178;&#12395;&#12399; <code>Stage.stageVideos</code> Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35201;&#32032;&#12434; StageVideo &#22793;&#25968;&#12395;&#20195;&#20837;&#12375;&#12390;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#28857;&#12418;&#32771;&#24942;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;StageVideo &#22793;&#25968;&#12398; <code>zoom</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#35442;&#24403;&#12377;&#12427; <code>Stage.stageVideos</code> Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35201;&#32032;&#12418;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#24460;&#12391;&#12289;&#21029;&#12398; StageVideo &#22793;&#25968;&#12395;&#21516;&#12376;&#35201;&#32032;&#12434;&#20195;&#20837;&#12375;&#12390;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;<code>zoom</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#30452;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>       &#13;
		&#13;
		&#13;
        <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get zoom():<a href="../../flash/geom/Point.html">Point</a></code><br /><code>&#160;&#160;&#160;&#160;public function set zoom(value:<a href="../../flash/geom/Point.html">Point</a>):<a href="../../specialTypes.html#void">void</a></code><br /><br /><span class="label"> &#20363;&#22806; </span><br /><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../RangeError.html">RangeError</a> </code> &#8212; Point &#20516;&#12364;&#28961;&#21177;&#12391;&#12377;&#12290;&#13;
		&#13;
		</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="StageVideo.html#pan" target="">pan</a></div></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::11.4##AIR::3.4##"><a name="//apple_ref/cpp/Method/attachCamera()" class="dashAnchor" id="//apple_ref/cpp/Method/attachCamera()"></a><a name="attachCamera()" id="attachCamera()"></a><a name="attachCamera(flash.media.Camera)" id="attachCamera(flash.media.Camera)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>attachCamera</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function attachCamera(theCamera:<a href="../../flash/media/Camera.html">Camera</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 11.4, AIR 3.4</td></tr></table><p></p><p></p><p>&#13;
	&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22659;&#30028;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12459;&#12513;&#12521;&#12363;&#12425;&#12398;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12395; GPU &#12434;&#21033;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
	</p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12383;&#12521;&#12452;&#12502;&#12499;&#12487;&#12458;&#12434; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#28155;&#20184;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12427;&#12395;&#12399;&#12289;<code>null</code> &#12434;&#28193;&#12375;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">theCamera</span>:<a href="../../flash/media/Camera.html">Camera</a></code> &#8212; &#12499;&#12487;&#12458;&#12487;&#12540;&#12479;&#12434;&#12461;&#12515;&#12503;&#12481;&#12515;&#12377;&#12427; Camera &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; &#13;
	&#13;
	</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Video.html#attachCamera()" target="">flash.media.Video.attachCamera()</a><br /><a href="Camera.html" target="">flash.media.Camera</a></div></div></span><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="//apple_ref/cpp/Method/attachNetStream()" class="dashAnchor" id="//apple_ref/cpp/Method/attachNetStream()"></a><a name="attachNetStream()" id="attachNetStream()"></a><a name="attachNetStream(flash.net.NetStream)" id="attachNetStream(flash.net.NetStream)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>attachNetStream</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function attachNetStream(netStream:<a href="../../flash/net/NetStream.html">NetStream</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
        &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22659;&#30028;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12399;&#12289;NetStream.play() &#12391;&#20877;&#29983;&#12373;&#12428;&#12427;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12363;&#12289;&#12414;&#12383;&#12399; <code>null</code> &#12391;&#12377;&#12290;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12399;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12414;&#12383;&#12399; Flash Media Server &#12395;&#20445;&#23384;&#12391;&#12365;&#12414;&#12377;&#12290;<code>netStream</code> &#24341;&#25968;&#12398;&#20516;&#12395; <code>null</code> &#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12499;&#12487;&#12458;&#12364;&#20877;&#29983;&#12373;&#12428;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
        &#13;
        &#13;
        </p><p>&#20877;&#24230; <code>attachNetStream()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#21069;&#12395;&#12289;&#29694;&#22312;&#28155;&#20184;&#12373;&#12428;&#12390;&#12356;&#12427; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>close()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<code>close()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;&#12381;&#12398;&#12499;&#12487;&#12458;&#12398;&#20877;&#29983;&#12395;&#38306;&#20418;&#12377;&#12427;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12487;&#12467;&#12540;&#12480;&#12540;&#12394;&#12393;&#12398;&#12522;&#12477;&#12540;&#12473;&#12364;&#12377;&#12409;&#12390;&#35299;&#25918;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12391;&#12289;&#21029;&#12398; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12414;&#12383;&#12399; <code>null</code> &#12434;&#25351;&#23450;&#12375;&#12390; <code>attachNetStream()</code> &#12434;&#21628;&#12403;&#20986;&#12379;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
        &#13;
        <p>&#13;
        &#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12395;&#12458;&#12540;&#12487;&#12451;&#12458;&#12375;&#12363;&#21547;&#12414;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#37096;&#20998;&#12399;&#12289;<code>NetStream.play()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#33258;&#21205;&#30340;&#12395;&#20877;&#29983;&#12373;&#12428;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12458;&#12540;&#12487;&#12451;&#12458;&#12434;&#21046;&#24481;&#12377;&#12427;&#12395;&#12399;&#12289;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12434;&#20877;&#29983;&#12377;&#12427; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>soundTransform</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
        </p>        &#13;
        &#13;
        <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">netStream</span>:<a href="../../flash/net/NetStream.html">NetStream</a></code> &#8212; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12427;&#12395;&#12399;&#12289;<code>null</code> &#12434;&#28193;&#12375;&#12414;&#12377;&#12290;&#13;
        </td></tr></table></div></span><div class="detailSectionHeader"> &#12452;&#12505;&#12531;&#12488;&#12398;&#35443;&#32048; </div><span id="pageFilter" runtime="AIR::2.5##Flash::10.2##"><a name="event:renderState" id="event:renderState"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>renderState</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/StageVideoEvent.html"><code>flash.events.StageVideoEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; StageVideoEvent.type  =  </span><a href="../../flash/events/StageVideoEvent.html#RENDER_STATE"><code>flash.events.StageVideoEvent.RENDER_STATE</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5, Flash Player 10.2</td></tr></table><p></p><p></p><p>&#13;
	 StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#29366;&#24907;&#12364;&#22793;&#21270;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 &#13;
	 </p>&#13;
		<code>StageVideoEvent.RENDER_STATE</code> &#23450;&#25968;&#12399;&#12289;<code>renderState</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#13;
		<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
		 <table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>colorSpace</code></td><td>&#12499;&#12487;&#12458;&#12398;&#34920;&#31034;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12459;&#12521;&#12540;&#12473;&#12506;&#12540;&#12473;&#12391;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; StageVideoEvent &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>status</code></td><td>&#12499;&#12487;&#12458;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#65288;&#12487;&#12467;&#12540;&#12489;&#12362;&#12424;&#12403;&#34920;&#31034;&#65289;&#12364;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12392;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12393;&#12385;&#12425;&#12391;&#34892;&#12431;&#12428;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12289;&#12356;&#12387;&#12373;&#12356;&#34892;&#12431;&#12428;&#12394;&#12356;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#29366;&#24907;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383; StageVideo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr></table></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>