<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:9" /><meta name="runtime" content="lite" /><meta name="runtimever" content="lite:4" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:9" /><meta name="product" content="lite" /><meta name="productver" content="lite:4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="Video,flash.media.Video,deblocking,smoothing,videoHeight,videoWidth,attachCamera,attachNetStream,clear" /><title>Video - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.media</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  Video</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">Video  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/display/DisplayObject.html">DisplayObject</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr><tr><td class="classHeaderTableLabel">&#12469;&#12502;&#12463;&#12521;&#12473;</td><td> <a href="../../fl/video/VideoPlayer.html">VideoPlayer</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
 &#13;
 Video &#12463;&#12521;&#12473;&#12399;&#12289;&#12499;&#12487;&#12458;&#12434; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#22475;&#12417;&#36796;&#12416;&#12371;&#12392;&#12394;&#12367;&#12289;&#12521;&#12452;&#12502;&#12499;&#12487;&#12458;&#12414;&#12383;&#12399;&#37682;&#30011;&#12499;&#12487;&#12458;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12463;&#12521;&#12473;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12414;&#12383;&#12399;&#12525;&#12540;&#12459;&#12523;&#12395;&#20445;&#23384;&#12373;&#12428;&#12383;&#37682;&#30011;&#28168;&#12415;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12434;&#20877;&#29983;&#12377;&#12427; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12289;&#12414;&#12383;&#12399;&#12518;&#12540;&#12470;&#12540;&#12395;&#12424;&#12387;&#12390;&#12461;&#12515;&#12503;&#12481;&#12515;&#12373;&#12428;&#12427;&#12521;&#12452;&#12502;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12377;&#12427; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#34920;&#31034;&#12522;&#12473;&#12488;&#19978;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12426;&#12289;&#12518;&#12540;&#12470;&#12540;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12391;&#23455;&#34892;&#12373;&#12428;&#12427;&#12499;&#12487;&#12458;&#12398;&#12499;&#12472;&#12517;&#12450;&#12523;&#12473;&#12506;&#12540;&#12473;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>&#13;
 Flash Media Server &#12391;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12426;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12383;&#12521;&#12452;&#12502;&#12499;&#12487;&#12458;&#12434;&#12469;&#12540;&#12496;&#12540;&#12395;&#36865;&#20449;&#12375;&#12289;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#20182;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#27231;&#33021;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#21336;&#32020;&#12394;&#12499;&#12487;&#12458;&#12503;&#12524;&#12540;&#12516;&#12540;&#12289;&#12354;&#12427;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#21029;&#12398;&#12469;&#12540;&#12496;&#12540;&#12408;&#12398;&#12510;&#12523;&#12481;&#12509;&#12452;&#12531;&#12488;&#12497;&#12502;&#12522;&#12483;&#12471;&#12517;&#27231;&#33021;&#12434;&#25345;&#12388;&#12499;&#12487;&#12458;&#12503;&#12524;&#12540;&#12516;&#12540;&#12289;&#12518;&#12540;&#12470;&#12540;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#29992;&#12398;&#12499;&#12487;&#12458;&#20849;&#26377;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12394;&#12393;&#12398;&#12513;&#12487;&#12451;&#12450;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38283;&#30330;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
 &#13;
               <p>&#13;
 Flash Player 9 &#20197;&#38477;&#12391;&#12399;&#12289;Sorenson Spark &#12414;&#12383;&#12399; On2 VP6 &#12467;&#12540;&#12487;&#12483;&#12463;&#12391;&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12373;&#12428;&#12383; FLV &#12501;&#12449;&#12452;&#12523;&#12398;&#12497;&#12502;&#12522;&#12483;&#12471;&#12517;&#12392;&#20877;&#29983;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12289;&#12450;&#12523;&#12501;&#12449;&#12481;&#12515;&#12531;&#12493;&#12523;&#12418;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;On2 VP6 &#12499;&#12487;&#12458;&#12467;&#12540;&#12487;&#12483;&#12463;&#12399;&#12289;&#21476;&#12356;&#12486;&#12463;&#12494;&#12525;&#12472;&#12424;&#12426;&#12418;&#23569;&#12394;&#12356;&#24111;&#22495;&#24133;&#12434;&#20351;&#29992;&#12375;&#12289;&#36861;&#21152;&#12398;&#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12392;&#12522;&#12531;&#12462;&#12531;&#12464;&#38500;&#21435;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#12499;&#12487;&#12458;&#12398;&#20877;&#29983;&#12362;&#12424;&#12403;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#24418;&#24335;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;flash.net.NetStream &#12463;&#12521;&#12473;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
 &#13;
               <p>&#13;
 Flash Player 9.0.115.0 &#20197;&#38477;&#12391;&#12399;&#12289;&#23455;&#34892;&#26178;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12398;&#21697;&#36074;&#12392;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#26368;&#36969;&#21270;&#12377;&#12427;&#12511;&#12483;&#12503;&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#20877;&#29983;&#12391;&#12399;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>smoothing</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code>true</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;Flash Player &#12364;&#12511;&#12483;&#12503;&#12510;&#12483;&#12500;&#12531;&#12464;&#26368;&#36969;&#21270;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; &#13;
 </p> &#13;
 &#13;
               <p>&#13;
 &#34920;&#31034;&#12522;&#12473;&#12488;&#19978;&#12398;&#20182;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#21516;&#27096;&#12395;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21508;&#31278;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21046;&#24481;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>x</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12362;&#12424;&#12403; <code>y</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12383;&#12473;&#12486;&#12540;&#12472;&#19978;&#12391;&#12398; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#31227;&#21205;&#12289;<code>height</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12362;&#12424;&#12403; <code>width</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12383;&#12469;&#12452;&#12474;&#12398;&#22793;&#26356;&#12394;&#12393;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#13;
 </p>&#13;
 &#13;
               <p>&#13;
 &#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#20877;&#29983;&#12377;&#12427;&#12395;&#12399;&#12289;<code>attachCamera()</code> &#12414;&#12383;&#12399; <code>attachNetStream()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12499;&#12487;&#12458;&#12434; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;<code>addChild()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#34920;&#31034;&#12522;&#12473;&#12488;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
 &#13;
               <p>&#13;
 Flash Professional &#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;<code>addChild()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#36861;&#21152;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12473;&#12486;&#12540;&#12472;&#12395; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#37197;&#32622;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
 &#13;
               <ol><li>&#12521;&#12452;&#12502;&#12521;&#12522;&#12497;&#12493;&#12523;&#12434;&#34920;&#31034;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12454;&#12451;&#12531;&#12489;&#12454;&#65295;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#36984;&#25246;&#12375;&#12390;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12521;&#12452;&#12502;&#12521;&#12522;&#12497;&#12493;&#12523;&#12398;&#12479;&#12452;&#12488;&#12523;&#12496;&#12540;&#12398;&#21491;&#20596;&#12395;&#12354;&#12427;&#12300;&#12458;&#12503;&#12471;&#12519;&#12531;&#12301;&#12513;&#12491;&#12517;&#12540;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12300;&#26032;&#35215;&#12499;&#12487;&#12458;&#12301;&#12434;&#36984;&#25246;&#12375;&#12289;&#22475;&#12417;&#36796;&#12415; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12521;&#12452;&#12502;&#12521;&#12522;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12499;&#12487;&#12458;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12391;&#12289;&#12521;&#12452;&#12502;&#12521;&#12522;&#12391;&#20351;&#29992;&#12377;&#12427;&#22475;&#12417;&#36796;&#12415; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12434;&#20184;&#12369;&#12289;&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                  <li>Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12473;&#12486;&#12540;&#12472;&#12395;&#12489;&#12521;&#12483;&#12464;&#12375;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12452;&#12531;&#12473;&#12506;&#12463;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12390;&#19968;&#24847;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;&#65288;<code>my_video</code> &#12394;&#12393;&#65289;&#12434;&#20184;&#12369;&#12414;&#12377;&#12290;"Video" &#12392;&#12356;&#12358;&#21517;&#21069;&#12395;&#12399;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</li>&#13;
               </ol><p>&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12398; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12289;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12391;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12377;&#12427;&#12392;&#12289;&#31680;&#38651;&#27231;&#33021;&#12392;&#12473;&#12463;&#12522;&#12540;&#12531;&#12475;&#12540;&#12496;&#12540;&#27231;&#33021;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#65288;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#65289;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#27880;&#24847;&#65306;</b>Video &#12463;&#12521;&#12473;&#12399; InteractiveObject &#12463;&#12521;&#12473;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12391;&#12399;&#12394;&#12356;&#12383;&#12417;&#12289;&#12510;&#12454;&#12473;&#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#26684;&#32013;&#12377;&#12427;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12467;&#12531;&#12486;&#12490;&#12391; <code>addEventListener()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
 &#13;
            <p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><p id="learnMore"><span class="classHeaderTableLabel">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e58.html" target="_blank">&#34920;&#31034;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e3e.html" target="_blank">&#34920;&#31034;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12398;&#22522;&#26412;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e3c.html" target="_blank">&#12467;&#12450;&#34920;&#31034;&#12463;&#12521;&#12473;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d5b.html" target="_blank">&#12511;&#12483;&#12503;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#21033;&#29992;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d50.html" target="_blank">&#12499;&#12487;&#12458;&#12398;&#22522;&#30990;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d46.html" target="_blank">&#12499;&#12487;&#12458;&#24418;&#24335;&#12395;&#12388;&#12356;&#12390;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WSF5341774-D3CE-4749-93AE-3BA62B73733C.html" target="_blank">Flash Player &#12362;&#12424;&#12403; AIR &#12392;&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12383;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12392;&#12398;&#20114;&#25563;&#24615;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS513F633F-460F-43aa-9A10-839853A1ECA4.html" target="_blank">Adobe F4V &#12362;&#12424;&#12403; FLV &#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#24418;&#24335;&#12395;&#12388;&#12356;&#12390;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d4f.html" target="_blank">Video &#12463;&#12521;&#12473;&#12395;&#12388;&#12356;&#12390;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d48.html" target="_blank">&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#12377;&#12427;&#39640;&#24230;&#12394;&#12488;&#12500;&#12483;&#12463;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d47.html" target="_blank">&#12499;&#12487;&#12458;&#12398;&#20363;&#65306;&#12499;&#12487;&#12458;&#12472;&#12517;&#12540;&#12463;&#12508;&#12483;&#12463;&#12473;</a><br /><a href="http://help.adobe.com/en_US/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e1a.html" target="_blank">&#12499;&#12487;&#12458;&#12398;&#25805;&#20316;</a></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Video.html#attachCamera()" target="">attachCamera()</a><br /><a href="Video.html#attachNetStream()" target="">attachNetStream()</a><br /><a href="Camera.html#getCamera()" target="">flash.media.Camera.getCamera()</a><br /><a href="../../flash/net/NetConnection.html" target="">flash.net.NetConnection</a><br /><a href="../../flash/net/NetStream.html" target="">flash.net.NetStream</a><br /><a href="../../flash/display/DisplayObjectContainer.html#addChild()" target="">flash.display.DisplayObjectContainer.addChild()</a><br /><a href="../../flash/display/Stage.html#addChild()" target="">flash.display.Stage.addChild()</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#deblocking" class="signatureLink">deblocking</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">&#13;
     &#20107;&#24460;&#20966;&#29702;&#20013;&#12395;&#12289;&#12487;&#12467;&#12540;&#12489;&#12373;&#12428;&#12383;&#12499;&#12487;&#12458;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12501;&#12451;&#12523;&#12479;&#12540;&#12398;&#12479;&#12452;&#12503;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Video</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#smoothing" class="signatureLink">smoothing</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
     &#12499;&#12487;&#12458;&#12434;&#25313;&#22823; / &#32302;&#23567;&#12377;&#12427;&#38555;&#12395;&#12473;&#12512;&#12540;&#12472;&#12531;&#12464;&#65288;&#35036;&#38291;&#65289;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Video</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#videoHeight" class="signatureLink">videoHeight</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
      &#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#39640;&#12373;&#12434;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#12391;&#25351;&#23450;&#12377;&#12427;&#25972;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Video</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#videoWidth" class="signatureLink">videoWidth</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
      &#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#24133;&#12434;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#12391;&#25351;&#23450;&#12377;&#12427;&#25972;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Video</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#Video()" class="signatureLink">Video</a>(width:<a href="../../int.html">int</a> = 320, height:<a href="../../int.html">int</a> = 240)</div><div class="summaryTableDescription">&#13;
     &#26032;&#12375;&#12356; Video &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Video</td></tr><tr class="" runtime="Flash::9##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#attachCamera()" class="signatureLink">attachCamera</a>(camera:<a href="../../flash/media/Camera.html">Camera</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22659;&#30028;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12459;&#12513;&#12521;&#12363;&#12425;&#12398;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Video</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#attachNetStream()" class="signatureLink">attachNetStream</a>(netStream:<a href="../../flash/net/NetStream.html">NetStream</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22659;&#30028;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Video</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#clear()" class="signatureLink">clear</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#29694;&#22312;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12452;&#12513;&#12540;&#12472;&#65288;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12391;&#12399;&#12394;&#12356;&#65289;&#12434;&#12463;&#12522;&#12450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Video</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedEvent" id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:added" class="signatureLink">added</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#34920;&#31034;&#12522;&#12473;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9.0.28.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:addedToStage" class="signatureLink">addedToStage</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12289;&#30452;&#25509;&#12289;&#12414;&#12383;&#12399;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12469;&#12502;&#12484;&#12522;&#12540;&#12398;&#36861;&#21152;&#12395;&#12424;&#12426;&#12289;&#12473;&#12486;&#12540;&#12472;&#19978;&#12398;&#34920;&#31034;&#12522;&#12473;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:enterFrame" class="signatureLink">enterFrame</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] &#20877;&#29983;&#12504;&#12483;&#12489;&#12364;&#26032;&#12375;&#12356;&#12501;&#12524;&#12540;&#12512;&#12395;&#20837;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:exitFrame" class="signatureLink">exitFrame</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] &#20877;&#29983;&#12504;&#12483;&#12489;&#12364;&#29694;&#22312;&#12398;&#12501;&#12524;&#12540;&#12512;&#12434;&#32066;&#20102;&#12377;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:frameConstructed" class="signatureLink">frameConstructed</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] &#12501;&#12524;&#12540;&#12512;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12364;&#23455;&#34892;&#12375;&#12383;&#24460;&#12391;&#12289;&#12363;&#12388;&#12501;&#12524;&#12540;&#12512;&#12473;&#12463;&#12522;&#12503;&#12488;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:removed" class="signatureLink">removed</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#34920;&#31034;&#12522;&#12473;&#12488;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9.0.28.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:removedFromStage" class="signatureLink">removedFromStage</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12289;&#30452;&#25509;&#12289;&#12414;&#12383;&#12399;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12469;&#12502;&#12484;&#12522;&#12540;&#12398;&#21066;&#38500;&#12395;&#12424;&#12426;&#12289;&#34920;&#31034;&#12522;&#12473;&#12488;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:render" class="signatureLink">render</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] &#34920;&#31034;&#12522;&#12473;&#12488;&#12364;&#26356;&#26032;&#12362;&#12424;&#12403;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/deblocking" class="dashAnchor" id="//apple_ref/cpp/Property/deblocking"></a><a name="deblocking" id="deblocking"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>deblocking</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>deblocking:<a href="../../int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#20107;&#24460;&#20966;&#29702;&#20013;&#12395;&#12289;&#12487;&#12467;&#12540;&#12489;&#12373;&#12428;&#12383;&#12499;&#12487;&#12458;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12501;&#12451;&#12523;&#12479;&#12540;&#12398;&#12479;&#12452;&#12503;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398; 0 &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12499;&#12487;&#12458;&#12467;&#12531;&#12503;&#12524;&#12483;&#12469;&#12399;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#36969;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12499;&#12487;&#12458;&#12398;&#22311;&#32302;&#12395;&#12424;&#12387;&#12390;&#12289;&#22909;&#12414;&#12375;&#12367;&#12394;&#12356;&#29983;&#25104;&#32080;&#26524;&#12392;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<code>deblocking</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12502;&#12525;&#12483;&#12461;&#12531;&#12464;&#12392;&#12289;On2 &#12467;&#12540;&#12487;&#12483;&#12463;&#12434;&#20351;&#29992;&#12375;&#12390;&#22311;&#32302;&#12373;&#12428;&#12383;&#12499;&#12487;&#12458;&#12398;&#12522;&#12531;&#12462;&#12531;&#12464;&#12434;&#20302;&#28187;&#12377;&#12427;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><i>&#12502;&#12525;&#12483;&#12461;&#12531;&#12464;</i>&#12392;&#12399;&#12289;&#21508;&#12499;&#12487;&#12458;&#12501;&#12524;&#12540;&#12512;&#12434;&#27083;&#25104;&#12377;&#12427;&#12502;&#12525;&#12483;&#12463;&#12398;&#22659;&#30028;&#12392;&#22659;&#30028;&#12398;&#38291;&#12395;&#35211;&#12425;&#12428;&#12427;&#19981;&#20855;&#21512;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;<i>&#12522;&#12531;&#12462;&#12531;&#12464;</i>&#12392;&#12399;&#12289;&#12499;&#12487;&#12458;&#12452;&#12513;&#12540;&#12472;&#20869;&#12398;&#35201;&#32032;&#12398;&#21608;&#22258;&#12364;&#27498;&#26354;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#27425;&#12398; 2 &#12388;&#12398;&#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;1 &#12388;&#12399; Sorenson &#12467;&#12540;&#12487;&#12483;&#12463;&#12395;&#12354;&#12426;&#12289;&#12418;&#12358; 1 &#12388;&#12399; On2 VP6 &#12467;&#12540;&#12487;&#12483;&#12463;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#12373;&#12425;&#12395;&#12289;On2 VP6 &#12467;&#12540;&#12487;&#12483;&#12463;&#12434;&#20351;&#29992;&#12377;&#12427;&#38555;&#12395;&#12399;&#12522;&#12531;&#12462;&#12531;&#12464;&#38500;&#21435;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#20516;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <ul><li>0 - &#12499;&#12487;&#12458;&#12467;&#12531;&#12503;&#12524;&#12483;&#12469;&#12399;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#36969;&#29992;&#12375;&#12414;&#12377;&#12290;</li><li>1 - &#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</li><li>2 - Sorenson &#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</li><li>3 - On2 &#12499;&#12487;&#12458;&#12395;&#12398;&#12415;&#12289;On2 &#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12289;&#12522;&#12531;&#12462;&#12531;&#12464;&#38500;&#21435;&#12501;&#12451;&#12523;&#12479;&#12540;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</li><li>4 - On2 &#12499;&#12487;&#12458;&#12395;&#12398;&#12415;&#12289;On2 &#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12392;&#12522;&#12531;&#12462;&#12531;&#12464;&#38500;&#21435;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</li><li>5 - On2 &#12499;&#12487;&#12458;&#12395;&#12398;&#12415;&#12289;On2 &#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12392;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#21521;&#19978;&#12375;&#12383; On2 &#12522;&#12531;&#12462;&#12531;&#12464;&#38500;&#21435;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</li></ul><p>Sorenson &#12467;&#12540;&#12487;&#12483;&#12463;&#12398;&#20351;&#29992;&#26178;&#12395;&#12499;&#12487;&#12458;&#12395; 2 &#12424;&#12426;&#22823;&#12365;&#12356;&#20516;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;Sorenson &#12487;&#12467;&#12540;&#12480;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391; 2 &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#20840;&#20307;&#30340;&#12394;&#20877;&#29983;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12395;&#24433;&#38911;&#12375;&#12414;&#12377;&#12290;&#39640;&#24111;&#22495;&#24133;&#12398;&#12499;&#12487;&#12458;&#12395;&#12399;&#12289;&#36890;&#24120;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#38750;&#12502;&#12525;&#12483;&#12463;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#26377;&#21177;&#12395;&#12375;&#12383;&#12499;&#12487;&#12458;&#12399;&#12289;&#20966;&#29702;&#33021;&#21147;&#12398;&#20302;&#12356;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#20877;&#29983;&#12364;&#22256;&#38627;&#12394;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get deblocking():<a href="../../int.html">int</a></code><br /><code>&#160;&#160;&#160;&#160;public function set deblocking(value:<a href="../../int.html">int</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/smoothing" class="dashAnchor" id="//apple_ref/cpp/Property/smoothing"></a><a name="smoothing" id="smoothing"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>smoothing</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>smoothing:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12499;&#12487;&#12458;&#12434;&#25313;&#22823; / &#32302;&#23567;&#12377;&#12427;&#38555;&#12395;&#12473;&#12512;&#12540;&#12472;&#12531;&#12464;&#65288;&#35036;&#38291;&#65289;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12473;&#12512;&#12540;&#12472;&#12531;&#12464;&#12434;&#34892;&#12358;&#12395;&#12399;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#12364;&#39640;&#21697;&#36074;&#12514;&#12540;&#12489;&#65288;&#12487;&#12501;&#12457;&#12523;&#12488;&#65289;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; <code>false</code>&#65288;&#12473;&#12512;&#12540;&#12472;&#12531;&#12464;&#12394;&#12375;&#65289;&#12391;&#12377;&#12290;&#13;
     </p><p>Flash Player 9.0.115.0 &#20197;&#38477;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#12499;&#12487;&#12458;&#20877;&#29983;&#12391;&#12399;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code>true</code> &#12395;&#35373;&#23450;&#12375;&#12390;&#12289;&#12511;&#12483;&#12503;&#12510;&#12483;&#12500;&#12531;&#12464;&#12452;&#12513;&#12540;&#12472;&#26368;&#36969;&#21270;&#12434;&#21033;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get smoothing():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set smoothing(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p id="learnMore"><span class="label">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d5b.html" target="_blank">&#12511;&#12483;&#12503;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#21033;&#29992;</a><br /></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/videoHeight" class="dashAnchor" id="//apple_ref/cpp/Property/videoHeight"></a><a name="videoHeight" id="videoHeight"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>videoHeight</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>videoHeight:<a href="../../int.html">int</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
      &#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#39640;&#12373;&#12434;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#12391;&#25351;&#23450;&#12377;&#12427;&#25972;&#25968;&#12391;&#12377;&#12290;&#12521;&#12452;&#12502;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#20516;&#12399;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12390;&#12356;&#12427; Camera &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>Camera.height</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;&#37682;&#30011;&#28168;&#12415;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#20516;&#12399;&#12499;&#12487;&#12458;&#12398;&#39640;&#12373;&#12391;&#12377;&#12290;NetStream.Video.DimensionChange &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12371;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12499;&#12487;&#12458;&#12364;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     </p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12473;&#12486;&#12540;&#12472;&#19978;&#12398;&#23455;&#38555;&#12398; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12392;&#12399;&#38306;&#20418;&#12394;&#12367;&#12289;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12383;&#12398;&#12392;&#21516;&#12376;&#12469;&#12452;&#12474;&#12391;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#12499;&#12487;&#12458;&#12434;&#34920;&#31034;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get videoHeight():<a href="../../int.html">int</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Camera.html#height" target="">flash.media.Camera.height</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/videoWidth" class="dashAnchor" id="//apple_ref/cpp/Property/videoWidth"></a><a name="videoWidth" id="videoWidth"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>videoWidth</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>videoWidth:<a href="../../int.html">int</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
      &#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#24133;&#12434;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#12391;&#25351;&#23450;&#12377;&#12427;&#25972;&#25968;&#12391;&#12377;&#12290;&#12521;&#12452;&#12502;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#20516;&#12399;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12390;&#12356;&#12427; Camera &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>Camera.width</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;&#37682;&#30011;&#28168;&#12415;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#20516;&#12399;&#12499;&#12487;&#12458;&#12398;&#24133;&#12391;&#12377;&#12290;NetStream.Video.DimensionChange &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12371;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12499;&#12487;&#12458;&#12364;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12473;&#12486;&#12540;&#12472;&#19978;&#12398;&#23455;&#38555;&#12398; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12392;&#12399;&#38306;&#20418;&#12394;&#12367;&#12289;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12383;&#12398;&#12392;&#21516;&#12376;&#12469;&#12452;&#12474;&#12391;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#12499;&#12487;&#12458;&#12434;&#34920;&#31034;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get videoWidth():<a href="../../int.html">int</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Camera.html#width" target="">flash.media.Camera.width</a></div></div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##"><a name="//apple_ref/cpp/Constructor/Video()" class="dashAnchor" id="//apple_ref/cpp/Constructor/Video()"></a><a name="Video()" id="Video()"></a><a name="Video(int,int)" id="Video(int,int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>Video</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function Video(width:<a href="../../int.html">int</a> = 320, height:<a href="../../int.html">int</a> = 240)</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9</td></tr></table><p></p><p>&#13;
     &#26032;&#12375;&#12356; Video &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;<code>width</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392; <code>height</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21021;&#26399;&#27083;&#31689;&#24460;&#12395;&#12289;<code>Video.width</code> &#12392; <code>Video.height</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#24133;&#12392;&#39640;&#12373;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#26032;&#12375;&#12356; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#38555;&#12395;&#12289;&#24133;&#12414;&#12383;&#12399;&#39640;&#12373;&#12395; 0 &#12399;&#35373;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;0 &#12434;&#28193;&#12377;&#12392;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20316;&#25104;&#24460;&#12289;<code>DisplayObjectContainer.addChild()</code> &#12513;&#12477;&#12483;&#12489;&#12414;&#12383;&#12399; <code>DisplayObjectContainer.addChildAt()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#35242; DisplayObjectContainer &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">width</span>:<a href="../../int.html">int</a></code> (default = <code>320</code>)<code></code> &#8212; &#12499;&#12487;&#12458;&#12398;&#24133;&#65288;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#65289;&#12391;&#12377;&#12290;&#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">height</span>:<a href="../../int.html">int</a></code> (default = <code>240</code>)<code></code> &#8212; &#12499;&#12487;&#12458;&#12398;&#39640;&#12373;&#65288;&#12500;&#12463;&#12475;&#12523;&#21336;&#20301;&#65289;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12399;&#12289;&#22806;&#37096; FLV &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#26041;&#27861;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
var MyVideo:Video = new Video();&#13;
addChild(MyVideo);&#13;
 &#13;
var MyNC:NetConnection = new NetConnection();&#13;
MyNC.connect(null);&#13;
 &#13;
var MyNS:NetStream = new NetStream(MyNC);&#13;
MyNS.play("http://www.helpexamples.com/flash/video/clouds.flv");&#13;
&#13;
MyVideo.attachNetStream(MyNS);&#13;
&#13;
//the clouds.flv video has metadata we're not using, so create&#13;
//an error handler to ignore the message generated by the runtime&#13;
//about the metadata&#13;
MyNS.addEventListener(AsyncErrorEvent.ASYNC_ERROR, asyncErrorHandler); &#13;
&#13;
function asyncErrorHandler(event:AsyncErrorEvent):void &#13;
{ &#13;
   //ignore metadata error message&#13;
} &#13;
</pre></div></div></span></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##"><a name="//apple_ref/cpp/Method/attachCamera()" class="dashAnchor" id="//apple_ref/cpp/Method/attachCamera()"></a><a name="attachCamera()" id="attachCamera()"></a><a name="attachCamera(flash.media.Camera)" id="attachCamera(flash.media.Camera)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>attachCamera</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function attachCamera(camera:<a href="../../flash/media/Camera.html">Camera</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9</td></tr></table><p></p><p></p><p>&#13;
     &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22659;&#30028;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12459;&#12513;&#12521;&#12363;&#12425;&#12398;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#13;
     &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12383;&#12521;&#12452;&#12502;&#12499;&#12487;&#12458;&#12434; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#28155;&#20184;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12521;&#12452;&#12502;&#12499;&#12487;&#12458;&#12434;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12383;&#21516;&#12376;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12414;&#12383;&#12399;&#12487;&#12496;&#12452;&#12473;&#12391;&#12289;&#12525;&#12540;&#12459;&#12523;&#12395;&#12521;&#12452;&#12502;&#12499;&#12487;&#12458;&#12434;&#20877;&#29983;&#12377;&#12427;&#12371;&#12392;&#12418;&#12289;Flash Media Server &#12395;&#36865;&#20449;&#12375;&#12289;&#12469;&#12540;&#12496;&#12540;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20182;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12473;&#12488;&#12522;&#12540;&#12512;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
	 <p><b>&#27880;&#24847;&#65306;</b>iOS AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364; GPU &#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12514;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#38555;&#12395;&#12399;&#12459;&#12513;&#12521;&#12499;&#12487;&#12458;&#12399;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
	 &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">camera</span>:<a href="../../flash/media/Camera.html">Camera</a></code> &#8212; &#12499;&#12487;&#12458;&#12487;&#12540;&#12479;&#12434;&#12461;&#12515;&#12503;&#12481;&#12515;&#12377;&#12427; Camera &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12427;&#12395;&#12399;&#12289;<code>null</code> &#12434;&#28193;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Video.html#attachNetStream()" target="">Video.attachNetStream()</a><br /><a href="Camera.html" target="">flash.media.Camera</a></div><br /><span class="label"> &#20363; </span><br /><span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span><br />&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#20351;&#29992;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;<a href="Camera.html#getCamera()">Camera.getCamera()</a> &#12513;&#12477;&#12483;&#12489;&#12398;&#20363;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#13;
     </div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/attachNetStream()" class="dashAnchor" id="//apple_ref/cpp/Method/attachNetStream()"></a><a name="attachNetStream()" id="attachNetStream()"></a><a name="attachNetStream(flash.net.NetStream)" id="attachNetStream(flash.net.NetStream)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>attachNetStream</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function attachNetStream(netStream:<a href="../../flash/net/NetStream.html">NetStream</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22659;&#30028;&#20869;&#12395;&#34920;&#31034;&#12377;&#12427;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12399;&#12289;<code>NetStream.play()</code> &#12391;&#20877;&#29983;&#12373;&#12428;&#12427;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12289;Camera &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12289;&#12414;&#12383;&#12399; <code>null</code> &#12391;&#12377;&#12290;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;&#12501;&#12449;&#12452;&#12523;&#12399;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12414;&#12383;&#12399; Flash Media Server &#12395;&#20445;&#23384;&#12391;&#12365;&#12414;&#12377;&#12290;<code>netStream</code> &#24341;&#25968;&#12398;&#20516;&#12395; <code>null</code> &#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12499;&#12487;&#12458;&#12364;&#20877;&#29983;&#12373;&#12428;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#13;
     &#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12395;&#12458;&#12540;&#12487;&#12451;&#12458;&#12375;&#12363;&#21547;&#12414;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#37096;&#20998;&#12399;&#12289;<code>NetStream.play()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#33258;&#21205;&#30340;&#12395;&#20877;&#29983;&#12373;&#12428;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12458;&#12540;&#12487;&#12451;&#12458;&#12434;&#21046;&#24481;&#12377;&#12427;&#12395;&#12399;&#12289;&#12499;&#12487;&#12458;&#12501;&#12449;&#12452;&#12523;&#12434;&#20877;&#29983;&#12377;&#12427; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>soundTransform</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">netStream</span>:<a href="../../flash/net/NetStream.html">NetStream</a></code> &#8212; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12427;&#12395;&#12399;&#12289;<code>null</code> &#12434;&#28193;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Video.html#attachCamera()" target="">Video.attachCamera()</a><br /><a href="../../flash/net/NetStream.html#soundTransform" target="">flash.net.NetStream.soundTransform</a><br /><a href="../../flash/net/NetStream.html#play()" target="">flash.net.NetStream.play()</a><br /><a href="SoundTransform.html" target="">SoundTransform</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/clear()" class="dashAnchor" id="//apple_ref/cpp/Method/clear()"></a><a name="clear()" id="clear()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>clear</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function clear():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#29694;&#22312;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12452;&#12513;&#12540;&#12472;&#65288;&#12499;&#12487;&#12458;&#12473;&#12488;&#12522;&#12540;&#12512;&#12391;&#12399;&#12394;&#12356;&#65289;&#12434;&#12463;&#12522;&#12450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#29694;&#22312;&#12398;&#12452;&#12513;&#12540;&#12472;&#12434;&#20966;&#29702;&#12377;&#12427;&#22580;&#21512;&#12395;&#20415;&#21033;&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#26368;&#24460;&#12398;&#12452;&#12513;&#12540;&#12472;&#12434;&#12463;&#12522;&#12450;&#12375;&#12383;&#12426;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38750;&#34920;&#31034;&#12395;&#12379;&#12378;&#12395;&#12473;&#12479;&#12531;&#12496;&#12452;&#24773;&#22577;&#12434;&#34920;&#31034;&#12375;&#12383;&#12426;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Video.html#attachCamera()" target="">Video.attachCamera()</a></div></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">VideoExample.as</div><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; NetConnection &#12463;&#12521;&#12473;&#12362;&#12424;&#12403; NetStream &#12463;&#12521;&#12473;&#12392;&#20849;&#12395;&#20351;&#29992;&#12375;&#12390;&#12289;FLV &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12390;&#20877;&#29983;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20363;&#12434;&#23455;&#34892;&#12377;&#12427;&#12395;&#12399;&#12289;<code>videoURL</code> &#12395;&#28193;&#12373;&#12428;&#12427;&#22793;&#25968;&#12392;&#12289;&#12501;&#12449;&#12452;&#12523;&#21517;&#12362;&#12424;&#12403;&#22580;&#25152;&#12364;&#19968;&#33268;&#12377;&#12427; FLV &#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12392;&#21516;&#12376;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12354;&#12427; Video.flv &#12392;&#12356;&#12358;&#21517;&#21069;&#12398; FLV &#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;&#13;
 <p>&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12289;<code>Video.attachNetStream()</code> &#12362;&#12424;&#12403; <code>NetStream.play()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12467;&#12540;&#12489;&#12364;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12395;&#37197;&#32622;&#12373;&#12428;&#12414;&#12377;&#12290;&#12495;&#12531;&#12489;&#12521;&#12540;&#12399;&#12289;NetConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#25509;&#32154;&#12364;&#25104;&#21151;&#12375;&#12383;&#22580;&#21512;&#12395;&#12398;&#12415;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;<code>netStatus</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#12289;&#25104;&#21151;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12377; <code>code</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#20849;&#12395; info &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36820;&#12377;&#22580;&#21512;&#12391;&#12377;&#12290;&#25509;&#32154;&#12395;&#25104;&#21151;&#12377;&#12427;&#12414;&#12391;&#24453;&#12387;&#12390;&#12363;&#12425;&#12289;<code>NetStream.play()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290; </p>&#13;
 <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
&#13;
 package {&#13;
    import flash.display.Sprite;&#13;
    import flash.events.*;&#13;
    import flash.media.Video;&#13;
    import flash.net.NetConnection;&#13;
    import flash.net.NetStream;&#13;
&#13;
    public class VideoExample extends Sprite {&#13;
        private var videoURL:String = "Video.flv";&#13;
        private var connection:NetConnection;&#13;
        private var stream:NetStream;&#13;
&#13;
        public function VideoExample() {&#13;
            connection = new NetConnection();&#13;
            connection.addEventListener(NetStatusEvent.NET_STATUS, netStatusHandler);&#13;
            connection.addEventListener(SecurityErrorEvent.SECURITY_ERROR, securityErrorHandler);&#13;
            connection.connect(null);&#13;
        }&#13;
&#13;
        private function netStatusHandler(event:NetStatusEvent):void {&#13;
            switch (event.info.code) {&#13;
                case "NetConnection.Connect.Success":&#13;
                    connectStream();&#13;
                    break;&#13;
                case "NetStream.Play.StreamNotFound":&#13;
                    trace("Unable to locate video: " + videoURL);&#13;
                    break;&#13;
            }&#13;
        }&#13;
&#13;
        private function connectStream():void {&#13;
            stream = new NetStream(connection);&#13;
            stream.addEventListener(NetStatusEvent.NET_STATUS, netStatusHandler);&#13;
            stream.addEventListener(AsyncErrorEvent.ASYNC_ERROR, asyncErrorHandler);&#13;
            var video:Video = new Video();&#13;
            video.attachNetStream(stream);&#13;
            stream.play(videoURL);&#13;
            addChild(video);&#13;
        }&#13;
&#13;
        private function securityErrorHandler(event:SecurityErrorEvent):void {&#13;
            trace("securityErrorHandler: " + event);&#13;
        }&#13;
        &#13;
        private function asyncErrorHandler(event:AsyncErrorEvent):void {&#13;
            // ignore AsyncErrorEvent events.&#13;
        }&#13;
    }&#13;
 }&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>