<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:10" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:1.5$Lite:4" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:10" /><meta name="product" content="air" /><meta name="productver" content="air:1.5$Lite:4" /><link rel="stylesheet" href="style.css" type="text/css" media="screen" /><link rel="stylesheet" href="print.css" type="text/css" media="print" /><link rel="stylesheet" href="override.css" type="text/css" /><link rel="stylesheet" href="asfilter.css" type="text/css" /><link rel="stylesheet" href="ion.css" type="text/css" /><meta name="keywords" content="Vector,globalClassifier.Vector,fixed,length,concat,every,filter,forEach,indexOf,join,lastIndexOf,map,pop,push,reverse,shift,slice,some,sort,splice,toLocaleString,toString,unshift" /><title>Vector - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">&#12488;&#12483;&#12503;&#12524;&#12505;&#12523;</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public dynamic   class  Vector</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">Vector  <img src="images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
 Vector &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12505;&#12463;&#12479;&#12540;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#25805;&#20316;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12505;&#12463;&#12479;&#12540;&#12392;&#12399;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21516;&#12376;&#12487;&#12540;&#12479;&#22411;&#12434;&#25345;&#12388;&#37197;&#21015;&#12391;&#12377;&#12290;&#12505;&#12463;&#12479;&#12540;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12487;&#12540;&#12479;&#22411;&#12399;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411;&#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;<i></i>&#12505;&#12540;&#12473;&#22411;&#12399;&#12289;&#12499;&#12523;&#12488;&#12452;&#12531;&#12463;&#12521;&#12473;&#12392;&#12459;&#12473;&#12479;&#12512;&#12463;&#12521;&#12473;&#12434;&#21547;&#12416;&#20219;&#24847;&#12398;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;&#12505;&#12540;&#12473;&#22411;&#12399;&#12289;Vector &#22793;&#25968;&#12398;&#23459;&#35328;&#26178;&#12392;&#12463;&#12521;&#12473;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20316;&#25104;&#26178;&#12395;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>&#37197;&#21015;&#12398;&#22580;&#21512;&#12392;&#21516;&#27096;&#12395;&#12289;&#37197;&#21015;&#12450;&#12463;&#12475;&#12473;&#28436;&#31639;&#23376;&#65288;<code>[]</code>&#65289;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#20516;&#12434;&#35373;&#23450;&#12414;&#12383;&#12399;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#20516;&#12434;&#35373;&#23450;&#12362;&#12424;&#12403;&#21462;&#24471;&#12377;&#12427;&#12383;&#12417;&#12398;&#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#20633;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12395;&#12399;&#12289;<code>push()</code>&#12289;<code>pop()</code>&#12289;<code>shift()</code>&#12289;<code>unshift()</code> &#12394;&#12393;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#37197;&#21015;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#12513;&#12477;&#12483;&#12489;&#12392;&#20284;&#12390;&#12362;&#12426;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12399;&#21516;&#12376;&#12391;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21516;&#12376;&#12487;&#12540;&#12479;&#22411;&#12434;&#25345;&#12388;&#37197;&#21015;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#36890;&#24120;&#12399; Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#25512;&#22888;&#12373;&#12428;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#23494;&#12394;&#37197;&#21015;&#12391;&#12354;&#12426;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12372;&#12392;&#12395;&#20516;&#65288;&#12414;&#12383;&#12399; <code>null</code>&#65289;&#12434;&#25345;&#12388;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Array &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12399;&#12371;&#12398;&#21046;&#38480;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411;&#12399;&#12289;&#24460;&#32622;&#22411;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#22411;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12399;&#12289;&#12489;&#12483;&#12488;&#65288;<code>.</code>&#65289;&#12289;&#24038;&#23665;&#25324;&#24359;&#65288;<code>&lt;</code>&#65289;&#12289;&#12463;&#12521;&#12473;&#21517;&#12289;&#21491;&#23665;&#25324;&#24359;&#65288;<code>&gt;</code>&#65289;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12471;&#12540;&#12465;&#12531;&#12473;&#12391;&#12377;&#12290;&#27425;&#12395;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#20363;&#12398;&#26368;&#21021;&#12398;&#34892;&#12391;&#12399;&#12289;&#22793;&#25968; <code>v</code> &#12364; Vector.&lt;String&gt; &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12375;&#12390;&#23459;&#35328;&#12373;&#12428;&#12414;&#12377;&#12290; &#12388;&#12414;&#12426;&#12289;&#12371;&#12398;&#34892;&#12399; String &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12415;&#20445;&#25345;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;String &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12415;&#21462;&#24471;&#12391;&#12365;&#12427;&#12505;&#12463;&#12479;&#12540;&#65288;&#37197;&#21015;&#65289;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;2 &#30058;&#30446;&#12398;&#34892;&#12399;&#12289;&#21516;&#12376; Vector &#22411;&#65288;&#12388;&#12414;&#12426;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#12377;&#12409;&#12390; String &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12427;&#12505;&#12463;&#12479;&#12540;&#65289;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#31689;&#12375;&#12289;<code>v</code> &#12395;&#21106;&#12426;&#24403;&#12390;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 var v:Vector.&lt;String&gt;;&#13;
 v = new Vector.&lt;String&gt;();&#13;
 </pre></div>&#13;
 &#13;
 &#13;
 &#13;
  &#13;
 &#13;
 &#13;
 &#13;
  &#13;
 &#13;
 &#13;
 &#13;
               <p>Vector.&lt;T&gt; &#12487;&#12540;&#12479;&#22411;&#12395;&#12424;&#12387;&#12390;&#23459;&#35328;&#12373;&#12428;&#12383;&#22793;&#25968;&#12399;&#12289;&#21516;&#12376;&#12505;&#12540;&#12473;&#22411; <code>T</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#27083;&#31689;&#12373;&#12428;&#12383; Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12415;&#26684;&#32013;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#26032;&#12375;&#12356; <code>Vector.&lt;String&gt;()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#27083;&#31689;&#12373;&#12428;&#12383;&#12505;&#12463;&#12479;&#12540;&#12399;&#12289;Vector.&lt;int&gt; &#12487;&#12540;&#12479;&#22411;&#12395;&#12424;&#12387;&#12390;&#23459;&#35328;&#12373;&#12428;&#12383;&#22793;&#25968;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12505;&#12540;&#12473;&#22411;&#12399;&#23436;&#20840;&#12395;&#19968;&#33268;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#27425;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12505;&#12540;&#12473;&#22411;&#12364;&#23459;&#35328;&#12373;&#12428;&#12383;&#22793;&#25968;&#12398;&#12505;&#12540;&#12473;&#22411;&#12392;&#21516;&#12376;&#12391;&#12394;&#12356;&#12383;&#12417;&#65288;Sprite &#12364; DisplayObject &#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12391;&#12354;&#12387;&#12390;&#12418;&#65289;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 // This code doesn't compile even though Sprite is a DisplayObject subclass&#13;
 var v:Vector.&lt;DisplayObject&gt; = new Vector.&lt;Sprite&gt;();&#13;
 </pre></div>&#13;
 &#13;
               <p>&#12505;&#12540;&#12473;&#22411; <code>T</code> &#12434;&#25345;&#12388;&#12505;&#12463;&#12479;&#12540;&#12434; <code>T</code> &#12398;&#12473;&#12540;&#12497;&#12540;&#12463;&#12521;&#12473;&#12398;&#12505;&#12463;&#12479;&#12540;&#12395;&#22793;&#25563;&#12377;&#12427;&#12395;&#12399;&#12289;<code>Vector()</code> &#12464;&#12525;&#12540;&#12496;&#12523;&#38306;&#25968;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12487;&#12540;&#12479;&#22411;&#12398;&#21046;&#38480;&#12395;&#21152;&#12360;&#12390;&#12289;Vector &#12463;&#12521;&#12473;&#12395;&#12399; Array &#12463;&#12521;&#12473;&#12392;&#21306;&#21029;&#12373;&#12428;&#12427;&#27425;&#12398;&#12424;&#12358;&#12394;&#12381;&#12398;&#20182;&#12398;&#21046;&#38480;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <ul><li>&#12505;&#12463;&#12479;&#12540;&#12399;&#39640;&#23494;&#24230;&#12398;&#37197;&#21015;&#12391;&#12377;&#12290;&#20301;&#32622; 1 &#65374; 6 &#12395;&#20516;&#12364;&#12394;&#12356;&#22580;&#21512;&#12391;&#12418;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473; 0 &#12392; 7 &#12395;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#37197;&#21015;&#12392;&#12399;&#30064;&#12394;&#12426;&#12289;&#12505;&#12463;&#12479;&#12540;&#12391;&#12399;&#21508;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12395;&#20516;&#65288;&#12414;&#12383;&#12399; <code>null</code>&#65289;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12505;&#12463;&#12479;&#12540;&#12399;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#22266;&#23450;&#38263;&#12289;&#12388;&#12414;&#12426;&#21547;&#12414;&#12428;&#12427;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#25968;&#12434;&#22793;&#26356;&#12391;&#12365;&#12394;&#12356;&#12424;&#12358;&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12505;&#12463;&#12479;&#12540;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12399;&#31684;&#22258;&#12481;&#12455;&#12483;&#12463;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#26368;&#24460;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#65288;<code>length - 1</code>&#65289;&#12424;&#12426;&#38263;&#12356;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12363;&#12425;&#20516;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#29694;&#22312;&#12398;&#26368;&#24460;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#36234;&#12360;&#12390;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#65288;&#12388;&#12414;&#12426;&#12289;&#26082;&#23384;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12414;&#12383;&#12399;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473; <code>[length]</code> &#12391;&#12398;&#12415;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#65289;&#12290;</li>&#13;
               </ul><p>&#12371;&#12398;&#12424;&#12358;&#12394;&#21046;&#38480;&#12398;&#32080;&#26524;&#12392;&#12375;&#12390;&#12289;Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12399;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#12377;&#12409;&#12390;&#21336;&#19968;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12394;&#12427; Array &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12399;&#12394;&#12356;&#12289;&#27425;&#12398; 3 &#12388;&#12398;&#20027;&#35201;&#12394;&#21033;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
               <ul><li>&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#65306;Array &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12426;&#12418;&#12289;Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#26041;&#12364;&#12289;&#37197;&#21015;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12450;&#12463;&#12475;&#12473;&#12392;&#32368;&#12426;&#36820;&#12375;&#12364;&#39640;&#36895;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#22411;&#12398;&#23433;&#20840;&#24615;&#65306;strict &#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#12467;&#12531;&#12497;&#12452;&#12521;&#12540;&#12391;&#12487;&#12540;&#12479;&#22411;&#12456;&#12521;&#12540;&#12434;&#29305;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#12487;&#12540;&#12479;&#22411;&#12456;&#12521;&#12540;&#12398;&#20363;&#12392;&#12375;&#12390;&#12399;&#12289;&#12505;&#12463;&#12479;&#12540;&#12395;&#19981;&#27491;&#12394;&#12487;&#12540;&#12479;&#22411;&#12398;&#20516;&#12434;&#21106;&#12426;&#24403;&#12390;&#12383;&#12426;&#12289;&#12505;&#12463;&#12479;&#12540;&#12363;&#12425;&#20516;&#12434;&#35501;&#12415;&#21462;&#12427;&#12392;&#12365;&#12395;&#35492;&#12387;&#12383;&#12487;&#12540;&#12479;&#22411;&#12434;&#35201;&#27714;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#25369;&#12370;&#12425;&#12428;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;<code>push()</code> &#12513;&#12477;&#12483;&#12489;&#12414;&#12383;&#12399; <code>unshift()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12505;&#12463;&#12479;&#12540;&#12395;&#20516;&#12434;&#36861;&#21152;&#12377;&#12427;&#22580;&#21512;&#12289;&#24341;&#25968;&#12398;&#12487;&#12540;&#12479;&#22411;&#12399;&#12467;&#12531;&#12497;&#12452;&#12523;&#26178;&#12395;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;&#23455;&#34892;&#26178;&#12395;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#20449;&#38972;&#24615;&#65306;&#23455;&#34892;&#26178;&#31684;&#22258;&#12481;&#12455;&#12483;&#12463;&#65288;&#22266;&#23450;&#38263;&#12481;&#12455;&#12483;&#12463;&#65289;&#12399;&#12289;Array &#12395;&#23550;&#12377;&#12427;&#20449;&#38972;&#24615;&#12434;&#33879;&#12375;&#12367;&#39640;&#12417;&#12414;&#12377;&#12290;</li>&#13;
               </ul><p></p><p id="moreExamples"><span class="classHeaderTableLabel">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee1.html" target="_blank">&#37197;&#21015;&#12398;&#20316;&#25104;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WSB1F41227-C612-4f33-A00E-CE84C1913E1C.html" target="_blank">Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20316;&#25104;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee0.html" target="_blank">&#37197;&#21015;&#35201;&#32032;&#12398;&#25407;&#20837;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7edf.html" target="_blank">&#20516;&#12398;&#21462;&#24471;&#12392;&#37197;&#21015;&#35201;&#32032;&#12398;&#21066;&#38500;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7fa4.html" target="_blank">&#37197;&#21015;&#12398;&#12477;&#12540;&#12488;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7edd.html" target="_blank">&#37197;&#21015;&#12398;&#12463;&#12456;&#12522;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee8.html" target="_blank">&#37197;&#21015;&#12398;&#20363;&#65306;PlayList</a></div><p id="learnMore"><span class="classHeaderTableLabel">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7fdc.html" target="_blank">&#37197;&#21015;&#12398;&#25805;&#20316;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee3.html" target="_blank">&#37197;&#21015;&#12398;&#22522;&#30990;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee5.html" target="_blank">&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#37197;&#21015;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7eea.html" target="_blank">&#32080;&#21512;&#37197;&#21015;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee9.html" target="_blank">&#22810;&#27425;&#20803;&#37197;&#21015;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee7.html" target="_blank">&#37197;&#21015;&#12398;&#12467;&#12500;&#12540;</a><br /></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="operators.html#array_access" target="">[] array access</a><br /><a href="package.html#Vector()" target="">Vector() &#12464;&#12525;&#12540;&#12496;&#12523;&#38306;&#25968;</a><br /><a href="Array.html" target="">Array &#12463;&#12521;&#12473;</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#fixed" class="signatureLink">fixed</a> : <a href="Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#12398; length &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#length" class="signatureLink">length</a> : <a href="uint.html">uint</a><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#26377;&#21177;&#12394;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#31684;&#22258;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#Vector()" class="signatureLink">Vector</a>(length:<a href="uint.html">uint</a> = 0, fixed:<a href="Boolean.html">Boolean</a> = false)</div><div class="summaryTableDescription">&#13;
     &#25351;&#23450;&#12373;&#12428;&#12383;&#12505;&#12540;&#12473;&#22411;&#12434;&#25345;&#12388;&#12505;&#12463;&#12479;&#12540;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#concat()" class="signatureLink">concat</a>(<a href="statements.html#..._(rest)_parameter">...</a> args):<a href="Vector.html">Vector</a>.&lt;T&gt;</div><div class="summaryTableDescription">&#13;
     &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12522;&#12473;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12505;&#12463;&#12479;&#12540;&#12434;&#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12392;&#36899;&#32080;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#every()" class="signatureLink">every</a>(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
    &#25351;&#23450;&#12373;&#12428;&#12383;&#38306;&#25968;&#12395;&#12388;&#12356;&#12390; false &#12434;&#36820;&#12377;&#12450;&#12452;&#12486;&#12512;&#12395;&#36948;&#12377;&#12427;&#12414;&#12391;&#12289;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12486;&#12473;&#12488;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#filter()" class="signatureLink">filter</a>(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="Vector.html">Vector</a>.&lt;T&gt;</div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#12486;&#12473;&#12488;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#38306;&#25968;&#12395;&#12388;&#12356;&#12390; true &#12434;&#36820;&#12377;&#12377;&#12409;&#12390;&#12398;&#12450;&#12452;&#12486;&#12512;&#12434;&#21547;&#12416;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#forEach()" class="signatureLink">forEach</a>(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#indexOf()" class="signatureLink">indexOf</a>(searchElement:T, fromIndex:<a href="int.html">int</a> = 0):<a href="int.html">int</a></div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12434;&#26908;&#32034;&#12375;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#join()" class="signatureLink">join</a>(sep:<a href="String.html">String</a> = ","):<a href="String.html">String</a></div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12375;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12475;&#12497;&#12524;&#12540;&#12479;&#12540;&#12434;&#12456;&#12524;&#12513;&#12531;&#12488;&#38291;&#12395;&#25407;&#20837;&#12375;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#36899;&#32080;&#12375;&#12390;&#12289;&#12381;&#12398;&#32080;&#26524;&#12434;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#12375;&#12390;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#lastIndexOf()" class="signatureLink">lastIndexOf</a>(searchElement:T, fromIndex:<a href="int.html">int</a> = 0x7fffffff):<a href="int.html">int</a></div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12434;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12363;&#12425;&#24460;&#26041;&#12395;&#21521;&#12363;&#12387;&#12390;&#26908;&#32034;&#12375;&#12289;&#19968;&#33268;&#12375;&#12383;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#map()" class="signatureLink">map</a>(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="Vector.html">Vector</a>.&lt;T&gt;</div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12289;&#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#23550;&#12377;&#12427;&#38306;&#25968;&#12398;&#21628;&#12403;&#20986;&#12375;&#12398;&#32080;&#26524;&#12395;&#23550;&#24540;&#12377;&#12427;&#12450;&#12452;&#12486;&#12512;&#12398;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#pop()" class="signatureLink">pop</a>():T</div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#24460;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21066;&#38500;&#12375;&#12390;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#push()" class="signatureLink">push</a>(<a href="statements.html#..._(rest)_parameter">...</a> args):<a href="uint.html">uint</a></div><div class="summaryTableDescription">&#13;
     &#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#24460;&#12395;&#36861;&#21152;&#12375;&#12390;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#26032;&#12375;&#12356;&#38263;&#12373;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#reverse()" class="signatureLink">reverse</a>():<a href="Vector.html">Vector</a>.&lt;T&gt;</div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#38918;&#24207;&#12434;&#21453;&#36578;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#shift()" class="signatureLink">shift</a>():T</div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#21021;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21066;&#38500;&#12375;&#12390;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#slice()" class="signatureLink">slice</a>(startIndex:<a href="int.html">int</a> = 0, endIndex:<a href="int.html">int</a> = 16777215):<a href="Vector.html">Vector</a>.&lt;T&gt;</div><div class="summaryTableDescription">&#13;
     &#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12363;&#12425;&#19968;&#36899;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21462;&#12426;&#20986;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#some()" class="signatureLink">some</a>(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
     true &#12434;&#36820;&#12377;&#12450;&#12452;&#12486;&#12512;&#12395;&#36948;&#12377;&#12427;&#12414;&#12391;&#12289;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12486;&#12473;&#12488;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#sort()" class="signatureLink">sort</a>(sortBehavior:<a href="specialTypes.html#*">*</a>):<a href="Vector.html">Vector</a>.&lt;T&gt;</div><div class="summaryTableDescription">&#13;
     Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12477;&#12540;&#12488;&#12375;&#12289;&#12477;&#12540;&#12488;&#12373;&#12428;&#12383; Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#splice()" class="signatureLink">splice</a>(startIndex:<a href="int.html">int</a>, deleteCount:<a href="uint.html">uint</a> = 4294967295, <a href="statements.html#..._(rest)_parameter">...</a> items):<a href="Vector.html">Vector</a>.&lt;T&gt;</div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#36861;&#21152;&#12362;&#12424;&#12403;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#toLocaleString()" class="signatureLink">toLocaleString</a>():<a href="String.html">String</a></div><div class="summaryTableDescription">&#13;
     &#25351;&#23450;&#12373;&#12428;&#12383;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#34920;&#12377;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#toString()" class="signatureLink">toString</a>():<a href="String.html">String</a></div><div class="summaryTableDescription">&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#34920;&#12377;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#unshift()" class="signatureLink">unshift</a>(<a href="statements.html#..._(rest)_parameter">...</a> args):<a href="uint.html">uint</a></div><div class="summaryTableDescription">&#13;
     &#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12505;&#12463;&#12479;&#12540;&#12398;&#20808;&#38957;&#12395;&#36861;&#21152;&#12375;&#12390;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#26032;&#12375;&#12356;&#38263;&#12373;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Vector</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/fixed" class="dashAnchor" id="//apple_ref/cpp/Property/fixed"></a><a name="fixed" id="fixed"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>fixed</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>fixed:<a href="Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#12398; <code>length</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20516;&#12364; <code>true</code> &#12398;&#22580;&#21512;&#12289;<code>length</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#22793;&#26356;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;<code>fixed</code> &#12364; <code>true</code> &#12398;&#22580;&#21512;&#12289;&#27425;&#12398;&#25805;&#20316;&#12399;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><ul><li><code>length</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#30452;&#25509;&#30340;&#12394;&#35373;&#23450;</li><li>&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622; <code>length</code> &#12408;&#12398;&#20516;&#12398;&#21106;&#12426;&#24403;&#12390;</li><li><code>length</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#20197;&#19979;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#13;
         <ul><li><code>pop()</code></li><li><code>push()</code></li><li><code>Shift()</code></li><li><code>unshift()</code></li><li><code>splice()</code>&#65288;<code>splice()</code> &#21628;&#12403;&#20986;&#12375;&#12364;&#12505;&#12463;&#12479;&#12540;&#12398; <code>length</code> &#12434;&#22793;&#26356;&#12377;&#12427;&#22580;&#21512;&#65289;</li></ul></li></ul><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get fixed():<a href="Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set fixed(value:<a href="Boolean.html">Boolean</a>):<a href="specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/length" class="dashAnchor" id="//apple_ref/cpp/Property/length"></a><a name="length" id="length"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>length</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>length:<a href="uint.html">uint</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#26377;&#21177;&#12394;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#31684;&#22258;&#12391;&#12377;&#12290;Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;<code>length</code> &#20516;&#65288;&#12383;&#12384;&#12375;&#12289;&#26368;&#22823;&#20516;&#12399;&#38500;&#12367;&#65289;&#12414;&#12391;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12378;&#12409;&#12390;&#12398;&#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#24120;&#12395;&#12505;&#12540;&#12473;&#22411;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399; <code>null</code> &#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#20516;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;<code>length</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#21069;&#12398;&#20516;&#12424;&#12426;&#22823;&#12365;&#12356;&#20516;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#36861;&#21152;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;&#12505;&#12540;&#12473;&#22411;&#12395;&#36969;&#12375;&#12383;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65288;&#21442;&#29031;&#22411;&#12398;&#22580;&#21512;&#12399; <code>null</code>&#65289;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><code>length</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#21069;&#12398;&#20516;&#12424;&#12426;&#23567;&#12373;&#12356;&#20516;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#26032;&#12375;&#12356; <code>length</code> &#20516;&#20197;&#19978;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12395;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#12505;&#12463;&#12479;&#12540;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get length():<a href="uint.html">uint</a></code><br /><code>&#160;&#160;&#160;&#160;public function set length(value:<a href="uint.html">uint</a>):<a href="specialTypes.html#void">void</a></code><br /><br /><span class="label"> &#20363;&#22806; </span><br /><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="RangeError.html">RangeError</a> </code> &#8212; <code>fixed</code> &#12364; <code>true</code> &#12398;&#12392;&#12365;&#12395;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="RangeError.html">RangeError</a> </code> &#8212; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12289;&#35377;&#23481;&#12373;&#12428;&#12427;&#26368;&#22823;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#65288;2<sup>32</sup>&#65289;&#12424;&#12426;&#22823;&#12365;&#12356;&#20516;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table></div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Constructor/Vector()" class="dashAnchor" id="//apple_ref/cpp/Constructor/Vector()"></a><a name="Vector()" id="Vector()"></a><a name="Vector(uint,Boolean)" id="Vector(uint,Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>Vector</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function Vector(length:<a href="uint.html">uint</a> = 0, fixed:<a href="Boolean.html">Boolean</a> = false)</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p>&#13;
     &#25351;&#23450;&#12373;&#12428;&#12383;&#12505;&#12540;&#12473;&#22411;&#12434;&#25345;&#12388;&#12505;&#12463;&#12479;&#12540;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><code>Vector.&lt;T&gt;()</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12365;&#12395;&#12289;&#22411;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12505;&#12540;&#12473;&#22411;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#22411;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12399;&#12289;&#12489;&#12483;&#12488;&#65288;<code>.</code>&#65289;&#12289;&#24038;&#23665;&#25324;&#24359;&#65288;<code>&lt;</code>&#65289;&#12289;&#12463;&#12521;&#12473;&#21517;&#12289;&#21491;&#23665;&#25324;&#24359;&#65288;<code>&gt;</code>&#65289;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12471;&#12540;&#12465;&#12531;&#12473;&#12391;&#12377;&#12290;&#27425;&#12395;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <div class="listing">&#12467;&#12500;&#12540;<pre>&#13;
     var v:Vector.&lt;String&gt; = new Vector.&lt;String&gt;();&#13;
     </pre></div>&#13;
     &#13;
     &#13;
     &#13;
     &#13;
     &#13;
     <p>&#37197;&#21015;&#12414;&#12383;&#12399;&#20182;&#12398;&#12505;&#12463;&#12479;&#12540;&#65288;&#30064;&#12394;&#12427;&#12505;&#12540;&#12473;&#22411;&#12434;&#25345;&#12388;&#12505;&#12463;&#12479;&#12540;&#12394;&#12393;&#65289;&#12363;&#12425; Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>Vector()</code> &#12464;&#12525;&#12540;&#12496;&#12523;&#38306;&#25968;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
       &#13;
     <p>&#20107;&#21069;&#12395;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12383; Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#24460;&#36848;&#12377;&#12427;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#12399;&#12394;&#12367;&#12289;&#27425;&#12398;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <div class="listing">&#12467;&#12500;&#12540;<pre>&#13;
     // var v:Vector.&lt;T&gt; = new &lt;T&gt;[E0, ..., En-1 ,];&#13;
     // For example: &#13;
     var v:Vector.&lt;int&gt; = new &lt;int&gt;[0,1,2,];&#13;
     </pre></div>&#13;
     &#13;
     <p>&#12371;&#12398;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     </p><ul><li>&#12371;&#12398;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12399;&#12289;Flash Professional CS5 &#20197;&#38477;&#12289;Flash Builder 4 &#20197;&#38477;&#12362;&#12424;&#12403; Flex 4 &#20197;&#38477;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290; </li><li> &#26411;&#23614;&#12398;&#12459;&#12531;&#12510;&#12399;&#30465;&#30053;&#12375;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290; </li><li> &#37197;&#21015;&#20869;&#12398;&#31354;&#30333;&#12398;&#12450;&#12452;&#12486;&#12512;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;<code>var v:Vector.&lt;int&gt; = new &lt;int&gt;[0,,2,]</code> &#12398;&#12424;&#12358;&#12394;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12399;&#12289;&#12467;&#12531;&#12497;&#12452;&#12521;&#12540;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;</li><li>Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#38263;&#12373;&#12399;&#25351;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#25351;&#23450;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12364;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#38263;&#12373;&#12399;&#21021;&#26399;&#21270;&#12522;&#12473;&#12488;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#25968;&#12392;&#21516;&#12376;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; </li><li>Vector &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#22266;&#23450;&#38263;&#12395;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#25351;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#20195;&#12431;&#12426;&#12395;&#12289;<code>fixed</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; </li><li> &#20516;&#12392;&#12375;&#12390;&#28193;&#12373;&#12428;&#12383;&#12450;&#12452;&#12486;&#12512;&#12364;&#25351;&#23450;&#12375;&#12383;&#22411;&#12392;&#19968;&#33268;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#12487;&#12540;&#12479;&#12398;&#25613;&#22833;&#12414;&#12383;&#12399;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#27425;&#12395;&#23455;&#38555;&#12398;&#20351;&#29992;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</li><div class="listing">&#12467;&#12500;&#12540;<pre>&#13;
     var v:Vector.&lt;int&gt; = new &lt;int&gt;[4.2]; // compiler error when running in strict mode&#13;
     trace(v[0]); //returns 4 when not running in strict mode&#13;
     </pre></div></ul><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">length</span>:<a href="uint.html">uint</a></code> (default = <code>0</code>)<code></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#12398;&#21021;&#26399;&#38263;&#12373;&#65288;&#12456;&#12524;&#12513;&#12531;&#12488;&#25968;&#65289;&#12391;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; 0 &#12424;&#12426;&#22823;&#12365;&#12356;&#22580;&#21512;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#25968;&#12398;&#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;&#12505;&#12540;&#12473;&#22411;&#12395;&#36969;&#12375;&#12383;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#65288;&#21442;&#29031;&#22411;&#12398;&#22580;&#21512;&#12289;<code>null</code>&#65289;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">fixed</span>:<a href="Boolean.html">Boolean</a></code> (default = <code>false</code>)<code></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#12398;&#38263;&#12373;&#12364;&#22266;&#23450;&#12373;&#12428;&#12427;&#12363;&#65288;<code>true</code>&#65289;&#12289;&#12414;&#12383;&#12399;&#22793;&#26356;&#12391;&#12365;&#12427;&#12363;&#65288;<code>false</code>&#65289;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399; <code>fixed</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#fixed" target="">fixed</a><br /><a href="package.html#Vector()" target="">Vector() &#12464;&#12525;&#12540;&#12496;&#12523;&#38306;&#25968;</a></div></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/concat()" class="dashAnchor" id="//apple_ref/cpp/Method/concat()"></a><a name="concat()" id="concat()"></a><a name="concat(restParam)" id="concat(restParam)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>concat</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function concat(<a href="statements.html#..._(rest)_parameter">...</a> args):<a href="Vector.html">Vector</a>.&lt;T&gt;</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12522;&#12473;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12505;&#12463;&#12479;&#12540;&#12434;&#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12392;&#36899;&#32080;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12522;&#12473;&#12488;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411;&#12414;&#12383;&#12399;&#12469;&#12502;&#12479;&#12452;&#12503;&#12399;&#12289;&#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#12392;&#21516;&#12376;&#12418;&#12398;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#28193;&#12373;&#12394;&#12356;&#22580;&#21512;&#12289;&#36820;&#12373;&#12428;&#12427;&#12505;&#12463;&#12479;&#12540;&#12399;&#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#35079;&#35069;&#65288;&#27973;&#12356;&#35079;&#35069;&#65289;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><a href="statements.html#..._(rest)_parameter">...</a> <span class="label">args</span></code> &#8212; &#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411;&#12414;&#12383;&#12399;&#12469;&#12502;&#12479;&#12452;&#12503;&#12398;&#12505;&#12463;&#12479;&#12540;&#65288;0 &#20491;&#20197;&#19978;&#65289;&#12290; &#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Vector.html">Vector</a>.&lt;T&gt;</code> &#8212; &#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#32154;&#12356;&#12390;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12522;&#12473;&#12488;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21547;&#12414;&#12428;&#12427;&#12289;&#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#12392;&#21516;&#12376;&#12505;&#12540;&#12473;&#22411;&#12434;&#25345;&#12388;&#12505;&#12463;&#12479;&#12540;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="TypeError.html">TypeError</a> </code> &#8212; &#24341;&#25968;&#12364;&#12505;&#12540;&#12473;&#22411;&#12398;&#12505;&#12463;&#12479;&#12540;&#12391;&#12394;&#12356;&#22580;&#21512;&#12289;&#12414;&#12383;&#12399;&#12505;&#12540;&#12473;&#22411;&#12398;&#12505;&#12463;&#12479;&#12540;&#12395;&#22793;&#25563;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7edd.html" target="_blank">&#37197;&#21015;&#12398;&#12463;&#12456;&#12522;</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/every()" class="dashAnchor" id="//apple_ref/cpp/Method/every()"></a><a name="every()" id="every()"></a><a name="every(Function,Object)" id="every(Function,Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>every</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function every(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
    &#25351;&#23450;&#12373;&#12428;&#12383;&#38306;&#25968;&#12395;&#12388;&#12356;&#12390; <code>false</code> &#12434;&#36820;&#12377;&#12450;&#12452;&#12486;&#12512;&#12395;&#36948;&#12377;&#12427;&#12414;&#12391;&#12289;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12486;&#12473;&#12488;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12450;&#12452;&#12486;&#12512;&#12364;&#12354;&#12427;&#22522;&#28310;&#65288;&#20516;&#12364;&#29305;&#23450;&#12398;&#25968;&#20516;&#12424;&#12426;&#23567;&#12373;&#12356;&#12394;&#12393;&#65289;&#12434;&#28288;&#12383;&#12375;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#21029;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12391;&#12289;2 &#30058;&#30446;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>thisObject</code> &#12399;&#12289;<code>null</code> &#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#65288;&#26368;&#21021;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>callback</code> &#12364;&#12513;&#12477;&#12483;&#12489;&#38281;&#21253;&#12391;&#12354;&#12427;&#22580;&#21512;&#65289;&#12290;&#12371;&#12428;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#20351;&#29992;&#26041;&#27861;&#12391;&#12377;&#12290;</p>&#13;
    &#13;
    <p>&#12383;&#12384;&#12375;&#12289;Flash Professional &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12513;&#12452;&#12531;&#12479;&#12452;&#12512;&#12521;&#12452;&#12531;&#19978;&#12398;&#12501;&#12524;&#12540;&#12512;&#12391;&#38306;&#25968;&#12434;&#20316;&#25104;&#12375;&#12289;&#12381;&#12428;&#12434;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <pre class="flash">&#13;
    function myFunction(item:T, index:int, vector:Vector.&lt;T&gt;):Boolean {&#13;
       // your code here&#13;
    }&#13;
    </pre>&#13;
    &#13;
    <p>&#27425;&#12395;&#12289;<code>every()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#12289;<code>myVector</code> &#12392;&#12356;&#12358;&#12505;&#12463;&#12479;&#12540;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <pre class="flash">&#13;
    myVector.every(myFunction, someObject);&#13;
    </pre>&#13;
    &#13;
    <p><code>myFunction</code> &#12399; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12398;&#12513;&#12531;&#12496;&#12540;&#12394;&#12398;&#12391;&#12289;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;Flash &#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512;&#12456;&#12521;&#12540;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#38306;&#25968;&#12434;&#22793;&#25968;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <pre class="flash">&#13;
    var myFunction:Function = function(item:T, index:int, vector:Vector.&lt;T&gt;):Boolean {&#13;
        //your code here&#13;
    };&#13;
    myVector.every(myFunction, someObject);&#13;
    </pre>&#13;
    &#13;
    <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">callback</span>:<a href="Function.html">Function</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#23455;&#34892;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;&#12371;&#12398;&#38306;&#25968;&#12399;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#29694;&#22312;&#12398;&#12450;&#12452;&#12486;&#12512;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12289;&#12362;&#12424;&#12403; Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; 3 &#12388;&#12398;&#24341;&#25968;&#12395;&#12424;&#12387;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
    <pre>function callback(item:T, index:int, vector:Vector.&lt;T&gt;):Boolean {&#13;
       // your code here&#13;
    }&#13;
    </pre> &#13;
    &#13;
    <p>&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#38306;&#25968;&#12399;&#12502;&#12540;&#12523;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">thisObject</span>:<a href="Object.html">Object</a></code> (default = <code>null</code>)<code></code> &#8212; &#38306;&#25968;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#38306;&#25968;&#12398;&#35672;&#21029;&#23376; <code>this</code> &#12364;&#21442;&#29031;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
    &#13;
    </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Boolean.html">Boolean</a></code> &#8212; &#12502;&#12540;&#12523;&#20516;&#12391;&#12377;&#12290;&#25351;&#23450;&#12373;&#12428;&#12383;&#38306;&#25968;&#12395;&#12388;&#12356;&#12390;&#12289;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12450;&#12452;&#12486;&#12512;&#12364; <code>true</code> &#12434;&#36820;&#12377;&#22580;&#21512;&#12399; <code>true</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399; <code>false</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
    &#13;
    </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#some()" target="">Vector.some()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/filter()" class="dashAnchor" id="//apple_ref/cpp/Method/filter()"></a><a name="filter()" id="filter()"></a><a name="filter(Function,Object)" id="filter(Function,Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>filter</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function filter(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="Vector.html">Vector</a>.&lt;T&gt;</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#12486;&#12473;&#12488;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#38306;&#25968;&#12395;&#12388;&#12356;&#12390; <code>true</code> &#12434;&#36820;&#12377;&#12377;&#12409;&#12390;&#12398;&#12450;&#12452;&#12486;&#12512;&#12434;&#21547;&#12416;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;<code>false</code> &#12434;&#36820;&#12377;&#12450;&#12452;&#12486;&#12512;&#12399;&#12289;&#32080;&#26524;&#12505;&#12463;&#12479;&#12540;&#12395;&#21547;&#12417;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;&#25147;&#12426;&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411;&#12399;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411;&#12392;&#19968;&#33268;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12391;&#12289;2 &#30058;&#30446;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>thisObject</code> &#12399;&#12289;<code>null</code> &#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#65288;&#26368;&#21021;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>callback</code> &#12364;&#12513;&#12477;&#12483;&#12489;&#38281;&#21253;&#12391;&#12354;&#12427;&#22580;&#21512;&#65289;&#12290;&#12371;&#12428;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#20351;&#29992;&#26041;&#27861;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12383;&#12384;&#12375;&#12289;Flash Professional &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12513;&#12452;&#12531;&#12479;&#12452;&#12512;&#12521;&#12452;&#12531;&#19978;&#12398;&#12501;&#12524;&#12540;&#12512;&#12391;&#38306;&#25968;&#12434;&#20316;&#25104;&#12375;&#12289;&#12381;&#12428;&#12434;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     function myFunction(item:T, index:int, vector:Vector.&lt;T&gt;):Boolean {&#13;
        // your code here&#13;
     }&#13;
     </pre>&#13;
     &#13;
     <p>&#27425;&#12395;&#12289;<code>filter()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#12289;<code>myVector</code> &#12392;&#12356;&#12358;&#12505;&#12463;&#12479;&#12540;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     var result:Vector.&lt;T&gt; = myVector.filter(myFunction, someObject);&#13;
     </pre>&#13;
     &#13;
     <p><code>myFunction</code> &#12399; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12398;&#12513;&#12531;&#12496;&#12540;&#12394;&#12398;&#12391;&#12289;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;Flash &#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512;&#12456;&#12521;&#12540;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#38306;&#25968;&#12434;&#22793;&#25968;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     var myFunction:Function = function(item:T, index:int, vector:Vector.&lt;T&gt;):Boolean {&#13;
         //your code here&#13;
     };&#13;
     myVector.filter(myFunction, someObject);&#13;
     </pre>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">callback</span>:<a href="Function.html">Function</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#23455;&#34892;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;&#12371;&#12398;&#38306;&#25968;&#12399;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#29694;&#22312;&#12398;&#12450;&#12452;&#12486;&#12512;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12289;&#12362;&#12424;&#12403; Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; 3 &#12388;&#12398;&#24341;&#25968;&#12395;&#12424;&#12387;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     <pre>function callback(item:T, index:int, vector:Vector.&lt;T&gt;):Boolean;</pre> &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">thisObject</span>:<a href="Object.html">Object</a></code> (default = <code>null</code>)<code></code> &#8212; &#38306;&#25968;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#38306;&#25968;&#12398;&#35672;&#21029;&#23376; <code>this</code> &#12364;&#21442;&#29031;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Vector.html">Vector</a>.&lt;T&gt;</code> &#8212; &#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12391; <code>callback</code> &#38306;&#25968;&#12364; <code>true</code> &#12434;&#36820;&#12375;&#12383;&#12418;&#12398;&#12434;&#12377;&#12409;&#12390;&#21547;&#12416;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#map()" target="">Vector.map()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/forEach()" class="dashAnchor" id="//apple_ref/cpp/Method/forEach()"></a><a name="forEach()" id="forEach()"></a><a name="forEach(Function,Object)" id="forEach(Function,Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>forEach</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function forEach(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12391;&#12289;2 &#30058;&#30446;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>thisObject</code> &#12399;&#12289;<code>null</code> &#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#65288;&#26368;&#21021;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>callback</code> &#12364;&#12513;&#12477;&#12483;&#12489;&#38281;&#21253;&#12391;&#12354;&#12427;&#22580;&#21512;&#65289;&#12290;&#12371;&#12428;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#20351;&#29992;&#26041;&#27861;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12383;&#12384;&#12375;&#12289;Flash Professional &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12513;&#12452;&#12531;&#12479;&#12452;&#12512;&#12521;&#12452;&#12531;&#19978;&#12398;&#12501;&#12524;&#12540;&#12512;&#12391;&#38306;&#25968;&#12434;&#20316;&#25104;&#12375;&#12289;&#12381;&#12428;&#12434;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     function myFunction(item:T, index:int, vector:Vector.&lt;T&gt;):void {&#13;
        // your code here&#13;
     }&#13;
     </pre>&#13;
     &#13;
     <p>&#27425;&#12395;&#12289;<code>forEach()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#12289;<code>myVector</code> &#12392;&#12356;&#12358;&#12505;&#12463;&#12479;&#12540;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     myVector.forEach(myFunction, someObject);&#13;
     </pre>&#13;
     &#13;
     <p><code>myFunction</code> &#12399; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12398;&#12513;&#12531;&#12496;&#12540;&#12394;&#12398;&#12391;&#12289;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;Flash &#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512;&#12456;&#12521;&#12540;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#38306;&#25968;&#12434;&#22793;&#25968;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     var myFunction:Function = function(item:T, index:int, vector:Vector.&lt;T&gt;):void {&#13;
         //your code here&#13;
     };&#13;
     myVector.forEach(myFunction, someObject);&#13;
     </pre>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">callback</span>:<a href="Function.html">Function</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#23455;&#34892;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;&#12371;&#12398;&#38306;&#25968;&#12399;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#29694;&#22312;&#12398;&#12450;&#12452;&#12486;&#12512;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12289;&#12362;&#12424;&#12403; Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; 3 &#12388;&#12398;&#24341;&#25968;&#12395;&#12424;&#12387;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     <pre>function callback(item:T, index:int, vector:Vector.&lt;T&gt;):void;</pre>&#13;
     <p>&#38306;&#25968;&#21628;&#12403;&#20986;&#12375;&#12398;&#25147;&#12426;&#20516;&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">thisObject</span>:<a href="Object.html">Object</a></code> (default = <code>null</code>)<code></code> &#8212; &#38306;&#25968;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#38306;&#25968;&#12398;&#35672;&#21029;&#23376; <code>this</code> &#12364;&#21442;&#29031;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/indexOf()" class="dashAnchor" id="//apple_ref/cpp/Method/indexOf()"></a><a name="indexOf()" id="indexOf()"></a><a name="indexOf(T,int)" id="indexOf(T,int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>indexOf</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function indexOf(searchElement:T, fromIndex:<a href="int.html">int</a> = 0):<a href="int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12434;&#26908;&#32034;&#12375;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12450;&#12452;&#12486;&#12512;&#12399;&#12289;&#21427;&#23494;&#12394;&#31561;&#20385;&#65288;<code>===</code>&#65289;&#12434;&#20351;&#29992;&#12375;&#12390;&#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12392;&#27604;&#36611;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">searchElement</span>:T</code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12391;&#26908;&#32034;&#12377;&#12427;&#12450;&#12452;&#12486;&#12512;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">fromIndex</span>:<a href="int.html">int</a></code> (default = <code>0</code>)<code></code> &#8212; &#12450;&#12452;&#12486;&#12512;&#12398;&#26908;&#32034;&#12434;&#38283;&#22987;&#12377;&#12427;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#22580;&#25152;&#12391;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#36000;&#12398;&#22580;&#21512;&#12289;<code>length + fromIndex</code> &#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#26908;&#32034;&#12399;&#26368;&#24460;&#12398; <code>-fromIndex</code> &#12450;&#12452;&#12486;&#12512;&#12363;&#12425;&#38283;&#22987;&#12375;&#12289;&#12381;&#12398;&#20301;&#32622;&#12363;&#12425;&#21069;&#26041;&#12395;&#21521;&#12363;&#12387;&#12390;&#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#24460;&#12414;&#12391;&#26908;&#32034;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="int.html">int</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12398; 0 &#12363;&#12425;&#22987;&#12414;&#12427;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12391;&#12377;&#12290;<code>searchElement</code> &#24341;&#25968;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#25147;&#12426;&#20516;&#12399; -1 &#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#lastIndexOf()" target="">Vector.lastIndexOf()</a><br /><a href="operators.html#strict_equality" target="">=== (strict equality)</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/join()" class="dashAnchor" id="//apple_ref/cpp/Method/join()"></a><a name="join()" id="join()"></a><a name="join(String)" id="join(String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>join</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function join(sep:<a href="String.html">String</a> = ","):<a href="String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12375;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12475;&#12497;&#12524;&#12540;&#12479;&#12540;&#12434;&#12456;&#12524;&#12513;&#12531;&#12488;&#38291;&#12395;&#25407;&#20837;&#12375;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#36899;&#32080;&#12375;&#12390;&#12289;&#12381;&#12398;&#32080;&#26524;&#12434;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#12375;&#12390;&#36820;&#12375;&#12414;&#12377;&#12290;&#12493;&#12473;&#12488;&#12373;&#12428;&#12383;&#12505;&#12463;&#12479;&#12540;&#12399;&#12289;<code>join()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12373;&#12428;&#12427;&#12475;&#12497;&#12524;&#12540;&#12479;&#12540;&#12391;&#21306;&#20999;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#24120;&#12395;&#12459;&#12531;&#12510;&#65288;,&#65289;&#12391;&#21306;&#20999;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">sep</span>:<a href="String.html">String</a></code> (default = "<code>,</code>")<code></code> &#8212; &#36820;&#12373;&#12428;&#12383;&#12473;&#12488;&#12522;&#12531;&#12464;&#20869;&#12398;&#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21306;&#20999;&#12427;&#25991;&#23383;&#12414;&#12383;&#12399;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#30465;&#30053;&#12377;&#12427;&#12392;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12475;&#12497;&#12524;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390;&#12459;&#12531;&#12510;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="String.html">String</a></code> &#8212; &#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12373;&#12428;&#12383;&#12505;&#12463;&#12479;&#12540;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#27083;&#25104;&#12373;&#12428;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#21306;&#20999;&#12425;&#12428;&#12390;&#12356;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#13;
     &#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7edd.html" target="_blank">&#37197;&#21015;&#12398;&#12463;&#12456;&#12522;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="String.html#split()" target="">String.split()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/lastIndexOf()" class="dashAnchor" id="//apple_ref/cpp/Method/lastIndexOf()"></a><a name="lastIndexOf()" id="lastIndexOf()"></a><a name="lastIndexOf(T,int)" id="lastIndexOf(T,int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>lastIndexOf</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function lastIndexOf(searchElement:T, fromIndex:<a href="int.html">int</a> = 0x7fffffff):<a href="int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12434;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12363;&#12425;&#24460;&#26041;&#12395;&#21521;&#12363;&#12387;&#12390;&#26908;&#32034;&#12375;&#12289;&#19968;&#33268;&#12375;&#12383;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12450;&#12452;&#12486;&#12512;&#12399;&#12289;&#21427;&#23494;&#12394;&#31561;&#20385;&#65288;<code>===</code>&#65289;&#12434;&#20351;&#29992;&#12375;&#12390;&#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12392;&#27604;&#36611;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">searchElement</span>:T</code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12391;&#26908;&#32034;&#12377;&#12427;&#12450;&#12452;&#12486;&#12512;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">fromIndex</span>:<a href="int.html">int</a></code> (default = <code>0x7fffffff</code>)<code></code> &#8212; &#12450;&#12452;&#12486;&#12512;&#12398;&#26908;&#32034;&#12434;&#38283;&#22987;&#12377;&#12427;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#22580;&#25152;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#35377;&#23481;&#12373;&#12428;&#12427;&#26368;&#22823;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20516;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#26908;&#32034;&#12399;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#26368;&#24460;&#12398;&#12450;&#12452;&#12486;&#12512;&#12363;&#12425;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     <p>&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#36000;&#12398;&#22580;&#21512;&#12289;<code>length + fromIndex</code> &#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#26908;&#32034;&#12399;&#26368;&#24460;&#12398; <code>-fromIndex</code> &#12450;&#12452;&#12486;&#12512;&#12363;&#12425;&#38283;&#22987;&#12375;&#12289;&#12381;&#12398;&#20301;&#32622;&#12363;&#12425;&#24460;&#26041;&#12395;&#21521;&#12363;&#12387;&#12390;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473; 0 &#12414;&#12391;&#26908;&#32034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="int.html">int</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12398; 0 &#12363;&#12425;&#22987;&#12414;&#12427;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12391;&#12377;&#12290;<code>searchElement</code> &#24341;&#25968;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#25147;&#12426;&#20516;&#12399; -1 &#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#indexOf()" target="">Vector.indexOf()</a><br /><a href="operators.html#strict_equality" target="">=== (strict equality)</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/map()" class="dashAnchor" id="//apple_ref/cpp/Method/map()"></a><a name="map()" id="map()"></a><a name="map(Function,Object)" id="map(Function,Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>map</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function map(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="Vector.html">Vector</a>.&lt;T&gt;</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12289;&#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#23550;&#12377;&#12427;&#38306;&#25968;&#12398;&#21628;&#12403;&#20986;&#12375;&#12398;&#32080;&#26524;&#12395;&#23550;&#24540;&#12377;&#12427;&#12450;&#12452;&#12486;&#12512;&#12398;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#32080;&#26524;&#12505;&#12463;&#12479;&#12540;&#12395;&#12399;&#12289;&#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12392;&#21516;&#12376;&#12505;&#12540;&#12473;&#22411;&#12392; <code>length</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#32080;&#26524;&#12505;&#12463;&#12479;&#12540;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473; <code>i</code> &#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473; <code>i</code> &#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#12398;&#21628;&#12403;&#20986;&#12375;&#12398;&#32080;&#26524;&#12391;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12391;&#12289;2 &#30058;&#30446;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>thisObject</code> &#12399;&#12289;<code>null</code> &#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#65288;&#26368;&#21021;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>callback</code> &#12364;&#12513;&#12477;&#12483;&#12489;&#38281;&#21253;&#12391;&#12354;&#12427;&#22580;&#21512;&#65289;&#12290;&#12371;&#12428;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#20351;&#29992;&#26041;&#27861;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12383;&#12384;&#12375;&#12289;Flash Professional &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12513;&#12452;&#12531;&#12479;&#12452;&#12512;&#12521;&#12452;&#12531;&#19978;&#12398;&#12501;&#12524;&#12540;&#12512;&#12391;&#38306;&#25968;&#12434;&#20316;&#25104;&#12375;&#12289;&#12381;&#12428;&#12434;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     function myFunction(item:Object, index:int, vector:Vector.&lt;T&gt;):T {&#13;
        // your code here&#13;
     }&#13;
     </pre>&#13;
     &#13;
     <p>&#27425;&#12395;&#12289;<code>map()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#12289;<code>myVector</code> &#12392;&#12356;&#12358;&#12505;&#12463;&#12479;&#12540;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     myVector.map(myFunction, someObject);&#13;
     </pre>&#13;
     &#13;
     <p><code>myFunction</code> &#12399; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12398;&#12513;&#12531;&#12496;&#12540;&#12394;&#12398;&#12391;&#12289;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;Flash &#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512;&#12456;&#12521;&#12540;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#38306;&#25968;&#12434;&#22793;&#25968;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     var myFunction:Function = function(item:T, index:int, vector:Vector.&lt;T&gt;):void {&#13;
         //your code here&#13;
     };&#13;
     myVector.map(myFunction, someObject);&#13;
     </pre>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">callback</span>:<a href="Function.html">Function</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#23455;&#34892;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;&#12371;&#12398;&#38306;&#25968;&#12399;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#29694;&#22312;&#12398;&#12450;&#12452;&#12486;&#12512;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12289;&#12362;&#12424;&#12403; Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; 3 &#12388;&#12398;&#24341;&#25968;&#12395;&#12424;&#12387;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     <pre>function callback(item:T, index:int, vector:Vector.&lt;T&gt;):T;</pre> &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">thisObject</span>:<a href="Object.html">Object</a></code> (default = <code>null</code>)<code></code> &#8212; &#38306;&#25968;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#38306;&#25968;&#12398;&#35672;&#21029;&#23376; <code>this</code> &#12364;&#21442;&#29031;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Vector.html">Vector</a>.&lt;T&gt;</code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#23550;&#12377;&#12427;&#38306;&#25968;&#12398;&#21628;&#12403;&#20986;&#12375;&#12398;&#32080;&#26524;&#12364;&#21547;&#12414;&#12428;&#12427;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;&#32080;&#26524;&#12505;&#12463;&#12479;&#12540;&#12395;&#12399;&#12289;&#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12392;&#21516;&#12376;&#12505;&#12540;&#12473;&#22411;&#12392; <code>length</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#filter()" target="">Vector.filter()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/pop()" class="dashAnchor" id="//apple_ref/cpp/Method/pop()"></a><a name="pop()" id="pop()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>pop</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function pop():T</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#24460;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21066;&#38500;&#12375;&#12390;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#38306;&#25968;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398; <code>length</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; 1 &#12388;&#28187;&#23569;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code>T</code> &#8212; &#25351;&#23450;&#12373;&#12428;&#12383;&#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#24460;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#20516;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="RangeError.html">RangeError</a> </code> &#8212; <code>fixed</code> &#12364; <code>true</code> &#12398;&#12392;&#12365;&#12395;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7edf.html" target="_blank">&#20516;&#12398;&#21462;&#24471;&#12392;&#37197;&#21015;&#35201;&#32032;&#12398;&#21066;&#38500;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#push()" target="">Vector.push()</a><br /><a href="Vector.html#shift()" target="">Vector.shift()</a><br /><a href="Vector.html#unshift()" target="">Vector.unshift()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/push()" class="dashAnchor" id="//apple_ref/cpp/Method/push()"></a><a name="push()" id="push()"></a><a name="push(restParam)" id="push(restParam)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>push</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function push(<a href="statements.html#..._(rest)_parameter">...</a> args):<a href="uint.html">uint</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#24460;&#12395;&#36861;&#21152;&#12375;&#12390;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#26032;&#12375;&#12356;&#38263;&#12373;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#38306;&#25968;&#12399;&#35079;&#25968;&#12398;&#24341;&#25968;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12289;Strict &#12514;&#12540;&#12489;&#12398;&#22580;&#21512;&#12391;&#12418;&#12289;&#12467;&#12531;&#12497;&#12452;&#12523;&#26178;&#12395;&#24341;&#25968;&#12398;&#12487;&#12540;&#12479;&#22411;&#12399;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#12505;&#12540;&#12473;&#22411;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12399;&#12394;&#12356;&#24341;&#25968;&#12364;&#28193;&#12373;&#12428;&#12427;&#12392;&#12289;&#23455;&#34892;&#26178;&#12395;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><a href="statements.html#..._(rest)_parameter">...</a> <span class="label">args</span></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#20516;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="uint.html">uint</a></code> &#8212; &#26032;&#12375;&#12356;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#36861;&#21152;&#12373;&#12428;&#12383;&#24460;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#38263;&#12373;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="TypeError.html">TypeError</a> </code> &#8212; &#24341;&#25968;&#12364;&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411; <code>T</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12399;&#12394;&#12356;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="RangeError.html">RangeError</a> </code> &#8212; <code>fixed</code> &#12364; <code>true</code> &#12398;&#12392;&#12365;&#12395;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee0.html" target="_blank">&#37197;&#21015;&#35201;&#32032;&#12398;&#25407;&#20837;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#pop()" target="">Vector.pop()</a><br /><a href="Vector.html#shift()" target="">Vector.shift()</a><br /><a href="Vector.html#unshift()" target="">Vector.unshift()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/reverse()" class="dashAnchor" id="//apple_ref/cpp/Method/reverse()"></a><a name="reverse()" id="reverse()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>reverse</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function reverse():<a href="Vector.html">Vector</a>.&lt;T&gt;</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#38918;&#24207;&#12434;&#21453;&#36578;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12505;&#12463;&#12479;&#12540;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Vector.html">Vector</a>.&lt;T&gt;</code> &#8212; &#36870;&#12398;&#38918;&#24207;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#25345;&#12388;&#12505;&#12463;&#12479;&#12540;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7fa4.html" target="_blank">&#37197;&#21015;&#12398;&#12477;&#12540;&#12488;</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/shift()" class="dashAnchor" id="//apple_ref/cpp/Method/shift()"></a><a name="shift()" id="shift()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>shift</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function shift():T</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#21021;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21066;&#38500;&#12375;&#12390;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#27531;&#12426;&#12398;&#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#20803;&#12398;&#20301;&#32622; i &#12363;&#12425; i - 1 &#12395;&#31227;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code>T</code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#26368;&#21021;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="RangeError.html">RangeError</a> </code> &#8212; <code>fixed</code> &#12364; <code>true</code> &#12398;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7edf.html" target="_blank">&#20516;&#12398;&#21462;&#24471;&#12392;&#37197;&#21015;&#35201;&#32032;&#12398;&#21066;&#38500;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#pop()" target="">Vector.pop()</a><br /><a href="Vector.html#push()" target="">Vector.push()</a><br /><a href="Vector.html#unshift()" target="">Vector.unshift()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/slice()" class="dashAnchor" id="//apple_ref/cpp/Method/slice()"></a><a name="slice()" id="slice()"></a><a name="slice(int,int)" id="slice(int,int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>slice</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function slice(startIndex:<a href="int.html">int</a> = 0, endIndex:<a href="int.html">int</a> = 16777215):<a href="Vector.html">Vector</a>.&lt;T&gt;</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12363;&#12425;&#19968;&#36899;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21462;&#12426;&#20986;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#36820;&#12373;&#12428;&#12427;&#12505;&#12463;&#12479;&#12540;&#12395;&#12399;&#12289;<code>startIndex</code> &#12456;&#12524;&#12513;&#12531;&#12488;&#12363;&#12425; <code>endIndex</code> &#12398;&#21069;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12414;&#12391;&#12398;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#28193;&#12373;&#12394;&#12356;&#22580;&#21512;&#12289;&#26032;&#12375;&#12356;&#12505;&#12463;&#12479;&#12540;&#12399;&#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#35079;&#35069;&#65288;&#27973;&#12356;&#35079;&#35069;&#65289;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#20001;&#26041;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395; 0 &#12434;&#28193;&#12377;&#12392;&#12289;&#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12392;&#21516;&#12376;&#22411;&#12398;&#26032;&#12375;&#12356;&#31354;&#12398;&#12505;&#12463;&#12479;&#12540;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">startIndex</span>:<a href="int.html">int</a></code> (default = <code>0</code>)<code></code> &#8212; &#12473;&#12521;&#12452;&#12473;&#12398;&#22987;&#28857;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#31034;&#12377;&#25968;&#20516;&#12391;&#12377;&#12290;<code>startIndex</code> &#12364;&#36000;&#12398;&#25968;&#20516;&#12398;&#22580;&#21512;&#12289;&#22987;&#28857;&#12399;&#12505;&#12463;&#12479;&#12540;&#12398;&#26411;&#23614;&#12363;&#12425;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;-1 &#12364;&#26368;&#24460;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#12377;&#12290;  &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">endIndex</span>:<a href="int.html">int</a></code> (default = <code>16777215</code>)<code></code> &#8212; &#12473;&#12521;&#12452;&#12473;&#12398;&#32066;&#28857;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#31034;&#12377;&#25968;&#20516;&#12391;&#12377;&#12290; &#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#30465;&#30053;&#12377;&#12427;&#12392;&#12289;&#12473;&#12521;&#12452;&#12473;&#12395;&#12399;&#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#21021;&#12363;&#12425;&#26368;&#24460;&#12414;&#12391;&#12398;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21462;&#12426;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;<code>endIndex</code> &#12364;&#36000;&#12398;&#25968;&#20516;&#12398;&#22580;&#21512;&#12289;&#32066;&#28857;&#12399;&#12505;&#12463;&#12479;&#12540;&#12398;&#26411;&#23614;&#12363;&#12425;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;-1 &#12364;&#26368;&#24460;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Vector.html">Vector</a>.&lt;T&gt;</code> &#8212; &#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12363;&#12425;&#21462;&#12426;&#20986;&#12375;&#12383;&#19968;&#36899;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12363;&#12425;&#25104;&#12427;&#12505;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee0.html" target="_blank">&#37197;&#21015;&#35201;&#32032;&#12398;&#25407;&#20837;</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/some()" class="dashAnchor" id="//apple_ref/cpp/Method/some()"></a><a name="some()" id="some()"></a><a name="some(Function,Object)" id="some(Function,Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>some</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function some(callback:<a href="Function.html">Function</a>, thisObject:<a href="Object.html">Object</a> = null):<a href="Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     <code>true</code> &#12434;&#36820;&#12377;&#12450;&#12452;&#12486;&#12512;&#12395;&#36948;&#12377;&#12427;&#12414;&#12391;&#12289;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12486;&#12473;&#12488;&#38306;&#25968;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12356;&#12378;&#12428;&#12398;&#12450;&#12452;&#12486;&#12512;&#12418;&#12354;&#12427;&#22522;&#28310;&#65288;&#20516;&#12364;&#29305;&#23450;&#12398;&#25968;&#20516;&#12424;&#12426;&#23567;&#12373;&#12356;&#12394;&#12393;&#65289;&#12434;&#28288;&#12383;&#12375;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#21029;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12391;&#12289;2 &#30058;&#30446;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>thisObject</code> &#12399;&#12289;<code>null</code> &#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#65288;&#26368;&#21021;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>callback</code> &#12364;&#12513;&#12477;&#12483;&#12489;&#38281;&#21253;&#12391;&#12354;&#12427;&#22580;&#21512;&#65289;&#12290;&#12371;&#12428;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#20351;&#29992;&#26041;&#27861;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12383;&#12384;&#12375;&#12289;&#12513;&#12452;&#12531;&#12479;&#12452;&#12512;&#12521;&#12452;&#12531;&#19978;&#12398;&#12501;&#12524;&#12540;&#12512;&#12391;&#38306;&#25968;&#12434;&#20316;&#25104;&#12377;&#12427;&#12364;&#12289;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     function myFunction(item:Object, index:int, vector:Vector.&lt;T&gt;):Boolean {&#13;
        // your code here&#13;
     }&#13;
     </pre>&#13;
     &#13;
     <p>&#27425;&#12395;&#12289;<code>some()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#12289;<code>myVector</code> &#12392;&#12356;&#12358;&#12505;&#12463;&#12479;&#12540;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     myVector.some(myFunction, someObject);&#13;
     </pre>&#13;
     &#13;
     <p><code>myFunction</code> &#12399; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12513;&#12452;&#12531;&#12463;&#12521;&#12473;&#12398;&#12513;&#12531;&#12496;&#12540;&#12394;&#12398;&#12391;&#12289;&#30064;&#12394;&#12427; <code>this</code> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;Flash &#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12521;&#12531;&#12479;&#12452;&#12512;&#12456;&#12521;&#12540;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#38306;&#25968;&#12434;&#22793;&#25968;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre class="flash">&#13;
     var myFunction:Function = function(item:T, index:int, vector:Vector.&lt;T&gt;):Boolean {&#13;
         //your code here&#13;
     };&#13;
     myVector.some(myFunction, someObject);&#13;
     </pre>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">callback</span>:<a href="Function.html">Function</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#21508;&#12450;&#12452;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#23455;&#34892;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;&#12371;&#12398;&#38306;&#25968;&#12399;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#29694;&#22312;&#12398;&#12450;&#12452;&#12486;&#12512;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12289;&#12362;&#12424;&#12403; Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; 3 &#12388;&#12398;&#24341;&#25968;&#12395;&#12424;&#12387;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     <pre>function callback(item:T, index:int, vector:Vector.&lt;T&gt;):Boolean</pre> &#13;
     &#13;
     <p>&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#38306;&#25968;&#12399;&#12502;&#12540;&#12523;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">thisObject</span>:<a href="Object.html">Object</a></code> (default = <code>null</code>)<code></code> &#8212; &#38306;&#25968;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#38306;&#25968;&#12398;&#35672;&#21029;&#23376; <code>this</code> &#12364;&#21442;&#29031;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Boolean.html">Boolean</a></code> &#8212; &#12502;&#12540;&#12523;&#20516;&#12391;&#12377;&#12290;&#25351;&#23450;&#12373;&#12428;&#12383;&#38306;&#25968;&#12395;&#12388;&#12356;&#12390;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12450;&#12452;&#12486;&#12512;&#12364; <code>true</code> &#12434;&#36820;&#12377;&#22580;&#21512;&#12399; <code>true</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399; <code>false</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#every()" target="">every()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/sort()" class="dashAnchor" id="//apple_ref/cpp/Method/sort()"></a><a name="sort()" id="sort()"></a><a name="sort(any)" id="sort(any)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>sort</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function sort(sortBehavior:<a href="specialTypes.html#*">*</a>):<a href="Vector.html">Vector</a>.&lt;T&gt;</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12477;&#12540;&#12488;&#12375;&#12289;&#12477;&#12540;&#12488;&#12373;&#12428;&#12383; Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540; <code>sortBehavior</code>&#65288;2 &#12388;&#12398;&#20516;&#12434;&#27604;&#36611;&#12377;&#12427;&#38306;&#25968;&#12414;&#12383;&#12399;&#12477;&#12540;&#12488;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12475;&#12483;&#12488;&#65289;&#12395;&#24467;&#12387;&#12390;&#12477;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399; 1 &#12388;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#21462;&#12426;&#12414;&#12377;&#12290;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     <ul><li>Vector &#12398;&#12505;&#12540;&#12473;&#22411;&#65288;<code>T</code>&#65289;&#12398;&#24341;&#25968;&#12434; 2 &#12388;&#21462;&#12426;&#12289;Number &#12434;&#36820;&#12377;&#38306;&#25968;&#12290;&#13;
     &#13;
             <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>function compare(x:T, y:T):Number {}</pre></div>&#13;
       &#13;
     &#13;
             <p> &#38306;&#25968;&#12398;&#12525;&#12472;&#12483;&#12463;&#12395;&#12424;&#12426;&#12289;2 &#12388;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488; <code>x</code> &#12392; <code>y</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#38306;&#25968;&#12399;&#27425;&#12398; 3 &#12388;&#12398;&#20516;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
               <ul><li><code>x</code> &#12364; <code>y</code> &#12398;&#21069;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12477;&#12540;&#12488;&#38918;&#12398;&#22580;&#21512;&#12399;&#36000;&#12398;&#25968;&#12290;</li><li><code>x</code> &#12392; <code>y</code> &#12364;&#31561;&#12375;&#12356;&#22580;&#21512;&#12399; 0&#12290;</li><li><code>x</code> &#12364; <code>y</code> &#12398;&#24460;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12477;&#12540;&#12488;&#38918;&#12398;&#22580;&#21512;&#12399;&#27491;&#12398;&#25968;&#12290;</li></ul><p></p>&#13;
          </li><li>&#27425;&#12398;&#20516;&#12398;&#12499;&#12483;&#12488;&#21336;&#20301;&#12398;&#35542;&#29702;&#21644;&#65288;OR&#65289;&#12392;&#12394;&#12427;&#25968;&#20516;&#12391;&#12377;&#12290;&#13;
              <ul><li>1 &#12414;&#12383;&#12399; <code>Array.CASEINSENSITIVE</code></li><li>2 &#12414;&#12383;&#12399; <code>Array.DESCENDING</code></li><li>4 &#12414;&#12383;&#12399; <code>Array.UNIQUESORT</code></li><li>8 &#12414;&#12383;&#12399; <code>Array.RETURNINDEXEDARRAY</code> </li><li>16 &#12414;&#12383;&#12399; <code>Array.NUMERIC</code></li></ul><p>&#20516;&#12364; 0 &#12398;&#22580;&#21512;&#12289;&#12477;&#12540;&#12488;&#12399;&#20197;&#19979;&#12398;&#26041;&#27861;&#12391;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
                </p><ul><li>&#12477;&#12540;&#12488;&#12391;&#12399;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12364;&#21306;&#21029;&#12373;&#12428;&#12414;&#12377;&#12290;<i>Z</i> &#12399; <i>a</i> &#12424;&#12426;&#12418;&#20808;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</li><li>&#26119;&#38918;&#12395;&#12477;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;<i>a</i> &#12399; <i>b</i> &#12424;&#12426;&#12418;&#20808;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; </li><li>&#37197;&#21015;&#12399;&#12477;&#12540;&#12488;&#38918;&#12434;&#21453;&#26144;&#12377;&#12427;&#12424;&#12358;&#12395;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#21516;&#12376;&#12477;&#12540;&#12488;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#25345;&#12388;&#35079;&#25968;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#12477;&#12540;&#12488;&#28168;&#12415;&#12398;&#37197;&#21015;&#12398;&#20013;&#12391;&#36899;&#32154;&#30340;&#12363;&#12388;&#12521;&#12531;&#12480;&#12512;&#12395;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>&#12487;&#12540;&#12479;&#22411;&#12395;&#38306;&#20418;&#12394;&#12367;&#12289;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#12375;&#12390;&#12477;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;"1" &#12399; "9" &#12424;&#12426;&#12418;&#23567;&#12373;&#12356;&#12473;&#12488;&#12522;&#12531;&#12464;&#20516;&#12391;&#12354;&#12427;&#12383;&#12417;&#12289;100 &#12399; 99 &#12424;&#12426;&#12418;&#20808;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</li></ul></li></ul><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">sortBehavior</span>:<a href="specialTypes.html#*">*</a></code> &#8212; &#12477;&#12540;&#12488;&#12398;&#21205;&#20316;&#12434;&#27770;&#23450;&#12377;&#12427; <code>Function</code> &#12414;&#12383;&#12399; <code>Number</code> &#20516;&#12290;<code>Function</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#27604;&#36611;&#12513;&#12477;&#12483;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code>Number</code> &#20516;&#12399;&#12477;&#12540;&#12488;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     &#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Vector.html">Vector</a>.&lt;T&gt;</code> &#8212; &#26032;&#12375;&#12356;&#38918;&#24207;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#25345;&#12388; Vector &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7fa4.html" target="_blank">&#37197;&#21015;&#12398;&#12477;&#12540;&#12488;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Array.html#sort()" target="">Array.sort()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/splice()" class="dashAnchor" id="//apple_ref/cpp/Method/splice()"></a><a name="splice()" id="splice()"></a><a name="splice(int,uint,restParam)" id="splice(int,uint,restParam)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>splice</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function splice(startIndex:<a href="int.html">int</a>, deleteCount:<a href="uint.html">uint</a> = 4294967295, <a href="statements.html#..._(rest)_parameter">...</a> items):<a href="Vector.html">Vector</a>.&lt;T&gt;</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#36861;&#21152;&#12362;&#12424;&#12403;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12467;&#12500;&#12540;&#12434;&#20316;&#25104;&#12375;&#12394;&#12356;&#12391;&#12289;&#12505;&#12463;&#12479;&#12540;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><b>&#27880;&#24847;&#65306;</b>&#12505;&#12463;&#12479;&#12540;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#20869;&#12391;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#20363;&#12395;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395; <code>...args</code> &#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre>&#13;
     public override function splice(...args) {&#13;
       // your statements here&#13;
     }&#13;
     </pre>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">startIndex</span>:<a href="int.html">int</a></code> &#8212; &#25407;&#20837;&#12414;&#12383;&#12399;&#21066;&#38500;&#12434;&#38283;&#22987;&#12377;&#12427;&#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#31034;&#12377;&#25972;&#25968;&#12391;&#12377;&#12290;&#36000;&#12398;&#25972;&#25968;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#26411;&#23614;&#12434;&#22522;&#28310;&#12392;&#12375;&#12390;&#20301;&#32622;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;-1 &#12399;&#12505;&#12463;&#12479;&#12540;&#12398;&#26368;&#24460;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">deleteCount</span>:<a href="uint.html">uint</a></code> (default = <code>4294967295</code>)<code></code> &#8212; &#21066;&#38500;&#12377;&#12427;&#12456;&#12524;&#12513;&#12531;&#12488;&#25968;&#12434;&#31034;&#12377;&#25972;&#25968;&#12391;&#12377;&#12290;&#12371;&#12398;&#25968;&#12395;&#12399;&#12289;<code>startIndex</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#25351;&#23450;&#12377;&#12427;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#20516;&#12392;&#12375;&#12390; 0 &#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#21066;&#38500;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><a href="statements.html#..._(rest)_parameter">...</a> <span class="label">items</span></code> &#8212; <code>startIndex</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#25351;&#23450;&#12375;&#12383;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#20301;&#32622;&#12395;&#25407;&#20837;&#12377;&#12427;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#20516;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12522;&#12473;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="Vector.html">Vector</a>.&lt;T&gt;</code> &#8212; &#20803;&#12398;&#12505;&#12463;&#12479;&#12540;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12383;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#21547;&#12416;&#12505;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="RangeError.html">RangeError</a> </code> &#8212; <code>startIndex</code> &#12392; <code>deleteCount</code> &#24341;&#25968;&#12364;&#12505;&#12463;&#12479;&#12540;&#12398;&#22659;&#30028;&#22806;&#12395;&#12354;&#12427;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="RangeError.html">RangeError</a> </code> &#8212; &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364; <code>fixed</code> &#12364; <code>true</code> &#12398;&#12392;&#12365;&#12395;&#21628;&#12403;&#20986;&#12373;&#12428;&#12289;<code>splice()</code> &#28436;&#31639;&#12395;&#12424;&#12387;&#12390;&#12505;&#12463;&#12479;&#12540;&#12398; <code>length</code> &#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7edf.html" target="_blank">&#20516;&#12398;&#21462;&#24471;&#12392;&#37197;&#21015;&#35201;&#32032;&#12398;&#21066;&#38500;</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/toLocaleString()" class="dashAnchor" id="//apple_ref/cpp/Method/toLocaleString()"></a><a name="toLocaleString()" id="toLocaleString()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>toLocaleString</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function toLocaleString():<a href="String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#25351;&#23450;&#12373;&#12428;&#12383;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#34920;&#12377;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473; 0 &#12363;&#12425;&#26368;&#22823;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12414;&#12391;&#12398;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12289;&#12459;&#12531;&#12510;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#36899;&#32080;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12375;&#12390;&#36820;&#12375;&#12414;&#12377;&#12290;ActionScript 3.0 &#23455;&#35013;&#12395;&#12362;&#12356;&#12390;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;<code>Vector.toString()</code> &#12392;&#21516;&#12376;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="String.html">String</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#toString()" target="">Vector.toString()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/toString()" class="dashAnchor" id="//apple_ref/cpp/Method/toString()"></a><a name="toString()" id="toString()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>toString</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function toString():<a href="String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#34920;&#12377;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473; 0 &#12363;&#12425;&#26368;&#22823;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12414;&#12391;&#12398;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12289;&#12459;&#12531;&#12510;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#36899;&#32080;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12375;&#12390;&#36820;&#12375;&#12414;&#12377;&#12290;&#12459;&#12473;&#12479;&#12512;&#12475;&#12497;&#12524;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;<code>Vector.join()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="String.html">String</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7edd.html" target="_blank">&#37197;&#21015;&#12398;&#12463;&#12456;&#12522;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="String.html#split()" target="">String.split()</a><br /><a href="Vector.html#join()" target="">Vector.join()</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/unshift()" class="dashAnchor" id="//apple_ref/cpp/Method/unshift()"></a><a name="unshift()" id="unshift()"></a><a name="unshift(restParam)" id="unshift(restParam)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>unshift</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> <a href="statements.html#AS3">AS3</a> function unshift(<a href="statements.html#..._(rest)_parameter">...</a> args):<a href="uint.html">uint</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12505;&#12463;&#12479;&#12540;&#12398;&#20808;&#38957;&#12395;&#36861;&#21152;&#12375;&#12390;&#12289;&#12505;&#12463;&#12479;&#12540;&#12398;&#26032;&#12375;&#12356;&#38263;&#12373;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12505;&#12463;&#12479;&#12540;&#20869;&#12398;&#12381;&#12398;&#20182;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#20803;&#12398;&#20301;&#32622; i &#12363;&#12425; i &#12395;&#26032;&#12375;&#12356;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#25968;&#12434;&#21152;&#12360;&#12383;&#20301;&#32622;&#12395;&#31227;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#38306;&#25968;&#12399;&#35079;&#25968;&#12398;&#24341;&#25968;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12289;Strict &#12514;&#12540;&#12489;&#12398;&#22580;&#21512;&#12391;&#12418;&#12289;&#12467;&#12531;&#12497;&#12452;&#12523;&#26178;&#12395;&#24341;&#25968;&#12398;&#12487;&#12540;&#12479;&#22411;&#12399;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#12505;&#12540;&#12473;&#22411;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12399;&#12394;&#12356;&#24341;&#25968;&#12364;&#28193;&#12373;&#12428;&#12427;&#12392;&#12289;&#23455;&#34892;&#26178;&#12395;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><a href="statements.html#..._(rest)_parameter">...</a> <span class="label">args</span></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#12398;&#20808;&#38957;&#12395;&#25407;&#20837;&#12373;&#12428;&#12427;&#12371;&#12398;&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411;&#12398; 1 &#12388;&#20197;&#19978;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12290;  &#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="uint.html">uint</a></code> &#8212; &#12505;&#12463;&#12479;&#12540;&#12398;&#26032;&#12375;&#12356;&#38263;&#12373;&#12434;&#34920;&#12377;&#25972;&#25968;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="TypeError.html">TypeError</a> </code> &#8212; &#24341;&#25968;&#12364;&#12505;&#12463;&#12479;&#12540;&#12398;&#12505;&#12540;&#12473;&#22411; <code>T</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12399;&#12394;&#12356;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="RangeError.html">RangeError</a> </code> &#8212; <code>fixed</code> &#12364; <code>true</code> &#12398;&#12392;&#12365;&#12395;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7ee0.html" target="_blank">&#37197;&#21015;&#35201;&#32032;&#12398;&#25407;&#20837;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Vector.html#pop()" target="">Vector.pop()</a><br /><a href="Vector.html#push()" target="">Vector.push()</a><br /><a href="Vector.html#shift()" target="">Vector.shift()</a></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>