<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:10" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:1.5" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:10" /><meta name="product" content="air" /><meta name="productver" content="air:1.5" /><meta name="product" content="flex" /><meta name="prodver" content="flex:4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="AnimateTransitionShader,spark.effects.AnimateTransitionShader,bitmapFrom,bitmapTo,shaderByteCode,shaderProperties" /><title>AnimateTransitionShader - Adobe ActionScript&#174; 3&#65288;AS3  Flex&#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">spark.effects</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  AnimateTransitionShader</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">AnimateTransitionShader  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../spark/effects/Animate.html">Animate</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../mx/effects/Effect.html">Effect</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr><tr><td class="classHeaderTableLabel">&#12469;&#12502;&#12463;&#12521;&#12473;</td><td> <a href="../../spark/effects/CrossFade.html">CrossFade</a>,  <a href="../../spark/effects/Wipe.html">Wipe</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><br /><table width="100%" class="innertable"><tr><td class="discouraged"><img src="../../images/AlternativeMetadataIndicator.png" /></td><td class="discouraged">&#13;
  AnimateTransitionShader &#12456;&#12501;&#12455;&#12463;&#12488;&#12399;&#12289;AIR &#12514;&#12496;&#12452;&#12523;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356; Pixel Bender &#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
 </td></tr></table><br /><p></p>&#13;
 AnimateTransitionShader &#12456;&#12501;&#12455;&#12463;&#12488;&#12399;&#12289;&#38283;&#22987;&#12473;&#12486;&#12540;&#12488;&#12434;&#34920;&#12377;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#65288;<code>bitmapFrom</code>&#65289;&#12392;&#32066;&#20102;&#12473;&#12486;&#12540;&#12488;&#12434;&#34920;&#12377;&#21029;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#65288;<code>bitmapTo</code>&#65289;&#12392;&#12356;&#12358;&#12289;2 &#12388;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12398;&#38291;&#12391;&#12488;&#12521;&#12531;&#12472;&#12471;&#12519;&#12531;&#12434;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#21270;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#21270;&#12434;&#34892;&#12358;&#38555;&#12395;&#12399;&#12289;2 &#12388;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12434;&#20837;&#21147;&#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12289;<code>shader</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12399;&#12289;flash.display.BitmapData &#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12424;&#12387;&#12390;&#34920;&#12373;&#12428;&#12414;&#12377;&#12290;Adobe Pixel Bender Toolkit &#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#29420;&#33258;&#12398;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12356;&#12378;&#12428;&#12363;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12364;&#25552;&#20379;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#12488;&#12521;&#12531;&#12472;&#12471;&#12519;&#12531;&#12391;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#36969;&#20999;&#12394;&#12473;&#12486;&#12540;&#12488;&#12363;&#12425;&#12289;&#12414;&#12383;&#12399;&#12488;&#12521;&#12531;&#12472;&#12471;&#12519;&#12531;&#12391;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#30452;&#25509;&#12479;&#12540;&#12466;&#12483;&#12488;&#12363;&#12425;&#12289;&#12381;&#12398;&#20516;&#12364;&#21205;&#30340;&#12395;&#27770;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#12488;&#12521;&#12531;&#12472;&#12471;&#12519;&#12531;&#12391;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12289;&#12381;&#12398;&#12473;&#12486;&#12540;&#12488;&#22793;&#26356;&#20013;&#12395;&#12479;&#12540;&#12466;&#12483;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#28040;&#12360;&#12427;&#12363;&#20986;&#29694;&#12377;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12365;&#12398;&#12473;&#12486;&#12540;&#12488;&#12434;&#34920;&#12377;&#12383;&#12417;&#12395;&#12289;&#23436;&#20840;&#12395;&#36879;&#26126;&#12394;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12399;&#12289;UIComponent &#12414;&#12383;&#12399; GraphicElement &#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12354;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#23550;&#12375;&#12390;&#12398;&#12415;&#23455;&#34892;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12434;&#12461;&#12515;&#12503;&#12481;&#12515;&#12377;&#12427;&#38555;&#12395;&#12289;&#12371;&#12428;&#12425;&#12398;&#12463;&#12521;&#12473;&#12395;&#12398;&#12415;&#23384;&#22312;&#12377;&#12427;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12364;&#24517;&#35201;&#12391;&#12354;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12456;&#12501;&#12455;&#12463;&#12488;&#12399;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12395;&#22522;&#12389;&#12356;&#12390;&#12362;&#12426;&#12289;&#22522;&#12395;&#12394;&#12427;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#20001;&#26041;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12364;&#21516;&#12376;&#12469;&#12452;&#12474;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#21069;&#25552;&#12392;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#12456;&#12501;&#12455;&#12463;&#12488;&#12399;&#20001;&#26041;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12364;&#21516;&#12376;&#12469;&#12452;&#12474;&#12391;&#12354;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#27491;&#12375;&#12367;&#27231;&#33021;&#12375;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12414;&#12383;&#12399;&#26041;&#21521;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#22659;&#30028;&#12508;&#12483;&#12463;&#12473;&#12398;&#12469;&#12452;&#12474;&#12364;&#22793;&#12431;&#12427;&#12392;&#12289;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#27491;&#12375;&#12367;&#20877;&#29983;&#12373;&#12428;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12392;&#12381;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12399;&#12289;Flex &#12395;&#12354;&#12427;&#20182;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12392;&#12399;&#30064;&#12394;&#12426;&#12289;&#21336;&#29420;&#12391;&#27231;&#33021;&#12377;&#12427;&#12371;&#12392;&#12364;&#21069;&#25552;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#20182;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12392;&#21516;&#26178;&#12395;&#23455;&#34892;&#12373;&#12428;&#12427;&#12392;&#12289;&#24847;&#22259;&#12375;&#12383;&#32080;&#26524;&#12395;&#12394;&#12425;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#21046;&#32004;&#12364;&#12354;&#12427;&#12398;&#12399;&#12289;&#21069;&#12392;&#24460;&#12398;&#20001;&#26041;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12364;&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#38283;&#22987;&#21069;&#12395;&#12461;&#12515;&#12503;&#12481;&#12515;&#12373;&#12428;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12371;&#12428;&#12425;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12364;&#35336;&#31639;&#12373;&#12428;&#12383;&#24460;&#12395;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12289;&#21029;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12395;&#12424;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#22793;&#26356;&#12392;&#12356;&#12387;&#12383;&#20309;&#12425;&#12363;&#12398;&#20966;&#29702;&#12364;&#34892;&#12431;&#12428;&#12383;&#22580;&#21512;&#12289;&#20107;&#21069;&#12395;&#35336;&#31639;&#12373;&#12428;&#12383;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12391;&#12399;&#12381;&#12428;&#12425;&#12398;&#22793;&#26356;&#12364;&#21453;&#26144;&#12373;&#12428;&#12378;&#12289;&#32080;&#26524;&#12364;&#26399;&#24453;&#12393;&#12362;&#12426;&#12398;&#12418;&#12398;&#12395;&#12394;&#12425;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12395;&#22522;&#12389;&#12367;&#12456;&#12501;&#12455;&#12463;&#12488;&#12434;&#27491;&#12375;&#12367;&#20877;&#29983;&#12377;&#12427;&#12395;&#12399;&#12289;&#23550;&#35937;&#12392;&#12394;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#12456;&#12501;&#12455;&#12463;&#12488;&#12434;&#21336;&#29420;&#12391;&#20877;&#29983;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
  &#13;
            <p></p><a name="mxmlSyntaxSummary" id="mxmlSyntaxSummary"></a><span class="classHeaderTableLabel">MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;</span><span id="showMxmlLink" style="display:none"><a href="#mxmlSyntaxSummary" onclick="toggleMXMLOnly();"><img src="../../images/collapsed.gif" title="collapsed" alt="collapsed" class="collapsedImage" />MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#34920;&#31034;</a><br /></span><span id="hideMxmlLink"><a href="#mxmlSyntaxSummary" onclick="toggleMXMLOnly();"><img src="../../images/expanded.gif" title="expanded" alt="expanded" class="expandedImage" />MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#38560;&#12377;</a></span><div id="mxmlSyntax" class="mxmlSyntax">&#13;
 &#13;
  <p>The <code>&lt;s:AnimateTransitionShader&gt;</code> tag&#13;
  inherits all of the tag attributes of its superclass,&#13;
  and adds the following tag attributes:</p>&#13;
 &#13;
  <pre>&#13;
  &lt;s:AnimateTransitionShader&#13;
    <b>Properties</b>&#13;
    id="ID"&#13;
    bitmapFrom="no default"&#13;
    bitmapTo="no default"&#13;
    shaderByteCode="no default"&#13;
    sahderProperties="no default"&#13;
  /&gt;&#13;
  </pre>&#13;
 &#13;
  </div><p><span class="classHeaderTableLabel">&#12487;&#12501;&#12457;&#12523;&#12488;&#12398; MXML &#12503;&#12525;&#12497;&#12486;&#12451;</span><code>motionPaths</code></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/display/BitmapData.html" target="">flash.display.BitmapData</a><br /><a href="../../spark/effects/supportClasses/AnimateTransitionShaderInstance.html" target="">spark.effects.supportClasses.AnimateTransitionShaderInstance</a><br /><a href="../../spark/primitives/supportClasses/GraphicElement.html" target="">spark.primitives.supportClasses.GraphicElement</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#bitmapFrom" class="signatureLink">bitmapFrom</a> : <a href="../../flash/display/BitmapData.html">BitmapData</a><div class="summaryTableDescription">&#13;
     &#12371;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#38283;&#22987;&#12473;&#12486;&#12540;&#12488;&#12434;&#34920;&#12377;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">AnimateTransitionShader</td></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#bitmapTo" class="signatureLink">bitmapTo</a> : <a href="../../flash/display/BitmapData.html">BitmapData</a><div class="summaryTableDescription">&#13;
     &#12371;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#32066;&#20102;&#12473;&#12486;&#12540;&#12488;&#12434;&#34920;&#12377;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">AnimateTransitionShader</td></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#shaderByteCode" class="signatureLink">shaderByteCode</a> : <a href="../../Object.html">Object</a><div class="summaryTableDescription">&#13;
     2 &#12388;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#38291;&#12434;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#21270;&#12377;&#12427;&#12383;&#12417;&#12395;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#20351;&#29992;&#12377;&#12427;&#12289;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">AnimateTransitionShader</td></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#shaderProperties" class="signatureLink">shaderProperties</a> : <a href="../../Object.html">Object</a><div class="summaryTableDescription">&#13;
     &#20877;&#29983;&#12398;&#21069;&#12395;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#28193;&#12373;&#12428;&#12427;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#21517;&#21069;&#12392;&#20516;&#12398;&#12506;&#12450;&#12434;&#34920;&#12377;&#12510;&#12483;&#12503;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">AnimateTransitionShader</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="protectedPropertySummary" id="protectedPropertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12503;&#12525;&#12486;&#12463;&#12488;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProtectedProperty" id="summaryTableProtectedProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#AnimateTransitionShader()" class="signatureLink">AnimateTransitionShader</a>(target:<a href="../../Object.html">Object</a> = null)</div><div class="summaryTableDescription">&#13;
      &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">AnimateTransitionShader</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="protectedMethodSummary" id="protectedMethodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12503;&#12525;&#12486;&#12463;&#12488;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProtectedMethod" id="summaryTableProtectedMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedEvent" id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../mx/effects/Effect.html#event:effectEnd" class="signatureLink">effectEnd</a></div></td><td class="summaryTableDescription summaryTableCol">&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398; 1 &#12388;&#12364;&#20877;&#29983;&#12434;&#20572;&#27490;&#12375;&#12383;&#12392;&#12365;&#65288;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20877;&#29983;&#23436;&#20102;&#26178;&#12289;&#12414;&#12383;&#12399;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364; end() &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12426;&#20013;&#26029;&#12373;&#12428;&#12383;&#12392;&#12365;&#65289;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../mx/effects/Effect.html">Effect</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../spark/effects/Animate.html#event:effectRepeat" class="signatureLink">effectRepeat</a></div></td><td class="summaryTableDescription summaryTableCol">&#35079;&#25968;&#22238;&#32368;&#12426;&#36820;&#12373;&#12428;&#12427;&#20219;&#24847;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#12289;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#26032;&#12375;&#12356;&#32368;&#12426;&#36820;&#12375;&#20966;&#29702;&#12434;&#38283;&#22987;&#12377;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../spark/effects/Animate.html">Animate</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../mx/effects/Effect.html#event:effectStart" class="signatureLink">effectStart</a></div></td><td class="summaryTableDescription summaryTableCol">&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#20877;&#29983;&#38283;&#22987;&#26178;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../mx/effects/Effect.html">Effect</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../mx/effects/Effect.html#event:effectStop" class="signatureLink">effectStop</a></div></td><td class="summaryTableDescription summaryTableCol">&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#20572;&#27490;&#12373;&#12428;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12364;&#30330;&#29983;&#12377;&#12427;&#12398;&#12399;&#12289;stop() &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12387;&#12390;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#20013;&#26029;&#12373;&#12428;&#12383;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../mx/effects/Effect.html">Effect</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../spark/effects/Animate.html#event:effectUpdate" class="signatureLink">effectUpdate</a></div></td><td class="summaryTableDescription summaryTableCol">&#12456;&#12501;&#12455;&#12463;&#12488;&#12391;&#12479;&#12540;&#12466;&#12483;&#12488;&#12364;&#26356;&#26032;&#12373;&#12428;&#12427;&#12383;&#12403;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../spark/effects/Animate.html">Animate</a></td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/bitmapFrom" class="dashAnchor" id="//apple_ref/cpp/Property/bitmapFrom"></a><a name="bitmapFrom" id="bitmapFrom"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>bitmapFrom</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>public var bitmapFrom:<a href="../../flash/display/BitmapData.html">BitmapData</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p></p><p>&#13;
     &#12371;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#38283;&#22987;&#12473;&#12486;&#12540;&#12488;&#12434;&#34920;&#12377;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#20877;&#29983;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12414;&#12383;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12488;&#12521;&#12531;&#12472;&#12471;&#12519;&#12531;&#12398;&#38283;&#22987;&#12499;&#12517;&#12540;&#12473;&#12486;&#12540;&#12488;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#36879;&#26126;&#12394;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#33258;&#21205;&#30340;&#12395;&#35336;&#31639;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
      &#13;
      </p></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/bitmapTo" class="dashAnchor" id="//apple_ref/cpp/Property/bitmapTo"></a><a name="bitmapTo" id="bitmapTo"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>bitmapTo</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>public var bitmapTo:<a href="../../flash/display/BitmapData.html">BitmapData</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p></p><p>&#13;
     &#12371;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#32066;&#20102;&#12473;&#12486;&#12540;&#12488;&#12434;&#34920;&#12377;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#20877;&#29983;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12414;&#12383;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12488;&#12521;&#12531;&#12472;&#12471;&#12519;&#12531;&#12398;&#32066;&#20102;&#12499;&#12517;&#12540;&#12473;&#12486;&#12540;&#12488;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#36879;&#26126;&#12394;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#33258;&#21205;&#30340;&#12395;&#35336;&#31639;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
      &#13;
      </p></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/shaderByteCode" class="dashAnchor" id="//apple_ref/cpp/Property/shaderByteCode"></a><a name="shaderByteCode" id="shaderByteCode"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>shaderByteCode</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>public var shaderByteCode:<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p></p><p>&#13;
     2 &#12388;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#38291;&#12434;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#21270;&#12377;&#12427;&#12383;&#12417;&#12395;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#20351;&#29992;&#12377;&#12427;&#12289;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12391;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;ByteArray&#12289;&#12414;&#12383;&#12399; ByteArray &#12434;&#34920;&#12377; Class&#65288;&#12522;&#12477;&#12540;&#12473;&#12434;&#22475;&#12417;&#36796;&#12435;&#12384;&#12392;&#12365;&#12398;&#32080;&#26524;&#12395;&#30456;&#24403;&#65289;&#12392;&#12375;&#12390;&#34920;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#12399;&#20219;&#24847;&#12398;&#27231;&#33021;&#12392;&#20837;&#21147;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418; 3 &#12388;&#12398; <code>image4</code> &#12398;&#20837;&#21147;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#26368;&#21021;&#12398;&#20837;&#21147;&#12399;&#12289;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12467;&#12540;&#12489;&#12391;&#12399;&#20351;&#29992;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12501;&#12451;&#12523;&#12479;&#12540;&#20966;&#29702;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#26368;&#21021;&#12398;&#20837;&#21147;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12392;&#12356;&#12358;&#12289;Flash &#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12377;&#12383;&#12417;&#12395;&#12398;&#12415;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20837;&#21147;&#12395;&#12399;&#12289;&#20219;&#24847;&#12398;&#21517;&#21069;&#12434;&#20184;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#19968;&#20999;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#20837;&#21147;&#12399;&#26368;&#36969;&#21270;&#12373;&#12428;&#12390;&#38500;&#22806;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#20316;&#25104;&#12377;&#12427;&#12467;&#12540;&#12489;&#12391;&#23569;&#12394;&#12367;&#12392;&#12418;&#19968;&#24230;&#12371;&#12398;&#20837;&#21147;&#12434;&#21442;&#29031;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12411;&#12363;&#12289;&#21069;&#12392;&#24460;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12452;&#12513;&#12540;&#12472;&#12434;&#34920;&#12377; <code>from</code> &#12392; <code>to</code> &#12392;&#12356;&#12358;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418; 2 &#12388;&#12398;&#20837;&#21147;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#26368;&#24460;&#12395;&#12289;&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#32076;&#36942;&#21106;&#21512;&#12434;&#21547;&#12416;&#12289;<code>progress</code> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398; <code>float</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434; 1 &#12388;&#23450;&#32681;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12458;&#12503;&#12471;&#12519;&#12531;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390;&#12289;<code>width</code> &#12392; <code>height</code> &#12398; 2 &#12388;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;&#12456;&#12501;&#12455;&#12463;&#12488;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#24133;&#12392;&#39640;&#12373;&#12364;&#33258;&#21205;&#30340;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>Flash &#29992;&#12398;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#35352;&#36848;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Pixel Bender Toolkit &#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12414;&#12383;&#12289;Flex &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398; frameworks&#165;projects&#165;flex4&#165;src&#165;spark&#165;effects &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12289;CrossFade.pbk &#12501;&#12449;&#12452;&#12523;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      </div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/shaderProperties" class="dashAnchor" id="//apple_ref/cpp/Property/shaderProperties"></a><a name="shaderProperties" id="shaderProperties"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>shaderProperties</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>public var shaderProperties:<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p></p><p>&#13;
     &#20877;&#29983;&#12398;&#21069;&#12395;&#12500;&#12463;&#12475;&#12523;&#12471;&#12455;&#12540;&#12480;&#12540;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#28193;&#12373;&#12428;&#12427;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#21517;&#21069;&#12392;&#20516;&#12398;&#12506;&#12450;&#12434;&#34920;&#12377;&#12510;&#12483;&#12503;&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;Wipe.pbj &#12395;&#12362;&#12356;&#12390;&#12471;&#12455;&#12540;&#12480;&#12540;&#12398; <code>direction</code> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434; Pixel Bender &#12398; pbj &#12501;&#12449;&#12452;&#12523;&#12391;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#21628;&#12403;&#20986;&#12375;&#20803;&#12467;&#12540;&#12489;&#12391;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><pre>&#13;
       [Embed(source="Wipe.pbj", mimeType="application/octet-stream")]&#13;
       private var WipeCodeClass:Class;&#13;
       var shaderEffect = new AnimateTransitionShader();&#13;
       shaderEffect.shaderByteCode = WipeCodeClass;&#13;
       shaderEffect.shaderProperties = {direction : 1};&#13;
     </pre>&#13;
      &#13;
      </div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><a name="//apple_ref/cpp/Constructor/AnimateTransitionShader()" class="dashAnchor" id="//apple_ref/cpp/Constructor/AnimateTransitionShader()"></a><a name="AnimateTransitionShader()" id="AnimateTransitionShader()"></a><a name="AnimateTransitionShader(Object)" id="AnimateTransitionShader(Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>AnimateTransitionShader</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function AnimateTransitionShader(target:<a href="../../Object.html">Object</a> = null)</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p>&#13;
      &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290; &#13;
     &#13;
      </p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">target</span>:<a href="../../Object.html">Object</a></code> (default = <code>null</code>)<code></code> &#8212; &#12371;&#12398;&#12456;&#12501;&#12455;&#12463;&#12488;&#12391;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#21270;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;  &#13;
      &#13;
      </td></tr></table></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">AnimateTransitionShaderExample.mxml</div><div class="detailBody"><div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&lt;?xml version="1.0" encoding="utf-8"?&gt;&#13;
&lt;s:Application&#13;
    xmlns:fx="http://ns.adobe.com/mxml/2009"&#13;
    xmlns:mx="library://ns.adobe.com/flex/mx"&#13;
    xmlns:s="library://ns.adobe.com/flex/spark"&gt;&#13;
&#13;
    &lt;s:states&gt;&#13;
        &lt;s:State name="default"/&gt;&#13;
        &lt;s:State name="flipped"/&gt;&#13;
    &lt;/s:states&gt;&#13;
&#13;
    &lt;s:transitions&gt;&#13;
        &lt;s:Transition id="t1"&gt;&#13;
            &lt;s:AnimateTransitionShader&#13;
                target="{holder}"&#13;
                duration="1000"&#13;
                shaderByteCode="@Embed(source='assets/twist.pbj', mimeType='application/octet-stream')"/&gt;&#13;
        &lt;/s:Transition&gt;&#13;
    &lt;/s:transitions&gt;&#13;
&#13;
    &lt;s:Panel title="AnimateTransitionShader Example"&#13;
        width="75%" height="75%" horizontalCenter="0" verticalCenter="0"&gt;&#13;
&#13;
        &lt;s:HGroup width="100%" height="100%" top="5" left="5" right="5"&gt;&#13;
            &lt;s:Group id="holder"&gt;&#13;
                &lt;s:BitmapImage&#13;
                    source="@Embed('assets/back2.png')"&#13;
                    visible="true" visible.flipped="false"/&gt;&#13;
                &lt;s:BitmapImage&#13;
                    source="@Embed('assets/c2.png')"&#13;
                    visible="false" visible.flipped="true"/&gt;&#13;
            &lt;/s:Group&gt;&#13;
&#13;
            &lt;!-- Directions --&gt;&#13;
            &lt;s:VGroup id="detailsBox"&#13;
                width="50%"&#13;
                left="0"&gt;&#13;
                &lt;s:Label&#13;
                    width="99%"&#13;
                    color="blue"&#13;
                    text="AnimateShaderTransition animates a shader between two images. Click the 'Animate Shader' button to see the effect."/&gt;&#13;
            &lt;/s:VGroup&gt;&#13;
        &lt;/s:HGroup&gt;&#13;
&#13;
        &lt;s:Rect left="0" right="0" bottom="0" height="30"&gt;&#13;
            &lt;s:fill&gt;&#13;
                &lt;s:LinearGradient rotation="90"&gt;&#13;
                    &lt;s:GradientEntry color="0xE2E2E2" /&gt;&#13;
                    &lt;s:GradientEntry color="0xD9D9D9" /&gt;&#13;
                &lt;/s:LinearGradient&gt;&#13;
            &lt;/s:fill&gt;&#13;
        &lt;/s:Rect&gt;&#13;
        &lt;s:Button id="playButton"&#13;
            left="5" bottom="5"&#13;
            label="Animate Shader"&#13;
            click="currentState = (currentState == 'flipped') ? 'default' : 'flipped';"/&gt;&#13;
    &lt;/s:Panel&gt;&#13;
&#13;
&lt;/s:Application&gt;&#13;
</pre></div><div class="swfHolderDiv"></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>