<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:1.1" /><meta name="product" content="air" /><meta name="productver" content="air:1.1" /><meta name="product" content="flex" /><meta name="prodver" content="flex:3" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="FlexNativeMenu,mx.controls.FlexNativeMenu,automationDelegate,automationEnabled,automationName,automationOwner,automationParent,automationTabularData,automationValue,automationVisible,dataDescriptor,dataProvider,hasRoot,initialized,keyEquivalentField,keyEquivalentFunction,keyEquivalentModifiersFunction,labelField,labelFunction,mnemonicIndexField,mnemonicIndexFunction,nativeMenu,nestLevel,numAutomationChildren,processedDescriptors,showInAutomationHierarchy,showRoot,updateCompletePendingFlag,commitProperties,createAutomationIDPart,createAutomationIDPartWithRequiredProperties,display,getAutomationChildAt,getAutomationChildren,invalidateProperties,itemToKeyEquivalent,itemToKeyEquivalentModifiers,itemToLabel,itemToMnemonicIndex,parseLabelToMnemonicIndex,parseLabelToString,replayAutomatableEvent,resolveAutomationIDPart,setContextMenu,unsetContextMenu,validateDisplayList,validateNow,validateProperties,validateSize" /><title>FlexNativeMenu - Adobe ActionScript&#174; 3&#65288;AS3  Flex&#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">mx.controls</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  FlexNativeMenu</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">FlexNativeMenu  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr><tr><td class="classHeaderTableLabel">&#23455;&#35013;</td><td> <a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>,  <a href="../../mx/controls/IFlexContextMenu.html">IFlexContextMenu</a>,  <a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
  FlexNativeMenu &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12391;&#12399;&#12289;AIR &#12398; NativeMenu &#12463;&#12521;&#12473;&#12398;&#12521;&#12483;&#12497;&#12540;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290; FlexNativeMenu &#12399;&#12289;MXML &#12392;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12434;&#20351;&#29992;&#12375;&#12390;&#12513;&#12491;&#12517;&#12540;&#27083;&#36896;&#12434;&#25351;&#23450;&#12377;&#12427;&#12394;&#12393;&#12289;Flex &#38283;&#30330;&#32773;&#12364;&#20351;&#12356;&#24931;&#12428;&#12390;&#12362;&#12426;&#12289;&#12381;&#12398;&#20182;&#12398; Flex &#12513;&#12491;&#12517;&#12540;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#19968;&#36011;&#12375;&#12390;&#12356;&#12427;&#25163;&#27861;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12493;&#12452;&#12486;&#12451;&#12502;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12513;&#12491;&#12517;&#12540;&#65288;&#12454;&#12451;&#12531;&#12489;&#12454;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12362;&#12424;&#12403;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12394;&#12393;&#65289;&#12434;&#23450;&#32681;&#12377;&#12427;&#26041;&#27861;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#12383;&#12384;&#12375;&#12289;Flex &#12513;&#12491;&#12517;&#12540;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12399;&#30064;&#12394;&#12426;&#12289;FlexNativeMenu &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#12424;&#12387;&#12390;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12491;&#12517;&#12540;&#12399;&#12289;Flex &#12395;&#12424;&#12427;&#12499;&#12472;&#12517;&#12450;&#12523;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12375;&#12390;&#20316;&#25104;&#12373;&#12428;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#12507;&#12473;&#12488;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
  <p>&#12381;&#12398;&#20182;&#12398; Flex &#12513;&#12491;&#12517;&#12540;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#21516;&#27096;&#12395;&#12289;FlexNativeMenu &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#12424;&#12387;&#12390;&#34920;&#12431;&#12373;&#12428;&#12427;&#12513;&#12491;&#12517;&#12540;&#12398;&#27083;&#36896;&#12434;&#23450;&#32681;&#12377;&#12427;&#12395;&#12399;&#12289;&#12513;&#12491;&#12517;&#12540;&#12434;&#23450;&#32681;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12375;&#12390;&#12356;&#12427; XML &#38542;&#23652;&#12420;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#37197;&#21015;&#12394;&#12393;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; &#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12521;&#12505;&#12523;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12487;&#12540;&#12479;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427; <code>labelField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12289;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#23550;&#12377;&#12427;&#12461;&#12540;&#12508;&#12540;&#12489;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#23450;&#32681;&#12377;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427; <code>keyEquivalentField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12362;&#12424;&#12403;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12521;&#12505;&#12523;&#12398;&#25991;&#23383;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12434;&#23450;&#32681;&#12377;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427; <code>mnemonicIndexField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12394;&#12393;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12487;&#12540;&#12479;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#35299;&#37320;&#12373;&#12428;&#12427;&#12363;&#12434;&#23450;&#32681;&#12377;&#12427;&#12383;&#12417;&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>FlexNativeMenu &#12450;&#12452;&#12486;&#12512;&#12395;&#20351;&#29992;&#12377;&#12427;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12395;&#12424;&#12387;&#12390;&#12289;&#27425;&#12398; XML &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#34920;&#31034;&#26041;&#27861;&#12392;&#21205;&#12365;&#26041;&#12434;&#27770;&#23450;&#12377;&#12427;&#23646;&#24615;&#12434;&#12356;&#12367;&#12388;&#12363;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
               <pre>&#13;
   &lt;mx:XML format="e4x" id="myMenuData"&gt;&#13;
     &lt;root&gt;&#13;
        &lt;menuitem label="MenuItem A"&gt;&#13;
            &lt;menuitem label="SubMenuItem A-1" enabled="False"/&gt;&#13;
            &lt;menuitem label="SubMenuItem A-2"/&gt;&#13;
        &lt;/menuitem&gt;&#13;
        &lt;menuitem label="MenuItem B" type="check" toggled="true"/&gt;&#13;
        &lt;menuitem label="MenuItem C" type="check" toggled="false"/&gt;&#13;
        &lt;menuitem type="separator"/&gt;&#13;
        &lt;menuitem label="MenuItem D"&gt;&#13;
            &lt;menuitem label="SubMenuItem D-1"/&gt;&#13;
            &lt;menuitem label="SubMenuItem D-2"/&gt;&#13;
            &lt;menuitem label="SubMenuItem D-3"/&gt;&#13;
        &lt;/menuitem&gt;&#13;
    &lt;/root&gt;&#13;
 &lt;/mx:XML&gt;</pre>&#13;
 &#13;
               <p>&#27425;&#12398;&#34920;&#12391;&#12399;&#12289;&#25351;&#23450;&#12391;&#12365;&#12427;&#23646;&#24615;&#12392;&#12381;&#12398;&#12487;&#12540;&#12479;&#22411;&#12289;&#12373;&#12425;&#12395;&#12381;&#12398;&#30446;&#30340;&#12392;&#12289;&#12513;&#12491;&#12517;&#12540;&#12391; DefaultDataDescriptor &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12434;&#35299;&#26512;&#12377;&#12427;&#22580;&#21512;&#12395;&#12289;&#12381;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364;&#23646;&#24615;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#34920;&#31034;&#12377;&#12427;&#12363;&#12434;&#19968;&#35239;&#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <table class="innertable"><tr><th>&#23646;&#24615;</th><th>&#22411;</th><th>&#35500;&#26126;</th></tr><tr><td>&#13;
                              <code>altKey</code>&#13;
                           </td><td>Boolean</td><td>Alt &#12461;&#12540;&#12364;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#24517;&#35201;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>cmdKey</code>&#13;
                           </td><td>Boolean</td><td>&#13;
                              <b>&#12513;&#12514;&#65306;</b>&#12371;&#12398;&#23646;&#24615;&#12399; Flex 3.2 &#12391;&#12399;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#20195;&#12431;&#12426;&#12395;&#12289;<code>commandKey</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;Command &#12461;&#12540;&#12364;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#24517;&#35201;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>commandKey</code>&#13;
                           </td><td>Boolean</td><td>Command &#12461;&#12540;&#12364;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#24517;&#35201;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>controlKey</code>&#13;
                           </td><td>Boolean</td><td>Control &#12461;&#12540;&#12364;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#24517;&#35201;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>ctrlKey</code>&#13;
                           </td><td>Boolean</td><td>&#13;
                              <b>&#12513;&#12514;&#65306;</b>&#12371;&#12398;&#23646;&#24615;&#12399; Flex 3.2 &#12391;&#12399;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#20195;&#12431;&#12426;&#12395;&#12289;<code>controlKey</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;Control &#12461;&#12540;&#12364;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#24517;&#35201;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>enabled</code>&#13;
                           </td><td>Boolean</td><td>&#12518;&#12540;&#12470;&#12540;&#12364;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12434;&#36984;&#25246;&#12391;&#12365;&#12427;&#22580;&#21512;&#12399; <code>true</code>&#12289;&#36984;&#25246;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12399; <code>false</code> &#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#12392;&#12289;&#12450;&#12452;&#12486;&#12512;&#12399;&#12371;&#12398;&#20516;&#12364; <code>true</code> &#12398;&#22580;&#21512;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12487;&#12540;&#12479;&#35352;&#36848;&#23376;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12391;&#12399; <code>enabled</code> XML &#23646;&#24615;&#12414;&#12383;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12371;&#12398;&#29305;&#23450;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>keyEquivalent</code>&#13;
                           </td><td>&#25991;&#23383;&#21015;</td><td>&#25276;&#12373;&#12428;&#12427;&#12392;&#12289;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12364;&#36984;&#25246;&#12373;&#12428;&#12383;&#12424;&#12358;&#12395;&#12452;&#12505;&#12531;&#12488;&#12434;&#12488;&#12522;&#12460;&#12540;&#12377;&#12427;&#12461;&#12540;&#12508;&#12540;&#12489;&#25991;&#23383;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#25351;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#20869;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12420;&#12289;&#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#27770;&#23450;&#12377;&#12427;&#38306;&#25968;&#12399;&#12289;&#12513;&#12491;&#12517;&#12540;&#12398; <code>keyEquivalentField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12414;&#12383;&#12399; <code>keyEquivalentFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364; E4X XML &#24418;&#24335;&#12398;&#22580;&#21512;&#12289;&#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#12395;&#12399;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>label</code>&#13;
                           </td><td>&#25991;&#23383;&#21015;</td><td>&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12486;&#12461;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12450;&#12452;&#12486;&#12512;&#12399;&#12289;<code>separator</code> &#20197;&#22806;&#12398;&#12377;&#12409;&#12390;&#12398;&#12479;&#12452;&#12503;&#12398;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; &#12521;&#12505;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#20869;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12420;&#12289;&#12521;&#12505;&#12523;&#12434;&#27770;&#23450;&#12377;&#12427;&#38306;&#25968;&#12399;&#12289;&#12513;&#12491;&#12517;&#12540;&#12398; <code>labelField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12414;&#12383;&#12399; <code>labelFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364; E4X XML &#24418;&#24335;&#12398;&#22580;&#21512;&#12289;&#12521;&#12505;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#37197;&#21015;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#20516;&#12364;&#12521;&#12505;&#12523;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>mnemonicIndex</code>&#13;
                           </td><td>&#25972;&#25968;</td><td>&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12521;&#12505;&#12523;&#20869;&#12398;&#25991;&#23383;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#20869;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12420;&#12289;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#27770;&#23450;&#12377;&#12427;&#38306;&#25968;&#12399;&#12289;&#12513;&#12491;&#12517;&#12540;&#12398; <code>mnemonicIndexField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12414;&#12383;&#12399; <code>mnemonicIndexFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364; E4X XML &#24418;&#24335;&#12398;&#22580;&#21512;&#12289;&#12487;&#12540;&#12479;&#20869;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12414;&#12383;&#12289;&#12521;&#12505;&#12523;&#20869;&#12398;&#25991;&#23383;&#12398;&#24038;&#12395;&#38563;&#25509;&#12377;&#12427;&#24418;&#12391;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12381;&#12398;&#25991;&#23383;&#12364;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>shiftKey</code>&#13;
                           </td><td>Boolean</td><td>Shift &#12461;&#12540;&#12364;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#24517;&#35201;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>toggled</code>&#13;
                           </td><td>Boolean</td><td>check &#12450;&#12452;&#12486;&#12512;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36984;&#25246;&#12375;&#12394;&#12356;&#12392;&#12289;&#12450;&#12452;&#12486;&#12512;&#12399;&#12371;&#12398;&#20516;&#12364; <code>false</code> &#12398;&#22580;&#21512;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#25201;&#12431;&#12428;&#12289;&#12450;&#12452;&#12486;&#12512;&#12399;&#36984;&#25246;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12487;&#12540;&#12479;&#35352;&#36848;&#23376;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12391;&#12399; <code>toggled</code> XML &#23646;&#24615;&#12414;&#12383;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12371;&#12398;&#29305;&#24615;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</td></tr><tr><td>&#13;
                              <code>type</code>&#13;
                           </td><td>&#25991;&#23383;&#21015;</td><td>&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#26377;&#21177;&#12394;&#20516;&#12399;&#12289;<code>separator</code> &#12392; <code>check</code> &#12391;&#12377;&#12290; &#20182;&#12398;&#20516;&#12420;&#12289;&#12479;&#12452;&#12503;&#38917;&#30446;&#12398;&#12394;&#12356;&#12494;&#12540;&#12489;&#12399;&#12289;normal &#12398;&#12513;&#12491;&#12517;&#12540;&#38917;&#30446;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12487;&#12540;&#12479;&#35352;&#36848;&#23376;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12391;&#12399; <code>type</code> XML &#23646;&#24615;&#12414;&#12383;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12371;&#12398;&#29305;&#24615;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</td></tr></table><p>&#12454;&#12451;&#12531;&#12489;&#12454;&#12513;&#12491;&#12517;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12513;&#12491;&#12517;&#12540;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427; Window &#12414;&#12383;&#12399; WindowedApplication &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398; <code>menu</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#12375;&#12390; FlexNativeMenu &#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12513;&#12491;&#12517;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398; WindowedApplication &#12398; <code>menu</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#12375;&#12390; FlexNativeMenu &#12434;&#21106;&#12426;&#24403;&#12390;&#12414;&#12377;&#12290; &#12518;&#12540;&#12470;&#12540;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#19968;&#37096;&#12395;&#23550;&#12377;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12392;&#12375;&#12390; FlexNativeMenu &#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#12395;&#12399;&#12289;FlexNativeMenu &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398; <code>setContextMenu()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12289;UI &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#24341;&#25968;&#12392;&#12375;&#12390;&#28193;&#12375;&#12414;&#12377;&#12290; FlexNativeMenu &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398; <code>display()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#19978;&#12398;&#20219;&#24847;&#12398;&#22580;&#25152;&#12395;&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#12513;&#12491;&#12517;&#12540;&#12392;&#12375;&#12390;&#12513;&#12491;&#12517;&#12540;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12356;&#12388;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12467;&#12510;&#12531;&#12489;&#12364;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12427;&#12363;&#12434;&#26908;&#20986;&#12377;&#12427;&#12395;&#12399;&#12289;<code>itemClick</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#12522;&#12473;&#12490;&#12540;&#12434;&#30331;&#37682;&#12375;&#12414;&#12377;&#12290; &#12513;&#12491;&#12517;&#12540;&#12414;&#12383;&#12399;&#12469;&#12502;&#12513;&#12491;&#12517;&#12540;&#12364;&#38283;&#12363;&#12428;&#12427;&#12392;&#12365;&#12434;&#27770;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;<code>menuShow</code> &#12452;&#12505;&#12531;&#12488;&#12395;&#23550;&#12377;&#12427;&#12522;&#12473;&#12490;&#12540;&#12434;&#30331;&#37682;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
            <p></p><a name="mxmlSyntaxSummary" id="mxmlSyntaxSummary"></a><span class="classHeaderTableLabel">MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;</span><span id="showMxmlLink" style="display:none"><a href="#mxmlSyntaxSummary" onclick="toggleMXMLOnly();"><img src="../../images/collapsed.gif" title="collapsed" alt="collapsed" class="collapsedImage" />MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#34920;&#31034;</a><br /></span><span id="hideMxmlLink"><a href="#mxmlSyntaxSummary" onclick="toggleMXMLOnly();"><img src="../../images/expanded.gif" title="expanded" alt="expanded" class="expandedImage" />MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#38560;&#12377;</a></span><div id="mxmlSyntax" class="mxmlSyntax">&#13;
  <p>The <code>&lt;mx:FlexNativeMenu&amp;gt</code> tag supports the following tag attributes:</p>&#13;
 &#13;
  <pre>&#13;
  &lt;mx:FlexNativeMenu&#13;
    <b>Properties</b>&#13;
    dataDescriptor="<i>mx.controls.treeClasses.DefaultDataDescriptor</i>"&#13;
    dataProvider="<i>undefined</i>"&#13;
    keyEquivalentField="keyEquivalent"&#13;
    keyEquivalentFunction="<i>undefined</i>"&#13;
    keyEquivalentModifiersFunction="<i>undefined</i>"&#13;
    labelField="label"&#13;
    labelFunction="<i>undefined</i>"&#13;
    mnemonicIndexField="mnemonicIndex"&#13;
    mnemonicIndexFunction="<i>undefined</i>"&#13;
    showRoot="true"&#13;
 &#13;
    <b>Events</b>&#13;
    itemClick="<i>No default</i>"&#13;
    menuShow="<i>No default</i>"&#13;
  /&gt;&#13;
  </pre>&#13;
 &#13;
  </div><p id="moreExamples"><span class="classHeaderTableLabel">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WSacd9bdd0c5c09f4a-690d4877120e8b878b0-7fea.html" target="_blank">About the FlexNativeMenu control</a><br /><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WSacd9bdd0c5c09f4a-690d4877120e8b878b0-7fe5.html" target="_blank">Defining FlexNativeMenu menu structure&#13;
and data</a><br /><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WSacd9bdd0c5c09f4a-690d4877120e8b878b0-7fe0.html" target="_blank">Example: An Array FlexNativeMenu&#13;
data provider</a><br /><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WSacd9bdd0c5c09f4a-690d4877120e8b878b0-7fdf.html" target="_blank">Example: An XML FlexNativeMenu&#13;
data provider</a><br /><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WSacd9bdd0c5c09f4a-690d4877120e8b878b0-7fda.html" target="_blank">Specifying menu item mnemonics</a></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/display/NativeMenu.html" target="">flash.display.NativeMenu</a><br /><a href="../../mx/events/FlexNativeMenuEvent.html" target="">mx.events.FlexNativeMenuEvent</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#automationDelegate" class="signatureLink">automationDelegate</a> : <a href="../../Object.html">Object</a><div class="summaryTableDescription">&#13;
      &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#38306;&#36899;&#27231;&#33021;&#12434;&#20966;&#29702;&#12377;&#12427;&#22996;&#35698;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#automationEnabled" class="signatureLink">automationEnabled</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
      &#13;
      &#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#29992;&#12395;&#26377;&#21177;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399; true&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399; false &#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#automationName" class="signatureLink">automationName</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">&#13;
      &#13;
      &#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12427;&#21517;&#21069;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#automationOwner" class="signatureLink">automationOwner</a> : <a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a><div class="summaryTableDescription">&#13;
      &#13;
      &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#30446;&#30340;&#12391;&#20351;&#29992;&#12377;&#12427;&#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12458;&#12540;&#12490;&#12540;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#automationParent" class="signatureLink">automationParent</a> : <a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a><div class="summaryTableDescription">&#13;
      &#13;
      &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#30446;&#30340;&#12391;&#20351;&#29992;&#12377;&#12427;&#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35242;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#automationTabularData" class="signatureLink">automationTabularData</a> : <a href="../../Object.html">Object</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
      &#13;
     &#12487;&#12540;&#12479;&#26908;&#32034;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427; IAutomationTabularData &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#23455;&#35013;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#automationValue" class="signatureLink">automationValue</a> : <a href="../../Array.html">Array</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
      &#12371;&#12398;&#20516;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#34920;&#31034;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12398;&#35222;&#35226;&#34920;&#31034;&#12392;&#21516;&#12376;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#35672;&#21029;&#23376;&#12392;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38306;&#36899;&#20184;&#12369;&#12427;&#12398;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#automationVisible" class="signatureLink">automationVisible</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
      &#13;
      &#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#29992;&#12395;&#21487;&#35222;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399; true&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399; false &#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#dataDescriptor" class="signatureLink">dataDescriptor</a> : <a href="../../mx/controls/menuClasses/IMenuDataDescriptor.html">IMenuDataDescriptor</a><div class="summaryTableDescription">&#13;
      &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#20869;&#12398;&#12487;&#12540;&#12479;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#25805;&#20316;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#dataProvider" class="signatureLink">dataProvider</a> : <a href="../../Object.html">Object</a><div class="summaryTableDescription">&#13;
      NativeMenu &#12398;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#27083;&#36896;&#12434;&#23450;&#32681;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#38542;&#23652;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#hasRoot" class="signatureLink">hasRoot</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
      &#29694;&#22312;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12395;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#65288;&#20363;&#12360;&#12400;&#12289;&#38542;&#23652;&#27083;&#36896;&#20869;&#12398;&#21336;&#19968;&#12398;&#26368;&#19978;&#20301;&#12494;&#12540;&#12489;&#12394;&#12393;&#65289;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#initialized" class="signatureLink">initialized</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
      &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12524;&#12452;&#12450;&#12454;&#12488;&#12398; 3 &#12388;&#12398;&#27573;&#38542;&#65288;&#20966;&#29702;&#12289;&#28204;&#23450;&#12289;&#12524;&#12452;&#12450;&#12454;&#12488;&#65289;&#12377;&#12409;&#12390;&#12434;&#23436;&#20102;&#12375;&#12383;&#12418;&#12398;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#65288;&#12356;&#12378;&#12428;&#12363;&#12364;&#24517;&#38920;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#65289;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#keyEquivalentField" class="signatureLink">keyEquivalentField</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#27770;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#keyEquivalentFunction" class="signatureLink">keyEquivalentFunction</a> : <a href="../../Function.html">Function</a><div class="summaryTableDescription">&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#21028;&#23450;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#keyEquivalentModifiersFunction" class="signatureLink">keyEquivalentModifiersFunction</a> : <a href="../../Function.html">Function</a><div class="summaryTableDescription">&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#12434;&#21028;&#23450;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#labelField" class="signatureLink">labelField</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12486;&#12461;&#12473;&#12488;&#12434;&#27770;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#labelFunction" class="signatureLink">labelFunction</a> : <a href="../../Function.html">Function</a><div class="summaryTableDescription">&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#34920;&#31034;&#12377;&#12427;&#12486;&#12461;&#12473;&#12488;&#12434;&#21028;&#23450;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#mnemonicIndexField" class="signatureLink">mnemonicIndexField</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#27770;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#mnemonicIndexFunction" class="signatureLink">mnemonicIndexFunction</a> : <a href="../../Function.html">Function</a><div class="summaryTableDescription">&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#21028;&#23450;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#nativeMenu" class="signatureLink">nativeMenu</a> : <a href="../../flash/display/NativeMenu.html">NativeMenu</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
       &#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#31649;&#29702;&#12373;&#12428;&#12427; flash.display.NativeMenu &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399; null &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#nestLevel" class="signatureLink">nestLevel</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">&#13;
      &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#38542;&#23652;&#12395;&#12362;&#12369;&#12427;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#28145;&#24230;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#numAutomationChildren" class="signatureLink">numAutomationChildren</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
      &#13;
      &#12371;&#12398;&#12467;&#12531;&#12486;&#12490;&#12395;&#21547;&#12414;&#12428;&#12427;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#12398;&#23376;&#12398;&#25968;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#processedDescriptors" class="signatureLink">processedDescriptors</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
      &#23376;&#12434;&#12377;&#12368;&#12395;&#29983;&#25104;&#12377;&#12427;&#12363;&#12289;&#36933;&#24310;&#29983;&#25104;&#12375;&#12383;&#24460;&#12289;&#12371;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#30330;&#29983;&#12395;&#24540;&#12376;&#12390;&#12289;true &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#showInAutomationHierarchy" class="signatureLink">showInAutomationHierarchy</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
       &#13;
      &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#38542;&#23652;&#12395;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#showRoot" class="signatureLink">showRoot</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
      &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#12434;&#34920;&#31034;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12377;&#12427;&#12502;&#12540;&#12523;&#20516;&#12398;&#12501;&#12521;&#12464;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#updateCompletePendingFlag" class="signatureLink">updateCompletePendingFlag</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
      &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; 3 &#27573;&#38542;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#26908;&#35388;&#12434;&#23436;&#20102;&#12375;&#12383;&#12418;&#12398;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#65288;&#12356;&#12378;&#12428;&#12363;&#12398;&#26908;&#35388;&#12364;&#24517;&#38920;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#65289;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#FlexNativeMenu()" class="signatureLink">FlexNativeMenu</a>()</div><div class="summaryTableDescription">&#13;
      &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#createAutomationIDPart()" class="signatureLink">createAutomationIDPart</a>(child:<a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a>):<a href="../../Object.html">Object</a></div><div class="summaryTableDescription">&#13;
      &#13;
      &#12371;&#12398;&#12467;&#12531;&#12486;&#12490;&#12398;&#23376;&#12434;&#35672;&#21029;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12475;&#12483;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#createAutomationIDPartWithRequiredProperties()" class="signatureLink">createAutomationIDPartWithRequiredProperties</a>(child:<a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a>, properties:<a href="../../Array.html">Array</a>):<a href="../../Object.html">Object</a></div><div class="summaryTableDescription">&#13;
      &#13;
	  &#12371;&#12398;&#12467;&#12531;&#12486;&#12490;&#12398;&#23376;&#12434;&#35672;&#21029;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12475;&#12483;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#display()" class="signatureLink">display</a>(stage:<a href="../../flash/display/Stage.html">Stage</a>, x:<a href="../../int.html">int</a>, y:<a href="../../int.html">int</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      &#12371;&#12398;&#12513;&#12491;&#12517;&#12540;&#12434;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#20301;&#32622;&#12395;&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#getAutomationChildAt()" class="signatureLink">getAutomationChildAt</a>(index:<a href="../../int.html">int</a>):<a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a></div><div class="summaryTableDescription">&#13;
       &#13;
      &#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12391;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#getAutomationChildren()" class="signatureLink">getAutomationChildren</a>():<a href="../../Array.html">Array</a></div><div class="summaryTableDescription">&#13;
       &#13;
	  &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12522;&#12473;&#12488;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#invalidateProperties()" class="signatureLink">invalidateProperties</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      &#24460;&#12391;&#30011;&#38754;&#26356;&#26032;&#26178;&#12395; commitProperties() &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12510;&#12540;&#12463;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#replayAutomatableEvent()" class="signatureLink">replayAutomatableEvent</a>(event:<a href="../../flash/events/Event.html">Event</a>):<a href="../../Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
      &#13;
      &#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12505;&#12531;&#12488;&#12434;&#20877;&#29983;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#resolveAutomationIDPart()" class="signatureLink">resolveAutomationIDPart</a>(criteria:<a href="../../Object.html">Object</a>):<a href="../../Array.html">Array</a></div><div class="summaryTableDescription">&#13;
      &#13;
      &#25552;&#20379;&#12373;&#12428;&#12383; ID &#12434;&#20351;&#29992;&#12375;&#12390;&#23376;&#12434;&#35299;&#27770;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#setContextMenu()" class="signatureLink">setContextMenu</a>(component:<a href="../../flash/display/InteractiveObject.html">InteractiveObject</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      InteractiveObject &#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12434;&#22522;&#12395;&#12394;&#12427;&#12493;&#12452;&#12486;&#12451;&#12502;&#12513;&#12491;&#12517;&#12540;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#unsetContextMenu()" class="signatureLink">unsetContextMenu</a>(component:<a href="../../flash/display/InteractiveObject.html">InteractiveObject</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      &#22522;&#12395;&#12394;&#12427;&#12493;&#12452;&#12486;&#12451;&#12502;&#12513;&#12491;&#12517;&#12540;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12383; InteractiveObject &#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12398;&#35373;&#23450;&#12434;&#35299;&#38500;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#validateDisplayList()" class="signatureLink">validateDisplayList</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      &#13;
      &#23376;&#12398;&#20301;&#32622;&#12392;&#12469;&#12452;&#12474;&#12434;&#26908;&#35388;&#12375;&#12289;&#12381;&#12398;&#20182;&#12398;&#12499;&#12472;&#12517;&#12450;&#12523;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25551;&#30011;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#validateNow()" class="signatureLink">validateNow</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      &#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12289;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#12524;&#12452;&#12450;&#12454;&#12488;&#12434;&#26908;&#35388;&#12362;&#12424;&#12403;&#26356;&#26032;&#12375;&#12289;&#12381;&#12428;&#12434;&#20877;&#25551;&#30011;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#validateProperties()" class="signatureLink">validateProperties</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      &#13;
      &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#26908;&#35388;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#validateSize()" class="signatureLink">validateSize</a>(recursive:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      &#13;
      &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#28204;&#23450;&#12469;&#12452;&#12474;&#12434;&#26908;&#35388;&#12375;&#12414;&#12377;&#12290;LayoutManager.invalidateSize() &#12513;&#12477;&#12483;&#12489;&#12364;&#12371;&#12398; ILayoutManagerClient &#12434;&#25351;&#23450;&#12375;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#28204;&#23450;&#12398;&#23455;&#34892;&#26178;&#12395; validateSize() &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="protectedMethodSummary" id="protectedMethodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12503;&#12525;&#12486;&#12463;&#12488;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProtectedMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#commitProperties()" class="signatureLink">commitProperties</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
      &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#itemToKeyEquivalent()" class="signatureLink">itemToKeyEquivalent</a>(data:<a href="../../Object.html">Object</a>):<a href="../../String.html">String</a></div><div class="summaryTableDescription">&#13;
      keyEquivalentField &#12503;&#12525;&#12497;&#12486;&#12451;&#12392; keyEquivalentFunction &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#itemToKeyEquivalentModifiers()" class="signatureLink">itemToKeyEquivalentModifiers</a>(data:<a href="../../Object.html">Object</a>):<a href="../../Array.html">Array</a></div><div class="summaryTableDescription">&#13;
      keyEquivalentModifiersFunction &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#itemToLabel()" class="signatureLink">itemToLabel</a>(data:<a href="../../Object.html">Object</a>):<a href="../../String.html">String</a></div><div class="summaryTableDescription">&#13;
      labelField &#12503;&#12525;&#12497;&#12486;&#12451;&#12392; labelFunction &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12521;&#12505;&#12523;&#12392;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#itemToMnemonicIndex()" class="signatureLink">itemToMnemonicIndex</a>(data:<a href="../../Object.html">Object</a>):<a href="../../int.html">int</a></div><div class="summaryTableDescription">&#13;
      mnemonicIndexField &#12503;&#12525;&#12497;&#12486;&#12451;&#12392; mnemonicIndexFunction &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#parseLabelToMnemonicIndex()" class="signatureLink">parseLabelToMnemonicIndex</a>(data:<a href="../../String.html">String</a>):<a href="../../int.html">int</a></div><div class="summaryTableDescription">&#13;
      &#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#25991;&#23383;&#12364;&#23384;&#22312;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#22522;&#12389;&#12356;&#12390;&#12521;&#12505;&#12523;&#12363;&#12425;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#25277;&#20986;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#parseLabelToString()" class="signatureLink">parseLabelToString</a>(data:<a href="../../String.html">String</a>):<a href="../../String.html">String</a></div><div class="summaryTableDescription">&#13;
      &#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#25991;&#23383;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#21066;&#38500;&#12375;&#12289;&#12456;&#12473;&#12465;&#12540;&#12503;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#25991;&#23383;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#22793;&#25563;&#12375;&#12390;&#12289;NativeMenuItem &#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#23455;&#38555;&#12398;&#12521;&#12505;&#12523;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#event:itemClick" class="signatureLink">itemClick</a></div></td><td class="summaryTableDescription summaryTableCol">&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12364;&#36984;&#25246;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr><tr class="" runtime="AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#event:menuShow" class="signatureLink">menuShow</a></div></td><td class="summaryTableDescription summaryTableCol">&#12513;&#12491;&#12517;&#12540;&#12414;&#12383;&#12399;&#12469;&#12502;&#12513;&#12491;&#12517;&#12540;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">FlexNativeMenu</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/automationDelegate" class="dashAnchor" id="//apple_ref/cpp/Property/automationDelegate"></a><a name="automationDelegate" id="automationDelegate"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>automationDelegate</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>automationDelegate:<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#38306;&#36899;&#27231;&#33021;&#12434;&#20966;&#29702;&#12377;&#12427;&#22996;&#35698;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290;&#13;
      &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get automationDelegate():<a href="../../Object.html">Object</a></code><br /><code>&#160;&#160;&#160;&#160;public function set automationDelegate(value:<a href="../../Object.html">Object</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/automationEnabled" class="dashAnchor" id="//apple_ref/cpp/Property/automationEnabled"></a><a name="automationEnabled" id="automationEnabled"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>automationEnabled</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>automationEnabled:<a href="../../Boolean.html">Boolean</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#29992;&#12395;&#26377;&#21177;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399; true&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399; false &#12391;&#12377;&#12290;&#13;
     &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get automationEnabled():<a href="../../Boolean.html">Boolean</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/automationName" class="dashAnchor" id="//apple_ref/cpp/Property/automationName"></a><a name="automationName" id="automationName"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>automationName</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>automationName:<a href="../../String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12427;&#21517;&#21069;&#12391;&#12377;&#12290;&#13;
      &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get automationName():<a href="../../String.html">String</a></code><br /><code>&#160;&#160;&#160;&#160;public function set automationName(value:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/automationOwner" class="dashAnchor" id="//apple_ref/cpp/Property/automationOwner"></a><a name="automationOwner" id="automationOwner"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>automationOwner</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>automationOwner:<a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#30446;&#30340;&#12391;&#20351;&#29992;&#12377;&#12427;&#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12458;&#12540;&#12490;&#12540;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get automationOwner():<a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a></code><br /><code>&#160;&#160;&#160;&#160;public function set automationOwner(value:<a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/automationParent" class="dashAnchor" id="//apple_ref/cpp/Property/automationParent"></a><a name="automationParent" id="automationParent"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>automationParent</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>automationParent:<a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#30446;&#30340;&#12391;&#20351;&#29992;&#12377;&#12427;&#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35242;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get automationParent():<a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a></code><br /><code>&#160;&#160;&#160;&#160;public function set automationParent(value:<a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/automationTabularData" class="dashAnchor" id="//apple_ref/cpp/Property/automationTabularData"></a><a name="automationTabularData" id="automationTabularData"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>automationTabularData</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>automationTabularData:<a href="../../Object.html">Object</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
     &#12487;&#12540;&#12479;&#26908;&#32034;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427; <code>IAutomationTabularData</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#23455;&#35013;&#12391;&#12377;&#12290;&#13;
     &#13;
     </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get automationTabularData():<a href="../../Object.html">Object</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/automationValue" class="dashAnchor" id="//apple_ref/cpp/Property/automationValue"></a><a name="automationValue" id="automationValue"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>automationValue</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>automationValue:<a href="../../Array.html">Array</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12371;&#12398;&#20516;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#34920;&#31034;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12398;&#35222;&#35226;&#34920;&#31034;&#12392;&#21516;&#12376;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#35672;&#21029;&#23376;&#12392;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38306;&#36899;&#20184;&#12369;&#12427;&#12398;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
      &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get automationValue():<a href="../../Array.html">Array</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/automationVisible" class="dashAnchor" id="//apple_ref/cpp/Property/automationVisible"></a><a name="automationVisible" id="automationVisible"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>automationVisible</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>automationVisible:<a href="../../Boolean.html">Boolean</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#29992;&#12395;&#21487;&#35222;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399; true&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399; false &#12391;&#12377;&#12290;&#13;
     &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get automationVisible():<a href="../../Boolean.html">Boolean</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/dataDescriptor" class="dashAnchor" id="//apple_ref/cpp/Property/dataDescriptor"></a><a name="dataDescriptor" id="dataDescriptor"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>dataDescriptor</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>dataDescriptor:<a href="../../mx/controls/menuClasses/IMenuDataDescriptor.html">IMenuDataDescriptor</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#20869;&#12398;&#12487;&#12540;&#12479;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#25805;&#20316;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; FlexNativeMenu &#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12399;&#12289;&#12487;&#12540;&#12479;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12395;&#12388;&#12356;&#12390;&#12289;&#12487;&#12540;&#12479;&#35352;&#36848;&#23376;&#12395;&#22996;&#20219;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12371;&#12398;&#12487;&#12540;&#12479;&#12399;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12395;&#38306;&#12377;&#12427;&#35299;&#26512;&#12392;&#31227;&#21205;&#12398;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;FlexNativeMenu &#12395;&#23550;&#12375;&#12390;&#23450;&#32681;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#35352;&#36848;&#23376;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12513;&#12491;&#12517;&#12540;&#12362;&#12424;&#12403;&#12469;&#12502;&#12513;&#12491;&#12517;&#12540;&#12391;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; MXML &#12398;&#23646;&#24615;&#12392;&#12375;&#12390;&#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12289;&#35352;&#36848;&#23376;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#21517;&#12391;&#12399;&#12394;&#12367;&#12289;&#12487;&#12540;&#12479;&#35352;&#36848;&#23376;&#12408;&#12398;&#21442;&#29031;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;&#27425;&#12398;&#24418;&#24335;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <pre>&lt;mx:FlexNativeMenu id="flexNativeMenu" dataDescriptor="{new MyCustomDataDescriptor()}"/&gt;</pre>&#13;
     &#13;
      <p>&#12414;&#12383;&#12289;&#27425;&#12398;&#20363;&#12395;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289;&#12493;&#12473;&#12488;&#12375;&#12383;&#12469;&#12502;&#12479;&#12464;&#12392;&#12375;&#12390; MXML &#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <pre>&lt;mx:FlexNativeMenu&gt;&#13;
      &lt;mx:dataDescriptor&gt;&#13;
         &lt;myCustomDataDescriptor&gt;&#13;
      &lt;/mx:dataDescriptor&gt;&#13;
      ...</pre>&#13;
     &#13;
      <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;DefaultDataDescriptor &#12463;&#12521;&#12473;&#12398;&#20869;&#37096;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12377;&#12290;</p>&#13;
      &#13;
      <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get dataDescriptor():<a href="../../mx/controls/menuClasses/IMenuDataDescriptor.html">IMenuDataDescriptor</a></code><br /><code>&#160;&#160;&#160;&#160;public function set dataDescriptor(value:<a href="../../mx/controls/menuClasses/IMenuDataDescriptor.html">IMenuDataDescriptor</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/dataProvider" class="dashAnchor" id="//apple_ref/cpp/Property/dataProvider"></a><a name="dataProvider" id="dataProvider"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>dataProvider</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>dataProvider:<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      NativeMenu &#12398;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#27083;&#36896;&#12434;&#23450;&#32681;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#38542;&#23652;&#12391;&#12377;&#12290; &#20491;&#21029;&#12398;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12434;&#23450;&#32681;&#12375;&#12289;&#23376;&#12450;&#12452;&#12486;&#12512;&#12434;&#25345;&#12388;&#12450;&#12452;&#12486;&#12512;&#12399;&#12513;&#12491;&#12517;&#12540;&#12392;&#12469;&#12502;&#12513;&#12491;&#12517;&#12540;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p>FlexNativeMenu &#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12399;&#12289;&#12477;&#12540;&#12473;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27425;&#12398;&#12424;&#12358;&#12395;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <ul><li>&#26377;&#21177;&#12394; XML &#12486;&#12461;&#12473;&#12488;&#12434;&#21547;&#12416;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364; XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>XMLNode &#12399;&#12289;XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>&#12414;&#12383; XMLList &#12399;&#12289;XMLListCollection &#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>ICollectionView &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; ICollectionView &#12395;&#12461;&#12515;&#12473;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>Array &#12399; ArrayCollection &#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>&#20182;&#12398;&#12479;&#12452;&#12503;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;Array &#20869;&#12391;&#12381;&#12398;&#21336;&#19968;&#12456;&#12531;&#12488;&#12522;&#12392;&#12375;&#12390;&#12521;&#12483;&#12503;&#12373;&#12428;&#12414;&#12377;&#12290;</li></ul><p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>"undefined"&#12290;</code></p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>collectionChange</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get dataProvider():<a href="../../Object.html">Object</a></code><br /><code>&#160;&#160;&#160;&#160;public function set dataProvider(value:<a href="../../Object.html">Object</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/hasRoot" class="dashAnchor" id="//apple_ref/cpp/Property/hasRoot"></a><a name="hasRoot" id="hasRoot"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>hasRoot</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>hasRoot:<a href="../../Boolean.html">Boolean</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#29694;&#22312;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12395;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#65288;&#20363;&#12360;&#12400;&#12289;&#38542;&#23652;&#27083;&#36896;&#20869;&#12398;&#21336;&#19968;&#12398;&#26368;&#19978;&#20301;&#12494;&#12540;&#12489;&#12394;&#12393;&#65289;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#12290; XML &#12392; Object &#12399;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#12364;&#12354;&#12427;&#12479;&#12452;&#12503;&#12398;&#20363;&#12391;&#12354;&#12426;&#12289;&#12522;&#12473;&#12488;&#12392;&#37197;&#21015;&#12399;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#12364;&#12394;&#12356;&#12479;&#12452;&#12503;&#12398;&#20363;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get hasRoot():<a href="../../Boolean.html">Boolean</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/initialized" class="dashAnchor" id="//apple_ref/cpp/Property/initialized"></a><a name="initialized" id="initialized"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>initialized</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>initialized:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12524;&#12452;&#12450;&#12454;&#12488;&#12398; 3 &#12388;&#12398;&#27573;&#38542;&#65288;&#20966;&#29702;&#12289;&#28204;&#23450;&#12289;&#12524;&#12452;&#12450;&#12454;&#12488;&#65289;&#12377;&#12409;&#12390;&#12434;&#23436;&#20102;&#12375;&#12383;&#12418;&#12398;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#65288;&#12356;&#12378;&#12428;&#12363;&#12364;&#24517;&#38920;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#65289;&#12290;&#13;
      &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get initialized():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set initialized(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/keyEquivalentField" class="dashAnchor" id="//apple_ref/cpp/Property/keyEquivalentField"></a><a name="keyEquivalentField" id="keyEquivalentField"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>keyEquivalentField</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>keyEquivalentField:<a href="../../String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#27770;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12391;&#12377;&#12290; &#20516;&#12398;&#12475;&#12483;&#12488;&#12399;&#12289;Keyboard &#12463;&#12521;&#12473;&#12398; <code>KEYNAME_XXXX</code> &#23450;&#25968;&#12391;&#23450;&#32681;&#12373;&#12428;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;Home&#12289;Insert &#12394;&#12393;&#12398;&#21046;&#24481;&#25991;&#23383;&#12398;&#20516;&#12395;&#23550;&#12375;&#12390;&#19968;&#35239;&#34920;&#31034;&#12373;&#12428;&#12427;&#23450;&#25968;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><p><code>keyEquivalentFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>"keyEquivalent"&#12290;</code></p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>keyEquivalentChanged</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get keyEquivalentField():<a href="../../String.html">String</a></code><br /><code>&#160;&#160;&#160;&#160;public function set keyEquivalentField(value:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/ui/Keyboard.html" target="">flash.ui.Keyboard</a></div></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/keyEquivalentFunction" class="dashAnchor" id="//apple_ref/cpp/Property/keyEquivalentFunction"></a><a name="keyEquivalentFunction" id="keyEquivalentFunction"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>keyEquivalentFunction</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>keyEquivalentFunction:<a href="../../Function.html">Function</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#21028;&#23450;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#30465;&#30053;&#12377;&#12427;&#12392;&#12289;<code>keyEquivalentField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12451;&#12540;&#12523;&#12489;&#12414;&#12383;&#12399;&#23646;&#24615;&#12398;&#20516;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;<code>keyEquivalentField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
      </p><p><code>keyEquivalentFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#20966;&#29702;&#12420;&#12525;&#12540;&#12459;&#12521;&#12452;&#12474;&#12395;&#12418;&#20351;&#29992;&#12391;&#12365;&#12289;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12395;&#20381;&#23384;&#12375;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
      <p>&#12371;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#38306;&#25968;&#12399;&#21336;&#19968;&#12398;&#24341;&#25968;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#24341;&#25968;&#12399;&#12289;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12391;&#12354;&#12426;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <pre><code>myKeyEquivalentFunction(item:Object):String</code></pre>&#13;
     &#13;
      <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>"undefined"&#12290;</code></p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>keyEquivalentFunctionChanged</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get keyEquivalentFunction():<a href="../../Function.html">Function</a></code><br /><code>&#160;&#160;&#160;&#160;public function set keyEquivalentFunction(value:<a href="../../Function.html">Function</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/ui/Keyboard.html" target="">flash.ui.Keyboard</a></div></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/keyEquivalentModifiersFunction" class="dashAnchor" id="//apple_ref/cpp/Property/keyEquivalentModifiersFunction"></a><a name="keyEquivalentModifiersFunction" id="keyEquivalentModifiersFunction"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>keyEquivalentModifiersFunction</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>keyEquivalentModifiersFunction:<a href="../../Function.html">Function</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#12434;&#21028;&#23450;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#30465;&#30053;&#12375;&#12383;&#22580;&#21512;&#12289;Flex &#12391;&#12399;&#29420;&#33258;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#38306;&#25968;&#12364;&#20351;&#29992;&#12373;&#12428;&#12289;&#27425;&#12398;&#65288;&#12502;&#12540;&#12523;&#65289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#23384;&#22312;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12487;&#12540;&#12479;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#12398;&#37197;&#21015;&#12364;&#27770;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;<code>altKey</code>&#12289;<code>commandKey</code>&#12289;<code>controlKey</code> &#12362;&#12424;&#12403; <code>shiftKey</code> &#12391;&#12377;&#12290;&#13;
     &#13;
      </p><p><code>keyEquivalentModifiersFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#20966;&#29702;&#12420;&#12525;&#12540;&#12459;&#12521;&#12452;&#12474;&#12395;&#12418;&#20351;&#29992;&#12391;&#12365;&#12289;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12395;&#20381;&#23384;&#12375;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
      <p>&#12371;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#38306;&#25968;&#12399;&#21336;&#19968;&#12398;&#24341;&#25968;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#24341;&#25968;&#12399;&#12289;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12391;&#12354;&#12426;&#12289;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#12461;&#12540;&#21517;&#12398;&#37197;&#21015;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <pre><code>myKeyEquivalentModifiersFunction(item:Object):Array</code></pre>&#13;
     &#13;
      <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>"undefined"&#12290;</code></p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>keyEquivalentModifiersFunctionChanged</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get keyEquivalentModifiersFunction():<a href="../../Function.html">Function</a></code><br /><code>&#160;&#160;&#160;&#160;public function set keyEquivalentModifiersFunction(value:<a href="../../Function.html">Function</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/labelField" class="dashAnchor" id="//apple_ref/cpp/Property/labelField"></a><a name="labelField" id="labelField"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>labelField</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>labelField:<a href="../../String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12486;&#12461;&#12473;&#12488;&#12434;&#27770;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12391;&#12377;&#12290; &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#37197;&#21015;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#21508;&#12473;&#12488;&#12522;&#12531;&#12464;&#20516;&#12364;&#12521;&#12505;&#12523;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364; E4X XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#26126;&#31034;&#30340;&#12395;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;E4X XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#21508; XML &#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#23550;&#12375;&#12390;&#34920;&#31034;&#12377;&#12427;&#12486;&#12461;&#12473;&#12488;&#12434;&#21547;&#12416; "label" &#23646;&#24615;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;labelField &#12434; <code>"@label"</code> &#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p>&#12521;&#12505;&#12523;&#12391;&#12399;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12434;&#21069;&#12395;&#20184;&#12369;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#25991;&#23383;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;<code>"C_ut"</code> &#12392;&#12356;&#12358;&#12521;&#12505;&#12523;&#20516;&#12398;&#22580;&#21512;&#12289;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364; 1 &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#30446;&#30340;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;&#26368;&#21021;&#12398;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12384;&#12369;&#12391;&#12377;&#12290; &#12521;&#12505;&#12523;&#20869;&#12395;&#12522;&#12486;&#12521;&#12523;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#25991;&#23383;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12434; 2 &#12388;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12456;&#12473;&#12465;&#12540;&#12503;&#12391;&#12365;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;<code>"C__u_t"</code> &#12392;&#12356;&#12358;&#12521;&#12505;&#12523;&#20516;&#12399;&#12289;"C_ut" &#12392;&#12356;&#12358;&#12521;&#12505;&#12523;&#12434;&#25345;&#12385;&#12289;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364; 3 &#65288;"t" &#25991;&#23383;&#65289;&#12391;&#12354;&#12427;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; <code>mnemonicIndexField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#23384;&#22312;&#12375;&#12289;&#12381;&#12428;&#12364; 0 &#12424;&#12426;&#22823;&#12365;&#12356;&#20516;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20516;&#12424;&#12426;&#12418;&#12381;&#12398;&#20516;&#12364;&#20778;&#20808;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <p><code>labelFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>"label"&#12290;</code></p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>labelFieldChanged</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get labelField():<a href="../../String.html">String</a></code><br /><code>&#160;&#160;&#160;&#160;public function set labelField(value:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/labelFunction" class="dashAnchor" id="//apple_ref/cpp/Property/labelFunction"></a><a name="labelFunction" id="labelFunction"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>labelFunction</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>labelFunction:<a href="../../Function.html">Function</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#34920;&#31034;&#12377;&#12427;&#12486;&#12461;&#12473;&#12488;&#12434;&#21028;&#23450;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290; &#12521;&#12505;&#12523;&#38306;&#25968;&#12391;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#20869;&#12398;&#36969;&#20999;&#12394;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#26908;&#32034;&#12375;&#12289;&#34920;&#31034;&#21487;&#33021;&#12394;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#13;
     &#13;
      </p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#30465;&#30053;&#12377;&#12427;&#12392;&#12289;<code>labelField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12451;&#12540;&#12523;&#12489;&#12414;&#12383;&#12399;&#23646;&#24615;&#12398;&#20516;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;<code>labelField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
     &#13;
      <p><code>labelFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#20966;&#29702;&#12420;&#12525;&#12540;&#12459;&#12521;&#12452;&#12474;&#12395;&#24441;&#31435;&#12385;&#12289;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12395;&#20381;&#23384;&#12375;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
      <p>&#12371;&#12398;&#12521;&#12505;&#12523;&#38306;&#25968;&#12399;&#21336;&#19968;&#12398;&#24341;&#25968;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#24341;&#25968;&#12399;&#12289;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12391;&#12354;&#12426;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <pre><code>myLabelFunction(item:Object):String</code></pre>&#13;
     &#13;
      <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>"undefined"&#12290;</code></p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>labelFunctionChanged</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get labelFunction():<a href="../../Function.html">Function</a></code><br /><code>&#160;&#160;&#160;&#160;public function set labelFunction(value:<a href="../../Function.html">Function</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/mnemonicIndexField" class="dashAnchor" id="//apple_ref/cpp/Property/mnemonicIndexField"></a><a name="mnemonicIndexField" id="mnemonicIndexField"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>mnemonicIndexField</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>mnemonicIndexField:<a href="../../String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#27770;&#23450;&#12377;&#12427;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395; 0 &#12424;&#12426;&#22823;&#12365;&#12356;&#25968;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12399;&#12289;&#12521;&#12505;&#12523;&#20869;&#12398;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#25968;&#12424;&#12426;&#12418;&#20778;&#20808;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <p><code>mnemonicIndexFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>"mnemonicIndex"&#12290;</code></p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>mnemonicIndexChanged</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get mnemonicIndexField():<a href="../../String.html">String</a></code><br /><code>&#160;&#160;&#160;&#160;public function set mnemonicIndexField(value:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="FlexNativeMenu.html#labelField" target="">labelField</a></div></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/mnemonicIndexFunction" class="dashAnchor" id="//apple_ref/cpp/Property/mnemonicIndexFunction"></a><a name="mnemonicIndexFunction" id="mnemonicIndexFunction"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>mnemonicIndexFunction</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>mnemonicIndexFunction:<a href="../../Function.html">Function</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#21508;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#21028;&#23450;&#12377;&#12427;&#38306;&#25968;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#30465;&#30053;&#12377;&#12427;&#12392;&#12289;<code>mnemonicIndexField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#25351;&#23450;&#12375;&#12383;&#12501;&#12451;&#12540;&#12523;&#12489;&#12414;&#12383;&#12399;&#23646;&#24615;&#12398;&#20516;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;<code>mnemonicIndexField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
     &#13;
      <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#23450;&#32681;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#38306;&#25968;&#12364;&#12487;&#12540;&#12479;&#12450;&#12452;&#12486;&#12512;&#12395;&#23550;&#12375;&#12390; 0 &#12424;&#12426;&#22823;&#12365;&#12356;&#25968;&#12434;&#36820;&#12377;&#22580;&#21512;&#12399;&#12289;&#12521;&#12505;&#12523;&#20869;&#12398;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#25968;&#12424;&#12426;&#12418;&#36820;&#12373;&#12428;&#12383;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364;&#20778;&#20808;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <p><code>mnemonicIndexFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#20966;&#29702;&#12420;&#12525;&#12540;&#12459;&#12521;&#12452;&#12474;&#12395;&#12418;&#20351;&#29992;&#12391;&#12365;&#12289;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12395;&#20381;&#23384;&#12375;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
      <p>&#12371;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#38306;&#25968;&#12399;&#21336;&#19968;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12289;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12391;&#12354;&#12426;&#12289;int &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <pre><code>myMnemonicIndexFunction(item:Object):int</code></pre>&#13;
     &#13;
      <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>"undefined"&#12290;</code></p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>mnemonicIndexFunctionChanged</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get mnemonicIndexFunction():<a href="../../Function.html">Function</a></code><br /><code>&#160;&#160;&#160;&#160;public function set mnemonicIndexFunction(value:<a href="../../Function.html">Function</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/nativeMenu" class="dashAnchor" id="//apple_ref/cpp/Property/nativeMenu"></a><a name="nativeMenu" id="nativeMenu"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>nativeMenu</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>nativeMenu:<a href="../../flash/display/NativeMenu.html">NativeMenu</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
       &#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#31649;&#29702;&#12373;&#12428;&#12427; flash.display.NativeMenu &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399; null &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#22522;&#12395;&#12394;&#12427; NativeMenu &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#30452;&#25509;&#21152;&#12360;&#12425;&#12428;&#12383;&#22793;&#26356;&#12399;&#12289;&#12513;&#12491;&#12517;&#12540;&#12414;&#12383;&#12399;&#22522;&#12395;&#12394;&#12427;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#22833;&#12431;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
      &#13;
      </p><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12398;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289; <code>nativeMenuUpdate</code>  &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get nativeMenu():<a href="../../flash/display/NativeMenu.html">NativeMenu</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/nestLevel" class="dashAnchor" id="//apple_ref/cpp/Property/nestLevel"></a><a name="nestLevel" id="nestLevel"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>nestLevel</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>nestLevel:<a href="../../int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#38542;&#23652;&#12395;&#12362;&#12369;&#12427;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#28145;&#24230;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#25968;&#20516;&#12399;&#12289;&#28204;&#23450;&#12362;&#12424;&#12403;&#12524;&#12452;&#12450;&#12454;&#12488;&#12467;&#12540;&#12489;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364; DisplayList &#12391;&#12394;&#12356;&#22580;&#21512;&#12289;&#12371;&#12398;&#20516;&#12399; 0 &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
      &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get nestLevel():<a href="../../int.html">int</a></code><br /><code>&#160;&#160;&#160;&#160;public function set nestLevel(value:<a href="../../int.html">int</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/numAutomationChildren" class="dashAnchor" id="//apple_ref/cpp/Property/numAutomationChildren"></a><a name="numAutomationChildren" id="numAutomationChildren"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>numAutomationChildren</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>numAutomationChildren:<a href="../../int.html">int</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12371;&#12398;&#12467;&#12531;&#12486;&#12490;&#12395;&#21547;&#12414;&#12428;&#12427;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#12398;&#23376;&#12398;&#25968;&#12391;&#12377;&#12290; &#12371;&#12398;&#21512;&#35336;&#12395;&#12399;&#12289;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#38542;&#23652;&#12391;&#37325;&#35201;&#12391;&#12394;&#12356;&#23376;&#12399;&#21547;&#12414;&#12428;&#12414;&#12377;&#12364;&#12289;&#32068;&#12415;&#21512;&#12431;&#12373;&#12428;&#12383;&#23376;&#12364;&#21547;&#12414;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#13;
      &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get numAutomationChildren():<a href="../../int.html">int</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/processedDescriptors" class="dashAnchor" id="//apple_ref/cpp/Property/processedDescriptors"></a><a name="processedDescriptors" id="processedDescriptors"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>processedDescriptors</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>processedDescriptors:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#23376;&#12434;&#12377;&#12368;&#12395;&#29983;&#25104;&#12377;&#12427;&#12363;&#12289;&#36933;&#24310;&#29983;&#25104;&#12375;&#12383;&#24460;&#12289;&#12371;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#30330;&#29983;&#12395;&#24540;&#12376;&#12390;&#12289;<code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; Container &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;<code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;<code>createComponentsFromDescriptors()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#32066;&#20102;&#26178;&#12289;&#12388;&#12414;&#12426;&#12289;Container &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#23376;&#12398;&#35352;&#36848;&#23376;&#12363;&#12425;&#23376;&#12434;&#20316;&#25104;&#12375;&#12383;&#24460;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><p>&#20363;&#12360;&#12400;&#12289;Accordion &#12467;&#12531;&#12486;&#12490;&#12364;&#36933;&#24310;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;Accordion &#12467;&#12531;&#12486;&#12490;&#12398; 2 &#30058;&#30446;&#12398;&#12506;&#12452;&#12531;&#12398; <code>processedDescriptors</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12381;&#12398;&#12506;&#12452;&#12531;&#12414;&#12391;&#12490;&#12499;&#12466;&#12540;&#12488;&#12375;&#12289;&#12506;&#12452;&#12531;&#12364;&#12381;&#12398;&#23376;&#12434;&#20316;&#25104;&#12377;&#12427;&#12414;&#12391; <code>true</code> &#12395;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12383;&#12384;&#12375;&#12289;Accordion &#12364; <code>creationPolicy</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code>"all"</code> &#12395;&#35373;&#23450;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398; 2 &#30058;&#30446;&#12398;&#12506;&#12452;&#12531;&#12398; <code>processedDescriptors</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36215;&#21205;&#20013;&#12395; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <p>&#12467;&#12531;&#12486;&#12490;&#12391;&#12399;&#12394;&#12356;&#12463;&#12521;&#12473;&#12395;&#12399;&#35352;&#36848;&#23376;&#12364;&#12394;&#12367;&#12289;&#12371;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;<code>createChildren()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#20869;&#37096;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#23376;&#12434;&#20316;&#25104;&#12375;&#12383;&#24460;&#12391;&#12377;&#12290;</p>&#13;
      &#13;
      <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get processedDescriptors():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set processedDescriptors(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/showInAutomationHierarchy" class="dashAnchor" id="//apple_ref/cpp/Property/showInAutomationHierarchy"></a><a name="showInAutomationHierarchy" id="showInAutomationHierarchy"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>showInAutomationHierarchy</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>showInAutomationHierarchy:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
       &#13;
      &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#38542;&#23652;&#12395;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#12290; &#38542;&#23652;&#12395;&#34920;&#31034;&#12373;&#12428;&#12394;&#12356;&#12467;&#12531;&#12486;&#12490;&#12398;&#23376;&#12399;&#12289;&#27425;&#12395;&#39640;&#12356;&#12524;&#12505;&#12523;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#35242;&#12398;&#23376;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290; &#36890;&#24120;&#12289;&#12508;&#12483;&#12463;&#12473;&#12420; Canvas &#12398;&#12424;&#12358;&#12394;&#12524;&#12452;&#12450;&#12454;&#12488;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12467;&#12531;&#12486;&#12490;&#12399;&#38542;&#23652;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
      </p><p>&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#23376;&#12434;&#38542;&#23652;&#12395;&#34920;&#31034;&#12373;&#12379;&#12427;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;List &#12399;&#12289;&#12508;&#12483;&#12463;&#12473;&#12394;&#12393;&#12398;&#12450;&#12452;&#12486;&#12512;&#12524;&#12531;&#12480;&#12521;&#12540;&#12434;&#24517;&#12378;&#38542;&#23652;&#12395;&#34920;&#31034;&#12373;&#12379;&#12414;&#12377;&#12290; &#12452;&#12531;&#12503;&#12522;&#12513;&#12531;&#12479;&#12391;&#12399;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code>true</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
      &#13;
      <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get showInAutomationHierarchy():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set showInAutomationHierarchy(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/showRoot" class="dashAnchor" id="//apple_ref/cpp/Property/showRoot"></a><a name="showRoot" id="showRoot"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>showRoot</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>showRoot:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12398;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#12434;&#34920;&#31034;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12377;&#12427;&#12502;&#12540;&#12523;&#20516;&#12398;&#12501;&#12521;&#12464;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><p>&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12395;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#12364;&#12354;&#12426;&#12289;<code>showRoot</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>false</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;FlexNativeMenu &#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12395;&#12424;&#12387;&#12390;&#34920;&#31034;&#12373;&#12428;&#12427;&#26368;&#19978;&#20301;&#12398;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12399;&#12289;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#12398;&#30452;&#19979;&#12398;&#19979;&#20301;&#35201;&#32032;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
      <p>&#12371;&#12398;&#12501;&#12521;&#12464;&#12399;&#12289;&#12522;&#12473;&#12488;&#12420;&#37197;&#21015;&#12394;&#12393;&#12398;&#12523;&#12540;&#12488;&#12494;&#12540;&#12489;&#12364;&#12394;&#12356;&#12487;&#12540;&#12479;&#12503;&#12525;&#12496;&#12452;&#12480;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
      <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>true&#12290;</code></p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get showRoot():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set showRoot(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="FlexNativeMenu.html#hasRoot" target="">hasRoot</a></div></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/updateCompletePendingFlag" class="dashAnchor" id="//apple_ref/cpp/Property/updateCompletePendingFlag"></a><a name="updateCompletePendingFlag" id="updateCompletePendingFlag"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>updateCompletePendingFlag</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>updateCompletePendingFlag:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; 3 &#27573;&#38542;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#26908;&#35388;&#12434;&#23436;&#20102;&#12375;&#12383;&#12418;&#12398;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#65288;&#12356;&#12378;&#12428;&#12363;&#12398;&#26908;&#35388;&#12364;&#24517;&#38920;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#65289;&#12290;&#13;
      &#13;
      </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get updateCompletePendingFlag():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set updateCompletePendingFlag(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Constructor/FlexNativeMenu()" class="dashAnchor" id="//apple_ref/cpp/Constructor/FlexNativeMenu()"></a><a name="FlexNativeMenu()" id="FlexNativeMenu()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>FlexNativeMenu</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function FlexNativeMenu()</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p>&#13;
      &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;&#13;
      &#13;
      </p></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/commitProperties()" class="dashAnchor" id="//apple_ref/cpp/Method/commitProperties()"></a><a name="commitProperties()" id="commitProperties()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;commitProperties</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> protected function commitProperties():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../mx/core/UIComponent.html#commitProperties()" target="">mx.core.UIComponent.commitProperties()</a></div></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/createAutomationIDPart()" class="dashAnchor" id="//apple_ref/cpp/Method/createAutomationIDPart()"></a><a name="createAutomationIDPart()" id="createAutomationIDPart()"></a><a name="createAutomationIDPart(mx.automation.IAutomationObject)" id="createAutomationIDPart(mx.automation.IAutomationObject)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;createAutomationIDPart</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function createAutomationIDPart(child:<a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a>):<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12371;&#12398;&#12467;&#12531;&#12486;&#12490;&#12398;&#23376;&#12434;&#35672;&#21029;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12475;&#12483;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#23384;&#32154;&#20013;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#20516;&#12434;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
      &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">child</span>:<a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a></code> &#8212; ID &#12434;&#25552;&#20379;&#12377;&#12427;&#23550;&#35937;&#12398;&#23376;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Object.html">Object</a></code> &#8212; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#24460;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12289;&#23376;&#12434;&#35352;&#36848;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12475;&#12483;&#12488;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/createAutomationIDPartWithRequiredProperties()" class="dashAnchor" id="//apple_ref/cpp/Method/createAutomationIDPartWithRequiredProperties()"></a><a name="createAutomationIDPartWithRequiredProperties()" id="createAutomationIDPartWithRequiredProperties()"></a><a name="createAutomationIDPartWithRequiredProperties(mx.automation.IAutomationObject,Array)" id="createAutomationIDPartWithRequiredProperties(mx.automation.IAutomationObject,Array)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;createAutomationIDPartWithRequiredProperties</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function createAutomationIDPartWithRequiredProperties(child:<a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a>, properties:<a href="../../Array.html">Array</a>):<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
	  &#12371;&#12398;&#12467;&#12531;&#12486;&#12490;&#12398;&#23376;&#12434;&#35672;&#21029;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12475;&#12483;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#23384;&#32154;&#20013;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#20516;&#12434;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
	  &#13;
	  </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">child</span>:<a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a></code> &#8212; ID &#12434;&#25552;&#20379;&#12377;&#12427;&#23550;&#35937;&#12398;&#23376;&#12391;&#12377;&#12290;&#13;
	 &#13;
	  </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">properties</span>:<a href="../../Array.html">Array</a></code></td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Object.html">Object</a></code> &#8212; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#24460;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12289;&#23376;&#12434;&#35352;&#36848;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12475;&#12483;&#12488;&#12391;&#12377;&#12290;&#13;
	  &#13;
	  </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/display()" class="dashAnchor" id="//apple_ref/cpp/Method/display()"></a><a name="display()" id="display()"></a><a name="display(flash.display.Stage,int,int)" id="display(flash.display.Stage,int,int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;display</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function display(stage:<a href="../../flash/display/Stage.html">Stage</a>, x:<a href="../../int.html">int</a>, y:<a href="../../int.html">int</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12371;&#12398;&#12513;&#12491;&#12517;&#12540;&#12434;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#20301;&#32622;&#12395;&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290; &#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">stage</span>:<a href="../../flash/display/Stage.html">Stage</a></code> &#8212; &#12371;&#12398;&#12513;&#12491;&#12517;&#12540;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427; Stage &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; &#13;
     &#13;
      </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">x</span>:<a href="../../int.html">int</a></code> &#8212; &#12371;&#12398;&#12513;&#12491;&#12517;&#12540;&#12434;&#34920;&#31034;&#12377;&#12427;&#12473;&#12486;&#12540;&#12472;&#12398;&#36215;&#28857;&#12434;&#22522;&#28310;&#12392;&#12375;&#12383;&#12289;&#27700;&#24179;&#26041;&#21521;&#12398;&#12500;&#12463;&#12475;&#12523;&#25968;&#12391;&#12377;&#12290; &#13;
     &#13;
      </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">y</span>:<a href="../../int.html">int</a></code> &#8212; &#12371;&#12398;&#12513;&#12491;&#12517;&#12540;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#12473;&#12486;&#12540;&#12472;&#12398;&#36215;&#28857;&#12434;&#22522;&#28310;&#12395;&#12375;&#12383;&#22402;&#30452;&#26041;&#21521;&#12398;&#12500;&#12463;&#12475;&#12523;&#25968;&#12391;&#12377;&#12290; &#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/getAutomationChildAt()" class="dashAnchor" id="//apple_ref/cpp/Method/getAutomationChildAt()"></a><a name="getAutomationChildAt()" id="getAutomationChildAt()"></a><a name="getAutomationChildAt(int)" id="getAutomationChildAt(int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;getAutomationChildAt</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function getAutomationChildAt(index:<a href="../../int.html">int</a>):<a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
       &#13;
      &#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12391;&#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12522;&#12473;&#12488;&#12395;&#12399;&#12289;&#32068;&#12415;&#21512;&#12431;&#12373;&#12428;&#12383;&#23376;&#12434;&#20837;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">index</span>:<a href="../../int.html">int</a></code> &#8212; &#36820;&#12373;&#12428;&#12427;&#23376;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../mx/automation/IAutomationObject.html">IAutomationObject</a></code> &#8212; &#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20301;&#32622;&#12395;&#12354;&#12427;&#23376;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/getAutomationChildren()" class="dashAnchor" id="//apple_ref/cpp/Method/getAutomationChildren()"></a><a name="getAutomationChildren()" id="getAutomationChildren()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;getAutomationChildren</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function getAutomationChildren():<a href="../../Array.html">Array</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
       &#13;
	  &#12458;&#12540;&#12488;&#12513;&#12540;&#12471;&#12519;&#12531;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12522;&#12473;&#12488;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12522;&#12473;&#12488;&#12395;&#12399;&#12289;&#32068;&#12415;&#21512;&#12431;&#12373;&#12428;&#12383;&#23376;&#12399;&#21547;&#12414;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
	 &#13;
		 &#13;
	  </p><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Array.html">Array</a></code> &#8212; &#23376;&#12391;&#12377;&#12290;&#13;
	  &#13;
	  </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/invalidateProperties()" class="dashAnchor" id="//apple_ref/cpp/Method/invalidateProperties()"></a><a name="invalidateProperties()" id="invalidateProperties()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;invalidateProperties</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function invalidateProperties():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#24460;&#12391;&#30011;&#38754;&#26356;&#26032;&#26178;&#12395; <code>commitProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12510;&#12540;&#12463;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p>&#28961;&#21177;&#21270;&#12399;&#12289;&#24460;&#12391;&#30011;&#38754;&#12364;&#26356;&#26032;&#12373;&#12428;&#12427;&#12414;&#12391;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#22793;&#26356;&#20966;&#29702;&#12434;&#20445;&#30041;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#20316;&#26989;&#12398;&#37325;&#35079;&#12434;&#35299;&#28040;&#12377;&#12427;&#20415;&#21033;&#12394;&#12513;&#12459;&#12491;&#12474;&#12512;&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12486;&#12461;&#12473;&#12488;&#12398;&#33394;&#12392;&#12469;&#12452;&#12474;&#12434;&#22793;&#26356;&#12377;&#12427;&#22580;&#21512;&#12289;&#33394;&#12434;&#22793;&#26356;&#12375;&#12383;&#24460;&#12289;&#12377;&#12368;&#12395;&#33394;&#12434;&#26356;&#26032;&#12375;&#12289;&#27425;&#12395;&#12469;&#12452;&#12474;&#12434;&#35373;&#23450;&#12375;&#12390;&#12289;&#20170;&#24230;&#12399;&#12469;&#12452;&#12474;&#12434;&#26356;&#26032;&#12377;&#12427;&#12392;&#12356;&#12358;&#20966;&#29702;&#12399;&#26178;&#38291;&#12398;&#28010;&#36027;&#12391;&#12377;&#12290;&#20001;&#26041;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12375;&#12383;&#24460;&#12289;&#26032;&#12375;&#12356;&#12469;&#12452;&#12474;&#12392;&#33394;&#12391;&#12486;&#12461;&#12473;&#12488;&#12434;&#19968;&#24230;&#12395;&#20877;&#25551;&#30011;&#12377;&#12427;&#26041;&#12364;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
      <p>&#28961;&#21177;&#21270;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#19968;&#33324;&#30340;&#12395;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#36969;&#20999;&#12394;&#28961;&#21177;&#21270;&#12513;&#12477;&#12483;&#12489;&#12364;&#33258;&#21205;&#30340;&#12395;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
      &#13;
      </div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/itemToKeyEquivalent()" class="dashAnchor" id="//apple_ref/cpp/Method/itemToKeyEquivalent()"></a><a name="itemToKeyEquivalent()" id="itemToKeyEquivalent()"></a><a name="itemToKeyEquivalent(Object)" id="itemToKeyEquivalent(Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;itemToKeyEquivalent</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> protected function itemToKeyEquivalent(data:<a href="../../Object.html">Object</a>):<a href="../../String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      <code>keyEquivalentField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392; <code>keyEquivalentFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;&#31354;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">data</span>:<a href="../../Object.html">Object</a></code> &#8212; &#34920;&#31034;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../String.html">String</a></code> &#8212; &#12487;&#12540;&#12479;&#12395;&#22522;&#12389;&#12356;&#12383;&#12461;&#12540;&#30456;&#24403;&#29289;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/itemToKeyEquivalentModifiers()" class="dashAnchor" id="//apple_ref/cpp/Method/itemToKeyEquivalentModifiers()"></a><a name="itemToKeyEquivalentModifiers()" id="itemToKeyEquivalentModifiers()"></a><a name="itemToKeyEquivalentModifiers(Object)" id="itemToKeyEquivalentModifiers(Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;itemToKeyEquivalentModifiers</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> protected function itemToKeyEquivalentModifiers(data:<a href="../../Object.html">Object</a>):<a href="../../Array.html">Array</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      <code>keyEquivalentModifiersFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#12398;&#37197;&#21015;&#12395;&#22793;&#25563;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;&#31354;&#12398;&#37197;&#21015;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">data</span>:<a href="../../Object.html">Object</a></code> &#8212; &#34920;&#31034;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Array.html">Array</a></code> &#8212; &#12487;&#12540;&#12479;&#12395;&#22522;&#12389;&#12356;&#12383;&#12461;&#12540;&#30456;&#24403;&#29289;&#12398;&#12514;&#12487;&#12451;&#12501;&#12449;&#12452;&#12450;&#12398;&#37197;&#21015;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/itemToLabel()" class="dashAnchor" id="//apple_ref/cpp/Method/itemToLabel()"></a><a name="itemToLabel()" id="itemToLabel()"></a><a name="itemToLabel(Object)" id="itemToLabel(Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;itemToLabel</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> protected function itemToLabel(data:<a href="../../Object.html">Object</a>):<a href="../../String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      <code>labelField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392; <code>labelFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12521;&#12505;&#12523;&#12392;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#21336;&#19968;&#12398;&#31354;&#30333;&#25991;&#23383;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">data</span>:<a href="../../Object.html">Object</a></code> &#8212; &#34920;&#31034;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../String.html">String</a></code> &#8212; &#12487;&#12540;&#12479;&#12395;&#24540;&#12376;&#12390;&#34920;&#31034;&#12373;&#12428;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/itemToMnemonicIndex()" class="dashAnchor" id="//apple_ref/cpp/Method/itemToMnemonicIndex()"></a><a name="itemToMnemonicIndex()" id="itemToMnemonicIndex()"></a><a name="itemToMnemonicIndex(Object)" id="itemToMnemonicIndex(Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;itemToMnemonicIndex</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> protected function itemToMnemonicIndex(data:<a href="../../Object.html">Object</a>):<a href="../../int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      <code>mnemonicIndexField</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392; <code>mnemonicIndexFunction</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25972;&#25968;&#12395;&#22793;&#25563;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;-1 &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">data</span>:<a href="../../Object.html">Object</a></code> &#8212; &#34920;&#31034;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../int.html">int</a></code> &#8212; &#12487;&#12540;&#12479;&#12395;&#22522;&#12389;&#12356;&#12383;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/parseLabelToMnemonicIndex()" class="dashAnchor" id="//apple_ref/cpp/Method/parseLabelToMnemonicIndex()"></a><a name="parseLabelToMnemonicIndex()" id="parseLabelToMnemonicIndex()"></a><a name="parseLabelToMnemonicIndex(String)" id="parseLabelToMnemonicIndex(String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;parseLabelToMnemonicIndex</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> protected function parseLabelToMnemonicIndex(data:<a href="../../String.html">String</a>):<a href="../../int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#25991;&#23383;&#12364;&#23384;&#22312;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#22522;&#12389;&#12356;&#12390;&#12521;&#12505;&#12523;&#12363;&#12425;&#12491;&#12540;&#12514;&#12491;&#12483;&#12463;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#25277;&#20986;&#12375;&#12414;&#12377;&#12290;&#20808;&#38957;&#12398;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#25991;&#23383;&#65288;&#12354;&#12427;&#22580;&#21512;&#65289;&#12434;&#25506;&#12375;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">data</span>:<a href="../../String.html">String</a></code> &#8212; &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#29992;&#12395;&#35299;&#26512;&#12377;&#12427;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../int.html">int</a></code> &#8212; &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/parseLabelToString()" class="dashAnchor" id="//apple_ref/cpp/Method/parseLabelToString()"></a><a name="parseLabelToString()" id="parseLabelToString()"></a><a name="parseLabelToString(String)" id="parseLabelToString(String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;parseLabelToString</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> protected function parseLabelToString(data:<a href="../../String.html">String</a>):<a href="../../String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#25991;&#23383;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#21066;&#38500;&#12375;&#12289;&#12456;&#12473;&#12465;&#12540;&#12503;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#25991;&#23383;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#22793;&#25563;&#12375;&#12390;&#12289;NativeMenuItem &#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#23455;&#38555;&#12398;&#12521;&#12505;&#12523;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">data</span>:<a href="../../String.html">String</a></code> &#8212; &#12521;&#12505;&#12523;&#29992;&#12395;&#35299;&#26512;&#12377;&#12427;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../String.html">String</a></code> &#8212; &#12521;&#12505;&#12523;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/replayAutomatableEvent()" class="dashAnchor" id="//apple_ref/cpp/Method/replayAutomatableEvent()"></a><a name="replayAutomatableEvent()" id="replayAutomatableEvent()"></a><a name="replayAutomatableEvent(flash.events.Event)" id="replayAutomatableEvent(flash.events.Event)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;replayAutomatableEvent</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function replayAutomatableEvent(event:<a href="../../flash/events/Event.html">Event</a>):<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12505;&#12531;&#12488;&#12434;&#20877;&#29983;&#12375;&#12414;&#12377;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#20877;&#29983;&#21205;&#20316;&#12364;&#12473;&#12540;&#12497;&#12540;&#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#20316;&#25104;&#32773;&#12399; super.replayAutomatableEvent &#12434;&#21628;&#12403;&#20986;&#12377;&#12399;&#12378;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">event</span>:<a href="../../flash/events/Event.html">Event</a></code> &#8212; &#20877;&#29983;&#12377;&#12427;&#12452;&#12505;&#12531;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Boolean.html">Boolean</a></code> &#8212; &#20877;&#29983;&#12364;&#27491;&#24120;&#12395;&#23436;&#20102;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;<code>true</code> &#12391;&#12377;&#12290;  &#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/resolveAutomationIDPart()" class="dashAnchor" id="//apple_ref/cpp/Method/resolveAutomationIDPart()"></a><a name="resolveAutomationIDPart()" id="resolveAutomationIDPart()"></a><a name="resolveAutomationIDPart(Object)" id="resolveAutomationIDPart(Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;resolveAutomationIDPart</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function resolveAutomationIDPart(criteria:<a href="../../Object.html">Object</a>):<a href="../../Array.html">Array</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#25552;&#20379;&#12373;&#12428;&#12383; ID &#12434;&#20351;&#29992;&#12375;&#12390;&#23376;&#12434;&#35299;&#27770;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398; ID &#12399;&#12289;<code>createAutomationIDPart()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#25552;&#20379;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12475;&#12483;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">criteria</span>:<a href="../../Object.html">Object</a></code> &#8212; &#23376;&#12434;&#35352;&#36848;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12475;&#12483;&#12488;&#12391;&#12377;&#12290; &#26465;&#20214;&#12395;&#12399;&#12289;&#27491;&#35215;&#34920;&#29694;&#12398;&#20516;&#12434;&#20837;&#12428;&#12425;&#12428;&#12427;&#12398;&#12391;&#12289;&#35079;&#25968;&#12398;&#23376;&#12434;&#26465;&#20214;&#12395;&#19968;&#33268;&#12373;&#12379;&#12425;&#12428;&#12414;&#12377;&#12290;&#13;
      </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Array.html">Array</a></code> &#8212; &#26465;&#20214;&#12392;&#29031;&#21512;&#12391;&#12365;&#12427;&#23376;&#12398;&#37197;&#21015;&#12391;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#23376;&#12364;&#35299;&#27770;&#12391;&#12365;&#12427;&#22580;&#21512;&#12399; <code>null</code> &#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/setContextMenu()" class="dashAnchor" id="//apple_ref/cpp/Method/setContextMenu()"></a><a name="setContextMenu()" id="setContextMenu()"></a><a name="setContextMenu(flash.display.InteractiveObject)" id="setContextMenu(flash.display.InteractiveObject)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;setContextMenu</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function setContextMenu(component:<a href="../../flash/display/InteractiveObject.html">InteractiveObject</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      InteractiveObject &#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12434;&#22522;&#12395;&#12394;&#12427;&#12493;&#12452;&#12486;&#12451;&#12502;&#12513;&#12491;&#12517;&#12540;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">component</span>:<a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></code> &#8212; &#12452;&#12531;&#12479;&#12521;&#12463;&#12486;&#12451;&#12502;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/unsetContextMenu()" class="dashAnchor" id="//apple_ref/cpp/Method/unsetContextMenu()"></a><a name="unsetContextMenu()" id="unsetContextMenu()"></a><a name="unsetContextMenu(flash.display.InteractiveObject)" id="unsetContextMenu(flash.display.InteractiveObject)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;unsetContextMenu</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function unsetContextMenu(component:<a href="../../flash/display/InteractiveObject.html">InteractiveObject</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#22522;&#12395;&#12394;&#12427;&#12493;&#12452;&#12486;&#12451;&#12502;&#12513;&#12491;&#12517;&#12540;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12383; InteractiveObject &#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12398;&#35373;&#23450;&#12434;&#35299;&#38500;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">component</span>:<a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></code> &#8212; &#12452;&#12531;&#12479;&#12521;&#12463;&#12486;&#12451;&#12502;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/validateDisplayList()" class="dashAnchor" id="//apple_ref/cpp/Method/validateDisplayList()"></a><a name="validateDisplayList()" id="validateDisplayList()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;validateDisplayList</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function validateDisplayList():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#23376;&#12398;&#20301;&#32622;&#12392;&#12469;&#12452;&#12474;&#12434;&#26908;&#35388;&#12375;&#12289;&#12381;&#12398;&#20182;&#12398;&#12499;&#12472;&#12517;&#12450;&#12523;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25551;&#30011;&#12375;&#12414;&#12377;&#12290; <code>LayoutManager.invalidateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#12371;&#12398; ILayoutManagerClient &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#25351;&#23450;&#12375;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#34920;&#31034;&#12522;&#12473;&#12488;&#12398;&#26356;&#26032;&#26178;&#12395; <code>validateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
      &#13;
      </p></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/validateNow()" class="dashAnchor" id="//apple_ref/cpp/Method/validateNow()"></a><a name="validateNow()" id="validateNow()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;validateNow</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function validateNow():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12289;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#12524;&#12452;&#12450;&#12454;&#12488;&#12434;&#26908;&#35388;&#12362;&#12424;&#12403;&#26356;&#26032;&#12375;&#12289;&#12381;&#12428;&#12434;&#20877;&#25551;&#30011;&#12375;&#12414;&#12377;&#12290;&#13;
      &#13;
      </p></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/validateProperties()" class="dashAnchor" id="//apple_ref/cpp/Method/validateProperties()"></a><a name="validateProperties()" id="validateProperties()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;validateProperties</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function validateProperties():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#26908;&#35388;&#12375;&#12414;&#12377;&#12290; <code>LayoutManager.invalidateProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#12371;&#12398; ILayoutManagerClient &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#25351;&#23450;&#12375;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12398;&#20966;&#29702;&#26178;&#12395; <code>validateProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
      &#13;
      </p></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/validateSize()" class="dashAnchor" id="//apple_ref/cpp/Method/validateSize()"></a><a name="validateSize()" id="validateSize()"></a><a name="validateSize(Boolean)" id="validateSize(Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;validateSize</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function validateSize(recursive:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
      &#13;
      &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#28204;&#23450;&#12469;&#12452;&#12474;&#12434;&#26908;&#35388;&#12375;&#12414;&#12377;&#12290;<code>LayoutManager.invalidateSize()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#12371;&#12398; ILayoutManagerClient &#12434;&#25351;&#23450;&#12375;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#28204;&#23450;&#12398;&#23455;&#34892;&#26178;&#12395; <code>validateSize()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
      </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">recursive</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>false</code>)<code></code> &#8212; <code>true</code> &#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#12391;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;&#13;
      &#13;
      </td></tr></table></div></span><div class="detailSectionHeader"> &#12452;&#12505;&#12531;&#12488;&#12398;&#35443;&#32048; </div><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="event:itemClick" id="event:itemClick"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>itemClick</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../mx/events/FlexNativeMenuEvent.html"><code>mx.events.FlexNativeMenuEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; FlexNativeMenuEvent.type  =  </span><a href="../../mx/events/FlexNativeMenuEvent.html#ITEM_CLICK"><code>mx.events.FlexNativeMenuEvent.ITEM_CLICK</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
  &#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12364;&#36984;&#25246;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
  </p>&#13;
      FlexNativeMenuEvent.ITEM_CLICK &#12452;&#12505;&#12531;&#12488;&#22411;&#23450;&#25968;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12434;&#36984;&#25246;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      <p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12479;&#12452;&#12503;&#12398;&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21508;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12399;&#27425;&#12398;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12452;&#12505;&#12531;&#12488;&#12398;&#31278;&#39006;&#12395;&#12424;&#12387;&#12390;&#12399;&#28961;&#21177;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#21508;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
      <table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td>false</td></tr><tr><td><code>cancelable</code></td><td>true</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#20966;&#29702;&#12434;&#34892;&#12358;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12398;&#23450;&#32681;&#29992;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12398;&#30331;&#37682;&#12395; <code>myButton.addEventListener()</code> &#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;myButton &#12398;&#20516;&#12399; <code>currentTarget</code> &#12392;&#12394;&#12426;&#12414;&#12377;&#12290; </td></tr><tr><td><code>index</code></td><td>&#36984;&#25246;&#12373;&#12428;&#12383;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12513;&#12491;&#12517;&#12540;&#20869;&#12395;&#12362;&#12369;&#12427;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12391;&#12377;&#12290;</td></tr><tr><td><code>item</code></td><td>&#36984;&#25246;&#12373;&#12428;&#12383; dataProvider &#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12391;&#12377;&#12290;</td></tr><tr><td><code>label</code></td><td>&#36984;&#25246;&#12373;&#12428;&#12383;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12398;&#12521;&#12505;&#12523;&#12486;&#12461;&#12473;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>nativeMenu</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#29305;&#23450;&#12398; NativeMenu &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12377;&#12290;</td></tr><tr><td><code>nativeMenuItem</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#29305;&#23450;&#12398; NativeMenuItem &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12375;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#24517;&#12378;&#12375;&#12418;&#12452;&#12505;&#12531;&#12488;&#12434;&#21463;&#12369;&#21462;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290; &#12452;&#12505;&#12531;&#12488;&#12434;&#21463;&#12369;&#21462;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#24120;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12395;&#12399;&#12289;<code>currentTarget</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</td></tr><tr><td><code>type</code></td><td>FlexNativeMenuEvent.ITEM_CLICK</td></tr></table></div></span><span id="pageFilter" runtime="AIR::1.1##" product="Flex::3##"><a name="event:menuShow" id="event:menuShow"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>menuShow</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../mx/events/FlexNativeMenuEvent.html"><code>mx.events.FlexNativeMenuEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; FlexNativeMenuEvent.type  =  </span><a href="../../mx/events/FlexNativeMenuEvent.html#MENU_SHOW"><code>mx.events.FlexNativeMenuEvent.MENU_SHOW</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
  &#12513;&#12491;&#12517;&#12540;&#12414;&#12383;&#12399;&#12469;&#12502;&#12513;&#12491;&#12517;&#12540;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
  </p>&#13;
      FlexNativeMenuEvent.MENU_SHOW &#22411;&#23450;&#25968;&#12399;&#12289;&#12510;&#12454;&#12473;&#12509;&#12452;&#12531;&#12479;&#12540;&#12364;&#12513;&#12491;&#12517;&#12540;&#19978;&#12395;&#32622;&#12363;&#12428;&#12383;&#12363;&#12289;&#12469;&#12502;&#12513;&#12491;&#12517;&#12540;&#12364;&#38283;&#12363;&#12428;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
      <p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12479;&#12452;&#12503;&#12398;&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21508;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12399;&#27425;&#12398;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12452;&#12505;&#12531;&#12488;&#12398;&#31278;&#39006;&#12395;&#12424;&#12387;&#12390;&#12399;&#28961;&#21177;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#21508;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
      <table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td>false</td></tr><tr><td><code>cancelable</code></td><td>true</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#20966;&#29702;&#12434;&#34892;&#12358;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12398;&#23450;&#32681;&#29992;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12398;&#30331;&#37682;&#12395; <code>myButton.addEventListener()</code> &#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;myButton &#12398;&#20516;&#12399; <code>currentTarget</code> &#12392;&#12394;&#12426;&#12414;&#12377;&#12290; </td></tr><tr><td><code>index</code></td><td>-1. &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12371;&#12398;&#12479;&#12452;&#12503;&#12398;&#12452;&#12505;&#12531;&#12488;&#12398;&#22580;&#21512;&#12399;&#35373;&#23450;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</td></tr><tr><td><code>item</code></td><td>null&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12371;&#12398;&#12479;&#12452;&#12503;&#12398;&#12452;&#12505;&#12531;&#12488;&#12398;&#22580;&#21512;&#12399;&#35373;&#23450;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</td></tr><tr><td><code>label</code></td><td>null&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12371;&#12398;&#12479;&#12452;&#12503;&#12398;&#12452;&#12505;&#12531;&#12488;&#12398;&#22580;&#21512;&#12399;&#35373;&#23450;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</td></tr><tr><td><code>nativeMenu</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#29305;&#23450;&#12398; NativeMenu &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12377;&#12290;</td></tr><tr><td><code>nativeMenuItem</code></td><td>null&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12371;&#12398;&#12479;&#12452;&#12503;&#12398;&#12452;&#12505;&#12531;&#12488;&#12398;&#22580;&#21512;&#12399;&#35373;&#23450;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12375;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#24517;&#12378;&#12375;&#12418;&#12452;&#12505;&#12531;&#12488;&#12434;&#21463;&#12369;&#21462;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290; &#12452;&#12505;&#12531;&#12488;&#12434;&#21463;&#12369;&#21462;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#24120;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12395;&#12399;&#12289;<code>currentTarget</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</td></tr><tr><td><code>type</code></td><td>FlexNativeMenuEvent.MENU_SHOW</td></tr></table></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>