<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:10" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:1.0" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:10" /><meta name="product" content="air" /><meta name="productver" content="air:1.0" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="Clipboard,flash.desktop.Clipboard,formats,generalClipboard,supportsFilePromise,clear,clearData,getData,hasFormat,setData,setDataHandler" /><title>Clipboard - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.desktop</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  Clipboard</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">Clipboard  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
 Clipboard &#12463;&#12521;&#12473;&#12399;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12434;&#36890;&#12376;&#12390;&#12487;&#12540;&#12479;&#12392;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36578;&#36865;&#12377;&#12427;&#12467;&#12531;&#12486;&#12490;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12395;&#12399;&#12289;&#38745;&#30340; <code>generalClipboard</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36890;&#12376;&#12390;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;&#21516;&#12376;&#24773;&#22577;&#12434;&#35079;&#25968;&#12398;&#24418;&#24335;&#12391;&#26684;&#32013;&#12391;&#12365;&#12414;&#12377;&#12290;&#24773;&#22577;&#12434;&#35079;&#25968;&#12398;&#24418;&#24335;&#12391;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#21029;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12381;&#12398;&#24773;&#22577;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#21487;&#33021;&#24615;&#12364;&#39640;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;<code>setData()</code> &#12513;&#12477;&#12483;&#12489;&#12414;&#12383;&#12399; <code>setDataHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12487;&#12540;&#12479;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p> &#13;
 &#13;
               <p>&#27161;&#28310;&#24418;&#24335;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>&#13;
               <ul><li>BITMAP_FORMAT&#65306;BitmapData &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65288;AIR &#12398;&#12415;&#65289;</li>&#13;
                  <li>FILE_LIST_FORMAT&#65306;File &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#37197;&#21015;&#65288;AIR &#12398;&#12415;&#65289;</li>&#13;
                  <li>HTML_FORMAT&#65306;HTML &#24418;&#24335;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12487;&#12540;&#12479;</li>&#13;
                  <li>TEXT_FORMAT&#65306;&#12473;&#12488;&#12522;&#12531;&#12464;&#12487;&#12540;&#12479;</li>&#13;
                  <li>RICH_TEXT_FORMAT&#65306;&#12522;&#12483;&#12481;&#12486;&#12461;&#12473;&#12488;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12487;&#12540;&#12479;&#12434;&#21547;&#12416; ByteArray</li>&#13;
                  <li>URL_FORMAT&#65306;URL &#12473;&#12488;&#12522;&#12531;&#12464;&#65288;AIR &#12398;&#12415;&#65289;</li>&#13;
               </ul><p>ClipboardFormats &#12463;&#12521;&#12473;&#12395;&#27161;&#28310;&#24418;&#24335;&#12398;&#21517;&#21069;&#12398;&#12371;&#12428;&#12425;&#12398;&#23450;&#25968;&#12364;&#23450;&#32681;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12392;&#12398;&#38291;&#12391;&#36578;&#36865;&#12364;&#34892;&#12431;&#12428;&#12427;&#12392;&#12289;<span> ActionScript</span> &#12487;&#12540;&#12479;&#22411;&#12392;&#12493;&#12452;&#12486;&#12451;&#12502;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#24418;&#24335;&#12392;&#12398;&#38291;&#12391;&#27161;&#28310;&#24418;&#24335;&#12364;&#33258;&#21205;&#30340;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#24418;&#24335;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;<span>ActionScript</span> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#30452;&#21015;&#21270;&#12391;&#12365;&#12427;&#22580;&#21512;&#12289;&#21442;&#29031;&#12392;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12463;&#12525;&#12540;&#12531;&#12398;&#20001;&#26041;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#21442;&#29031;&#12399;&#12289;&#20803;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12391;&#12398;&#12415;&#26377;&#21177;&#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#36578;&#36865;&#12377;&#12427;&#24773;&#22577;&#12434;&#29305;&#23450;&#12398;&#24418;&#24335;&#12395;&#22793;&#25563;&#12377;&#12427;&#12383;&#12417;&#12398;&#35336;&#31639;&#12398;&#36000;&#33655;&#12364;&#22823;&#12365;&#12356;&#22580;&#21512;&#12399;&#12289;&#22793;&#25563;&#12434;&#23455;&#34892;&#12377;&#12427;&#38306;&#25968;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#38306;&#25968;&#12399;&#12289;&#29305;&#23450;&#12398;&#24418;&#24335;&#12364;&#21463;&#20449;&#20596;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#35501;&#12415;&#21462;&#12425;&#12428;&#12383;&#22580;&#21512;&#12395;&#12398;&#12415;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>setDataHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#36933;&#24310;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#38306;&#25968;&#12434; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12489;&#12525;&#12483;&#12503;&#25805;&#20316;&#12364;&#34892;&#12431;&#12428;&#12427;&#21069;&#12395;&#12289;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12364;&#38306;&#25968;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12395;&#12489;&#12521;&#12483;&#12464;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12487;&#12540;&#12479;&#12434;&#25552;&#20379;&#12377;&#12427;&#22580;&#21512;&#12289;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12489;&#12521;&#12483;&#12464;&#12472;&#12455;&#12473;&#12481;&#12515;&#12364; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38626;&#12428;&#12427;&#12392;&#12377;&#12368;&#12395;&#12289;&#12487;&#12540;&#12479;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#32080;&#26524;&#12289;&#36890;&#24120;&#12399;&#12501;&#12449;&#12452;&#12523;&#12487;&#12540;&#12479;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#20013;&#12414;&#12383;&#12399;&#20316;&#25104;&#20013;&#12395;&#12289;&#20104;&#26399;&#12379;&#12378;&#20572;&#27490;&#12377;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#12377;&#12427;&#27880;&#24847;&#65306;</b>HTML &#12398;&#12489;&#12521;&#12483;&#12464;&#65286;&#12489;&#12525;&#12483;&#12503;&#12452;&#12505;&#12531;&#12488;&#12362;&#12424;&#12403;&#12467;&#12500;&#12540;&#65286;&#12506;&#12540;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;&#12395;&#23550;&#12375;&#12390;&#36865;&#20986;&#12373;&#12428;&#12427;&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#21442;&#29031;&#12373;&#12428;&#12427;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;AIR Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#21516;&#12376;&#12479;&#12452;&#12503;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;JavaScript &#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;AIR &#38283;&#30330;&#32773;&#12460;&#12452;&#12489;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>Flash Player &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#12377;&#12427;&#27880;&#24847;&#65306;</b>Flash Player 10 &#12391;&#12399;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12398;&#12506;&#12540;&#12473;&#12488;&#25805;&#20316;&#12395;&#12399;&#26368;&#21021;&#12395;&#12300;&#12506;&#12540;&#12473;&#12488;&#12301;&#12467;&#12510;&#12531;&#12489;&#12395;&#23550;&#24540;&#12377;&#12427;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12461;&#12540;&#12434;&#25276;&#12377;&#12363;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12398;&#12300;&#12506;&#12540;&#12473;&#12488;&#12301;&#12467;&#12510;&#12531;&#12489;&#12434;&#12510;&#12454;&#12473;&#12391;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12452;&#12505;&#12531;&#12488;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;<code>Clipboard.getData()</code> &#12399;&#12289;InteractiveObject &#12364; paste &#12452;&#12505;&#12531;&#12488;&#12434;&#21463;&#12369;&#21462;&#12426;&#12289;paste &#12452;&#12505;&#12531;&#12488;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#20182;&#12398;&#29872;&#22659;&#12391;&#12398; <code>Clipboard.getData()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12398;&#22806;&#37096;&#12395;&#12354;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12399; AIR &#12391;&#21516;&#12376;&#21046;&#38480;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p> &#13;
 &#13;
               <p>Linux &#12398;&#22580;&#21512;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#12487;&#12540;&#12479;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#32066;&#20102;&#12377;&#12427;&#12392;&#22833;&#12431;&#12428;&#12414;&#12377;&#12290;</p>&#13;
  &#13;
            <p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><p id="moreExamples"><span class="classHeaderTableLabel">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS88A6374C-1D6C-4faa-968C-5354C78587E2.html" target="_blank">&#12467;&#12500;&#12540;&#65286;&#12506;&#12540;&#12473;&#12488;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118666ade46-7e8a.html" target="_blank">AIR &#12391;&#12398;&#12489;&#12521;&#12483;&#12464;&#65286;&#12489;&#12525;&#12483;&#12503;</a></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="NativeDragManager.html" target="">flash.desktop.NativeDragManager</a><br /><a href="ClipboardFormats.html" target="">flash.desktop.ClipboardFormats</a><br /><a href="ClipboardTransferMode.html" target="">flash.desktop.ClipboardTransferMode</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#formats" class="signatureLink">formats</a> : <a href="../../Array.html">Array</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
	&#12371;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#12487;&#12540;&#12479;&#24418;&#24335;&#12398;&#21517;&#21069;&#12364;&#21547;&#12414;&#12428;&#12383;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#37197;&#21015;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr><tr class="" runtime="Flash::10##AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#generalClipboard" class="signatureLink">generalClipboard</a> : <a href="../../flash/desktop/Clipboard.html">Clipboard</a><div class="summaryTableDescription">[&#38745;&#30340;] [&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
	 &#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr><tr class="" runtime="AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#supportsFilePromise" class="signatureLink">supportsFilePromise</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
    &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12471;&#12473;&#12486;&#12512;&#12391;&#12501;&#12449;&#12452;&#12523;&#12503;&#12525;&#12511;&#12473;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#Clipboard()" class="signatureLink">Clipboard</a>()</div><div class="summaryTableDescription">&#13;
	&#31354;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr><tr class="" runtime="Flash::10##AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#clear()" class="signatureLink">clear</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	&#12371;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#34920;&#29694;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr><tr class="" runtime="Flash::10##AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#clearData()" class="signatureLink">clearData</a>(format:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#34920;&#29694;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr><tr class="" runtime="Flash::10##AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#getData()" class="signatureLink">getData</a>(format:<a href="../../String.html">String</a>, transferMode:<a href="../../String.html">String</a> = "originalPreferred"):<a href="../../Object.html">Object</a></div><div class="summaryTableDescription">&#13;
	&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12487;&#12540;&#12479;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr><tr class="" runtime="Flash::10##AIR::1.5##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#hasFormat()" class="signatureLink">hasFormat</a>(format:<a href="../../String.html">String</a>):<a href="../../Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
	&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12364;&#12371;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23384;&#22312;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr><tr class="" runtime="Flash::10##AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#setData()" class="signatureLink">setData</a>(format:<a href="../../String.html">String</a>, data:<a href="../../Object.html">Object</a>, serializable:<a href="../../Boolean.html">Boolean</a> = true):<a href="../../Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
	&#36578;&#36865;&#12377;&#12427;&#24773;&#22577;&#12398;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#24418;&#24335;&#12398;&#34920;&#29694;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr><tr class="" runtime="Flash::10##AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#setDataHandler()" class="signatureLink">setDataHandler</a>(format:<a href="../../String.html">String</a>, handler:<a href="../../Function.html">Function</a>, serializable:<a href="../../Boolean.html">Boolean</a> = true):<a href="../../Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
	&#36578;&#36865;&#29992;&#12398;&#12487;&#12540;&#12479;&#12434;&#29983;&#25104;&#12377;&#12427;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12395;&#21442;&#29031;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Clipboard</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.0##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/formats" class="dashAnchor" id="//apple_ref/cpp/Property/formats"></a><a name="formats" id="formats"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>formats</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>formats:<a href="../../Array.html">Array</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><p></p><p>&#13;
	&#12371;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#12487;&#12540;&#12479;&#24418;&#24335;&#12398;&#21517;&#21069;&#12364;&#21547;&#12414;&#12428;&#12383;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#37197;&#21015;&#12391;&#12377;&#12290;&#13;
	&#13;
	</p><p>ClipboardFormats &#12463;&#12521;&#12473;&#12395;&#27161;&#28310;&#24418;&#24335;&#12398;&#21517;&#21069;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#23450;&#25968;&#12364;&#23450;&#32681;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#20182;&#12398;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#12473;&#12488;&#12522;&#12531;&#12464;&#12399;&#12289;&#12487;&#12540;&#12479;&#12434;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#36578;&#36865;&#12377;&#12427;&#22580;&#21512;&#12289;&#24418;&#24335;&#21517;&#12392;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get formats():<a href="../../Array.html">Array</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="ClipboardFormats.html" target="">flash.desktop.ClipboardFormats</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398; <code>formats</code> &#37197;&#21015;&#12434;&#35501;&#12415;&#21462;&#12426;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 var availableFormats:Array = Clipboard.generalClipboard.formats;&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.0##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/generalClipboard" class="dashAnchor" id="//apple_ref/cpp/Property/generalClipboard"></a><a name="generalClipboard" id="generalClipboard"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>generalClipboard</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>generalClipboard:<a href="../../flash/desktop/Clipboard.html">Clipboard</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><p></p><p>&#13;
	 &#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12391;&#12377;&#12290;&#13;
	 &#13;
	 </p><p>&#12471;&#12473;&#12486;&#12512;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12395;&#12506;&#12540;&#12473;&#12488;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12399;&#12289;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#12418;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#12395;&#12399; Web &#12502;&#12521;&#12454;&#12470;&#12540;&#20869;&#12391;&#23455;&#34892;&#12373;&#12428;&#12427;&#20445;&#35703;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12522;&#12514;&#12540;&#12488;&#12467;&#12540;&#12489;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	 <p><b>&#27880;&#24847;&#65306;</b>Flash Player 10 &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12398;&#12506;&#12540;&#12473;&#12488;&#25805;&#20316;&#12395;&#12399;&#26368;&#21021;&#12395;&#12300;&#12506;&#12540;&#12473;&#12488;&#12301;&#12467;&#12510;&#12531;&#12489;&#12395;&#23550;&#24540;&#12377;&#12427;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12461;&#12540;&#12434;&#25276;&#12377;&#12363;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12398;&#12300;&#12506;&#12540;&#12473;&#12488;&#12301;&#12467;&#12510;&#12531;&#12489;&#12434;&#12510;&#12454;&#12473;&#12391;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12452;&#12505;&#12531;&#12488;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;<code>Clipboard.getData()</code> &#12399;&#12289;InteractiveObject &#12364; paste &#12452;&#12505;&#12531;&#12488;&#12434;&#21463;&#12369;&#21462;&#12426;&#12289;paste &#12452;&#12505;&#12531;&#12488;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#20182;&#12398;&#29872;&#22659;&#12391;&#12398; <code>Clipboard.getData()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12398;&#22806;&#37096;&#12395;&#12354;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12399; AIR &#12391;&#21516;&#12376;&#21046;&#38480;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	 <p><code>generalClipboard</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#33258;&#21205;&#30340;&#12395;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12399; Clipboard &#12398;&#21029;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;<code>getData()</code> &#12513;&#12477;&#12483;&#12489;&#12392; <code>setData()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#26082;&#23384;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12487;&#12540;&#12479;&#12398;&#35501;&#12415;&#26360;&#12365;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	 <p>&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12399;&#12289;&#26032;&#12375;&#12356;&#12487;&#12540;&#12479;&#12434;&#26360;&#12365;&#36796;&#12416;&#21069;&#12395;&#24517;&#12378;&#12463;&#12522;&#12450;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#24418;&#24335;&#12398;&#21476;&#12356;&#12487;&#12540;&#12479;&#12434;&#30906;&#23455;&#12395;&#28040;&#21435;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	 <p><code>generalClipboard</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; AIR NativeDragManager &#12395;&#28193;&#12377;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12398;&#12493;&#12452;&#12486;&#12451;&#12502;&#12394;&#12489;&#12521;&#12483;&#12464;&#65286;&#12489;&#12525;&#12483;&#12503;&#25805;&#20316;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#26032;&#12375;&#12356; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
	 &#13;
	 <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public static function get generalClipboard():<a href="../../flash/desktop/Clipboard.html">Clipboard</a></code><br /><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><div class="detailBody"> &#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12395;&#26360;&#12365;&#36796;&#12416;&#22580;&#21512;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 import flash.desktop.ClipboardFormats;&#13;
 &#13;
 var copy:String = "A string to copy to the system clipboard.";&#13;
 Clipboard.generalClipboard.clear();&#13;
 Clipboard.generalClipboard.setData(ClipboardFormats.TEXT_FORMAT, copy);&#13;
</pre></div></div></span><span id="pageFilter"><div class="detailBody"> &#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#35501;&#12415;&#21462;&#12427;&#22580;&#21512;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 import flash.desktop.ClipboardFormats;&#13;
 &#13;
 var pasteData:String  = Clipboard.generalClipboard.getData(ClipboardFormats.TEXT_FORMAT) as String;&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/supportsFilePromise" class="dashAnchor" id="//apple_ref/cpp/Property/supportsFilePromise"></a><a name="supportsFilePromise" id="supportsFilePromise"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>supportsFilePromise</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>supportsFilePromise:<a href="../../Boolean.html">Boolean</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2</td></tr></table><p></p><p></p><p>&#13;
    &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12471;&#12473;&#12486;&#12512;&#12391;&#12501;&#12449;&#12452;&#12523;&#12503;&#12525;&#12511;&#12473;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290; &#13;
    &#13;
    </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get supportsFilePromise():<a href="../../Boolean.html">Boolean</a></code><br /></div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.0##"><a name="//apple_ref/cpp/Constructor/Clipboard()" class="dashAnchor" id="//apple_ref/cpp/Constructor/Clipboard()"></a><a name="Clipboard()" id="Clipboard()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>Clipboard</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function Clipboard()</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><p>&#13;
	&#31354;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
	</p><p>Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12289;Adobe AIR &#12391;&#12398;&#12493;&#12452;&#12486;&#12451;&#12502;&#12394;&#12489;&#12521;&#12483;&#12464;&#65286;&#12489;&#12525;&#12483;&#12503;&#12472;&#12455;&#12473;&#12481;&#12515;&#12398;&#12487;&#12540;&#12479;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; 1 &#12388;&#12398;&#12489;&#12521;&#12483;&#12464;&#65286;&#12489;&#12525;&#12483;&#12503;&#12472;&#12455;&#12473;&#12481;&#12515;&#12395;&#12398;&#12415;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#20877;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>&#13;
	&#13;
	<p>&#12467;&#12500;&#12540;&#65286;&#12506;&#12540;&#12473;&#12488;&#25805;&#20316;&#29992;&#12395; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#20195;&#12431;&#12426;&#12395;&#21336;&#19968;&#12398; <code>Clipboard.generalClipboard</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
	&#13;
	<br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; Flash Player &#12391;&#12399;&#12289;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#12415;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12383;&#12417;&#12289;<code>new Clipboard()</code> &#12399;&#12289;Flash Player &#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12467;&#12500;&#12540;&#65286;&#12506;&#12540;&#12473;&#12488;&#25805;&#20316;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#26032;&#12375;&#12356;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#20195;&#12431;&#12426;&#12395; Clipboard.generalClipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12456;&#12521;&#12540;&#12399;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
	&#13;
	</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Clipboard.html#generalClipboard" target="">generalClipboard</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;NativeDragManager &#12463;&#12521;&#12473;&#12391;&#20351;&#29992;&#12377;&#12427;&#26032;&#12375;&#12356;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p><b>&#27880;&#24847;&#65306;</b>&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12467;&#12500;&#12540; &amp; &#12506;&#12540;&#12473;&#12488;&#25805;&#20316;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#26032;&#12375;&#12356;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#20195;&#12431;&#12426;&#12395; <code>Clipboard.generalClipboard</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 import flash.desktop.Clipboard;&#13;
 &#13;
 var clipboard:Clipboard = new Clipboard();&#13;
</pre></div></div></span></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.0##"><a name="//apple_ref/cpp/Method/clear()" class="dashAnchor" id="//apple_ref/cpp/Method/clear()"></a><a name="clear()" id="clear()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>clear</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function clear():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><p></p><p>&#13;
	&#12371;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#34920;&#29694;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
 	</p><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#12371;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;generalClipboard.clear() &#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;Flash Player &#12391;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#12289;&#12461;&#12540;&#20837;&#21147;&#12420;&#12510;&#12454;&#12473;&#12398;&#12463;&#12522;&#12483;&#12463;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12452;&#12505;&#12531;&#12488;&#12398;&#20966;&#29702;&#26178;&#12395;&#12398;&#12415;&#25104;&#21151;&#12375;&#12414;&#12377;&#12290;AIR &#12391;&#12399;&#12289;&#12371;&#12398;&#21046;&#38480;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#22806;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
  	</td></tr></table><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12434;&#12463;&#12522;&#12450;&#12375;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 Clipboard.generalClipboard.clear();&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.0##"><a name="//apple_ref/cpp/Method/clearData()" class="dashAnchor" id="//apple_ref/cpp/Method/clearData()"></a><a name="clearData()" id="clearData()"></a><a name="clearData(String)" id="clearData(String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>clearData</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function clearData(format:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><p></p><p>&#13;
	&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#34920;&#29694;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
 	</p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">format</span>:<a href="../../String.html">String</a></code> &#8212; &#21066;&#38500;&#12377;&#12427;&#12487;&#12540;&#12479;&#24418;&#24335;&#12391;&#12377;&#12290;&#13;
	</td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#12371;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;generalClipboard.clearData() &#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;Flash Player &#12391;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#12289;&#12461;&#12540;&#20837;&#21147;&#12420;&#12510;&#12454;&#12473;&#12398;&#12463;&#12522;&#12483;&#12463;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12452;&#12505;&#12531;&#12488;&#12398;&#20966;&#29702;&#26178;&#12395;&#12398;&#12415;&#25104;&#21151;&#12375;&#12414;&#12377;&#12290;AIR &#12391;&#12399;&#12289;&#12371;&#12398;&#21046;&#38480;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#22806;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	</td></tr></table><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12289;<code>ClipboardFormats.TEXT_FORMAT</code> &#24418;&#24335;&#12398;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12434;&#12463;&#12522;&#12450;&#12375;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 import flash.desktop.ClipboardFormats;&#13;
 &#13;
 Clipboard.generalClipboard.clearData(ClipboardFormats.TEXT_FORMAT);&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.0##"><a name="//apple_ref/cpp/Method/getData()" class="dashAnchor" id="//apple_ref/cpp/Method/getData()"></a><a name="getData()" id="getData()"></a><a name="getData(String,String)" id="getData(String,String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>getData</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function getData(format:<a href="../../String.html">String</a>, transferMode:<a href="../../String.html">String</a> = "originalPreferred"):<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><p></p><p>&#13;
	&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12487;&#12540;&#12479;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
	</p><p>Flash Player&#12391;&#12399;&#12289;<code>getData()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12399; <code>paste</code> &#12452;&#12505;&#12531;&#12488;&#12495;&#12531;&#12489;&#12521;&#12540;&#20869;&#12391;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;AIR &#12391;&#12399;&#12289;&#12371;&#12398;&#21046;&#38480;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#22806;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p>&#27161;&#28310;&#12398;&#12487;&#12540;&#12479;&#24418;&#24335;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12392;&#12289;&#23550;&#24540;&#12377;&#12427; Flash &#12487;&#12540;&#12479;&#12479;&#12452;&#12503;&#12398;&#26032;&#12375;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#12487;&#12540;&#12479;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#24418;&#24335;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#22580;&#21512;&#12289;<code>transferMode</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12395;&#12424;&#12387;&#12390;&#12289;&#20803;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12434;&#36820;&#12377;&#12363;&#12289;&#20803;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#30452;&#21015;&#21270;&#12373;&#12428;&#12383;&#12467;&#12500;&#12540;&#12364;&#26684;&#32013;&#12373;&#12428;&#12383;&#21311;&#21517;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36820;&#12377;&#12363;&#12364;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;<code>originalPreferred</code> &#12514;&#12540;&#12489;&#12414;&#12383;&#12399; <code>clonePreferred</code> &#12514;&#12540;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#36969;&#20999;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#20195;&#12431;&#12426;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;<code>originalOnly</code> &#12514;&#12540;&#12489;&#12414;&#12383;&#12399; <code>cloneOnly</code> &#12514;&#12540;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#35201;&#27714;&#12373;&#12428;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395; <code>null</code> &#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">format</span>:<a href="../../String.html">String</a></code> &#8212; &#36820;&#12377;&#12487;&#12540;&#12479;&#24418;&#24335;&#12391;&#12377;&#12290;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#12399;&#12289;ClipboardFormats &#12463;&#12521;&#12473;&#12395;&#23450;&#32681;&#12373;&#12428;&#12383;&#27161;&#28310;&#12398;&#21517;&#21069;&#12398;&#12356;&#12378;&#12428;&#12363;&#12289;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#21517;&#21069;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">transferMode</span>:<a href="../../String.html">String</a></code> (default = "<code>originalPreferred</code>")<code></code> &#8212; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#24418;&#24335;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;&#21442;&#29031;&#12414;&#12383;&#12399;&#30452;&#21015;&#21270;&#12373;&#12428;&#12383;&#12467;&#12500;&#12540;&#12434;&#36820;&#12377;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12289;ClipboardTransferMode &#12463;&#12521;&#12473;&#12395;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#21517;&#21069;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#27161;&#28310;&#12487;&#12540;&#12479;&#24418;&#24335;&#12391;&#12399;&#12289;&#12371;&#12398;&#20516;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12500;&#12540;&#12399;&#24120;&#12395;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	</td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Object.html">Object</a></code> &#8212; &#12487;&#12540;&#12479;&#24418;&#24335;&#12395;&#23550;&#24540;&#12377;&#12427;&#12479;&#12452;&#12503;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
	&#13;
	</td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Error.html">Error</a> </code> &#8212; <code>transferMode</code> &#12399;&#12289;ClipboardTransferMode &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#21517;&#21069;&#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; &#35201;&#27714;&#12373;&#12428;&#12383; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12473;&#12467;&#12540;&#12503;&#20869;&#12395;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#65288;AIR &#12398;&#12415;&#65289;&#12290;&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#12371;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12398;&#35501;&#12415;&#21462;&#12426;&#12414;&#12383;&#12399;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#12399;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;Flash Player&#12391;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12399;<code>paste</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#20966;&#29702;&#26178;&#12395;&#12398;&#12415;&#25104;&#21151;&#12375;&#12414;&#12377;&#12290;AIR &#12391;&#12399;&#12289;&#12371;&#12398;&#21046;&#38480;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#22806;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	&#13;
	</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Clipboard.html#setData()" target="">setData()</a><br /><a href="ClipboardFormats.html" target="">flash.desktop.ClipboardFormats</a><br /><a href="ClipboardTransferMode.html" target="">flash.desktop.ClipboardTransferMode</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12486;&#12461;&#12473;&#12488;&#65288;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#65289;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 import flash.desktop.ClipboardFormats;&#13;
&#13;
 var pasteData:String = Clipboard.generalClipboard.getData(ClipboardFormats.TEXT_FORMAT) as String;&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##"><a name="//apple_ref/cpp/Method/hasFormat()" class="dashAnchor" id="//apple_ref/cpp/Method/hasFormat()"></a><a name="hasFormat()" id="hasFormat()"></a><a name="hasFormat(String)" id="hasFormat(String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>hasFormat</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function hasFormat(format:<a href="../../String.html">String</a>):<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p></p><p>&#13;
	&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12364;&#12371;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23384;&#22312;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
	</p><p>ClipboardFormats &#12463;&#12521;&#12473;&#12398;&#23450;&#25968;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#27161;&#28310;&#12398;&#24418;&#24335;&#21517;&#12434;&#21442;&#29031;&#12375;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">format</span>:<a href="../../String.html">String</a></code> &#8212; &#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#24418;&#24335;&#12398;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;&#13;
	</td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Boolean.html">Boolean</a></code> &#8212; &#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;<code>true</code> &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
	&#13;
	</td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; &#35201;&#27714;&#12373;&#12428;&#12383; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12473;&#12467;&#12540;&#12503;&#20869;&#12395;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#12371;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12398;&#35501;&#12415;&#21462;&#12426;&#12414;&#12383;&#12399;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#12399;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
	&#13;
	</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="ClipboardFormats.html" target="">flash.desktop.ClipboardFormats</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12434;&#35519;&#12409;&#12390;&#12289;&#12486;&#12461;&#12473;&#12488;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#21028;&#21029;&#12375;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
if(Clipboard.generalClipboard.hasFormat(ClipboardFormats.TEXT_FORMAT)){&#13;
    //do something &#13;
}&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.0##"><a name="//apple_ref/cpp/Method/setData()" class="dashAnchor" id="//apple_ref/cpp/Method/setData()"></a><a name="setData()" id="setData()"></a><a name="setData(String,Object,Boolean)" id="setData(String,Object,Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>setData</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function setData(format:<a href="../../String.html">String</a>, data:<a href="../../Object.html">Object</a>, serializable:<a href="../../Boolean.html">Boolean</a> = true):<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><p></p><p>&#13;
	&#36578;&#36865;&#12377;&#12427;&#24773;&#22577;&#12398;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#24418;&#24335;&#12398;&#34920;&#29694;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
	</p><p>Adobe AIR &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12391;&#12399;&#12289;&#12356;&#12388;&#12391;&#12418; <code>setData()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20182;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;&#12461;&#12540;&#20837;&#21147;&#12420;&#12510;&#12454;&#12473;&#12463;&#12522;&#12483;&#12463;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#25805;&#20316;&#12395;&#24540;&#31572;&#12377;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12289;<code>setData()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p>&#21516;&#12376;&#24773;&#22577;&#12398;&#21029;&#12398;&#34920;&#29694;&#12434;&#12289;&#30064;&#12394;&#12427;&#24418;&#24335;&#12391;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#20182;&#12398;&#22810;&#12367;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12418;&#12487;&#12540;&#12479;&#12434;&#21033;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12452;&#12513;&#12540;&#12472;&#32232;&#38598;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#29992;&#12398;&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12487;&#12540;&#12479;&#12289;URL &#12362;&#12424;&#12403;&#12493;&#12452;&#12486;&#12451;&#12502;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#36578;&#36865;&#29992;&#12398;&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12383; PNG &#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#12452;&#12513;&#12540;&#12472;&#12434;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p>data &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12395;&#36969;&#21512;&#12377;&#12427;&#12487;&#12540;&#12479;&#22411;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	<table class="innertable"><tr><th>&#24418;&#24335;</th><th>&#22411;</th><th>&#35500;&#26126;</th></tr><tr><td><code>ClipboardFormats.TEXT_FORMAT</code></td><td><code>String</code></td><td>&#12473;&#12488;&#12522;&#12531;&#12464;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;</td></tr><tr><td><code>ClipboardFormats.HTML_FORMAT</code></td><td><code>String</code></td><td>HTML &#12473;&#12488;&#12522;&#12531;&#12464;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;</td></tr><tr><td><code>ClipboardFormats.URL_FORMAT</code></td><td><code>String</code></td><td>URL &#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#65288;AIR &#12398;&#12415;&#65289;&#12290;</td></tr><tr><td><code>ClipboardFormats.RICH_TEXT_FORMAT</code></td><td><code>ByteArray</code></td><td>&#12522;&#12483;&#12481;&#12486;&#12461;&#12473;&#12488;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;</td></tr><tr><td><code>ClipboardFormats.BITMAP_FORMAT</code></td><td><code>BitmapData</code></td><td>&#12499;&#12483;&#12488;&#12510;&#12483;&#12503;&#12487;&#12540;&#12479;&#65288;AIR &#12398;&#12415;)</td></tr><tr><td><code>ClipboardFormats.FILE_LIST_FORMAT</code></td><td><code>File</code> &#12398;&#37197;&#21015;</td><td>&#12501;&#12449;&#12452;&#12523;&#12398;&#37197;&#21015;&#65288;AIR &#12398;&#12415;&#65289;</td></tr><tr><td>&#12459;&#12473;&#12479;&#12512;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#21517;</td><td>&#12377;&#12409;&#12390;</td><td>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#21442;&#29031;&#12362;&#12424;&#12403;&#30452;&#21015;&#21270;&#12373;&#12428;&#12383;&#12463;&#12525;&#12540;&#12531;&#12391;&#12377;&#12290;</td></tr></table><p>&#12459;&#12473;&#12479;&#12512;&#12398;&#24418;&#24335;&#21517;&#12398;&#20808;&#38957;&#12434; "air:" &#12414;&#12383;&#12399; "flash:" &#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12459;&#12473;&#12479;&#12512;&#12398;&#24418;&#24335;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12395;&#21517;&#21069;&#12364;&#31478;&#21512;&#12377;&#12427;&#12398;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID &#12420;&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12434;&#25509;&#38957;&#36766;&#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12390;&#12289;&#12300;com.example.applicationName.dataPacket&#12301;&#12398;&#12424;&#12358;&#12394;&#24418;&#24335;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38291;&#12391;&#36578;&#36865;&#12377;&#12427;&#22580;&#21512;&#12289;<code>serializable</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#12424;&#12387;&#12390;&#21442;&#29031;&#12392;&#12467;&#12500;&#12540;&#12398;&#20001;&#26041;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12398;&#12363;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12398;&#12415;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12398;&#12363;&#12364;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;<code>serializable</code> &#12434; <code>true</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#21442;&#29031;&#12392;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12500;&#12540;&#12398;&#20001;&#26041;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;<code>serializable</code> &#12434; <code>false</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#21442;&#29031;&#12398;&#12415;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#21442;&#29031;&#12399;&#12289;&#29694;&#22312;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12391;&#12398;&#12415;&#26377;&#21177;&#12391;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;<code>serializable</code> &#12364; <code>false</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12399;&#12289;&#20182;&#12398; Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12418;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12289;&#30446;&#30340;&#12398;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12392;&#12365;&#12395;&#36969;&#20999;&#12394;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#36578;&#36865;&#12514;&#12540;&#12489;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#21442;&#29031;&#12434;&#21462;&#24471;&#12377;&#12427;&#12363;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12500;&#12540;&#12434;&#21462;&#24471;&#12377;&#12427;&#12363;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p><b>&#27880;&#24847;&#65306;</b>&#27161;&#28310;&#24418;&#24335;&#12399;&#12289;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#22806;&#37096;&#12395;&#12487;&#12540;&#12479;&#12434;&#12506;&#12540;&#12473;&#12488;&#12414;&#12383;&#12399;&#12489;&#12521;&#12483;&#12464;&#12377;&#12427;&#22580;&#21512;&#12289;&#24120;&#12395;&#12493;&#12452;&#12486;&#12451;&#12502;&#24418;&#24335;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;<code>serializable</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12399;&#12289;Flash &#12505;&#12540;&#12473;&#20197;&#22806;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#27161;&#28310;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12398;&#20351;&#29992;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12414;&#12379;&#12435;&#12290;</p>&#13;
	&#13;
	<p>&#12354;&#12427;&#24418;&#24335;&#12391;&#12398;&#12487;&#12540;&#12479;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12434;&#36933;&#12425;&#12379;&#12427;&#12395;&#12399;&#12289;&#20195;&#12431;&#12426;&#12395; <code>setDataHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;<code>setData()</code> &#12513;&#12477;&#12483;&#12489;&#12392; <code>setDataHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#20001;&#26041;&#12434;&#20351;&#29992;&#12375;&#12390;&#21516;&#12376;&#24418;&#24335;&#21517;&#12391;&#12487;&#12540;&#12479;&#34920;&#29694;&#12434;&#36861;&#21152;&#12377;&#12427;&#12392;&#12289;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12399;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
	&#13;
	<p><b>&#27880;&#24847;&#65306;</b>Mac OS &#12391; <code>format</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395; <code>ClipboardFormats.URL_FORMAT</code> &#12434;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;URL &#12364;&#36578;&#36865;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;&#12381;&#12398; URL &#12364;&#26377;&#21177;&#12391;&#12354;&#12427;&#22580;&#21512;&#12395;&#38480;&#12425;&#12428;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#31354;&#12395;&#12394;&#12426;&#12414;&#12377;&#65288;<code>getData()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;<code>null</code> &#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#65289;&#12290;</p> &#13;
	&#13;
	<p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">format</span>:<a href="../../String.html">String</a></code> &#8212; &#12487;&#12540;&#12479;&#24418;&#24335;&#12391;&#12377;&#12290;&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">data</span>:<a href="../../Object.html">Object</a></code> &#8212; &#36861;&#21152;&#12377;&#12427;&#24773;&#22577;&#12391;&#12377;&#12290; &#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">serializable</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>true</code>)<code></code> &#8212; &#30452;&#21015;&#21270;&#65288;&#12362;&#12424;&#12403;&#38750;&#30452;&#21015;&#21270;&#65289;&#12364;&#21487;&#33021;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12399; <code>true</code> &#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
	</td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Boolean.html">Boolean</a></code> &#8212; &#12487;&#12540;&#12479;&#12364;&#27491;&#24120;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399; <code>true</code>&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399; <code>false</code> &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;Flash Player &#12391;&#12399;&#12289;<code>format</code> &#12364; ClipboardFormats &#12398;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12394;&#12356;&#12513;&#12531;&#12496;&#12540;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;<code>false</code> &#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#65288;Flash Player &#12391;&#12399;&#12289;<code>ClipboardFormats.URL_FORMAT</code>&#12289;<code>ClipboardFormats.FILE_LIST_FORMAT</code>&#12289;<code>ClipboardFormats.FILE_PROMISE_LIST_FORMAT</code> &#12414;&#12383;&#12399; <code>ClipboardFormats.BITMAP_FORMAT</code> &#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#65289;&#12290;&#13;
	&#13;
	</td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; &#35201;&#27714;&#12373;&#12428;&#12383; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12473;&#12467;&#12540;&#12503;&#20869;&#12395;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#65288;&#12371;&#12428;&#12399;&#12289;&#12489;&#12521;&#12483;&#12464;&#65286;&#12489;&#12525;&#12483;&#12503;&#25805;&#20316;&#12391;&#20316;&#25104;&#12373;&#12428;&#12383;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12391;&#12398;&#12415;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#65289;&#12290;&#13;
	&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#12371;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12398;&#35501;&#12415;&#21462;&#12426;&#12414;&#12383;&#12399;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#12399;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;Flash Player &#12391;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#12289;&#12461;&#12540;&#20837;&#21147;&#12420;&#12510;&#12454;&#12473;&#12398;&#12463;&#12522;&#12483;&#12463;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12452;&#12505;&#12531;&#12488;&#12398;&#20966;&#29702;&#26178;&#12395;&#12398;&#12415;&#25104;&#21151;&#12375;&#12414;&#12377;&#12290;AIR &#12391;&#12399;&#12289;&#12371;&#12398;&#21046;&#38480;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#22806;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; <code>format</code> &#12414;&#12383;&#12399; <code>data</code> &#12399; <code>null</code> &#12391;&#12377;&#12290;&#13;
	&#13;
	</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Clipboard.html#setDataHandler()" target="">setDataHandler()</a><br /><a href="Clipboard.html#getData()" target="">getData()</a><br /><a href="ClipboardFormats.html" target="">flash.desktop.ClipboardFormats</a><br /><a href="ClipboardTransferMode.html" target="">flash.desktop.ClipboardTransferMode</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#12486;&#12461;&#12473;&#12488;&#24418;&#24335;&#12392; HTML &#24418;&#24335;&#12398;&#20001;&#26041;&#12391;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 import flash.desktop.ClipboardFormats;&#13;
 &#13;
 var htmlString:String = "&lt;html&gt;&lt;body&gt;Body content&lt;/body&gt;&lt;/html&gt;";&#13;
 Clipboard.generalClipboard.setData(ClipboardFormats.TEXT_FORMAT, urlString);&#13;
 Clipboard.generalClipboard.setData(ClipboardFormats.HTML_FORMAT, urlString);&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.0##"><a name="//apple_ref/cpp/Method/setDataHandler()" class="dashAnchor" id="//apple_ref/cpp/Method/setDataHandler()"></a><a name="setDataHandler()" id="setDataHandler()"></a><a name="setDataHandler(String,Function,Boolean)" id="setDataHandler(String,Function,Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>setDataHandler</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function setDataHandler(format:<a href="../../String.html">String</a>, handler:<a href="../../Function.html">Function</a>, serializable:<a href="../../Boolean.html">Boolean</a> = true):<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.0</td></tr></table><p></p><p></p><p>&#13;
	&#36578;&#36865;&#29992;&#12398;&#12487;&#12540;&#12479;&#12434;&#29983;&#25104;&#12377;&#12427;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12395;&#21442;&#29031;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#13;
	&#13;
	</p><p>&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#23455;&#38555;&#12395;&#12487;&#12540;&#12479;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12414;&#12391;&#12289;&#12487;&#12540;&#12479;&#12398;&#20316;&#25104;&#12414;&#12383;&#12399;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12434;&#36933;&#12425;&#12379;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p>&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12399;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12395;&#36969;&#21512;&#12377;&#12427;&#12487;&#12540;&#12479;&#22411;&#12434;&#36820;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	<table class="innertable"><tr><th>&#24418;&#24335;</th><th>&#36820;&#12377;&#22411;</th></tr><tr><td><code>ClipboardFormats.TEXT_FORMAT</code></td><td><code>String</code></td></tr><tr><td><code>ClipboardFormats.HTML_FORMAT</code></td><td><code>String</code></td></tr><tr><td><code>ClipboardFormats.URL_FORMAT</code></td><td><code>String</code>&#65288;AIR &#12398;&#12415;&#65289;</td></tr><tr><td><code>ClipboardFormats.RICH_TEXT_FORMAT</code></td><td><code>ByteArray</code></td></tr><tr><td><code>ClipboardFormats.BITMAP_FORMAT</code></td><td><code>BitmapData</code>&#65288;AIR &#12398;&#12415;&#65289;</td></tr><tr><td><code>ClipboardFormats.FILE_LIST_FORMAT</code></td><td><code>File</code> &#12398;&#37197;&#21015;&#65288;AIR &#12398;&#12415;&#65289;</td></tr><tr><td><code>ClipboardFormats.FILE_PROMISE_LIST_FORMAT</code></td><td><code>File</code> &#12398;&#37197;&#21015;&#65288;AIR &#12398;&#12415;&#65289;</td></tr><tr><td>&#12459;&#12473;&#12479;&#12512;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#21517;</td><td>void &#20197;&#22806;</td></tr></table><p>&#25351;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12398;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#21462;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12289;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12489;&#12525;&#12483;&#12503;&#25805;&#20316;&#12364;&#34892;&#12431;&#12428;&#12427;&#21069;&#12395;&#12289;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12364;&#38306;&#25968;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12395;&#12489;&#12521;&#12483;&#12464;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12487;&#12540;&#12479;&#12434;&#25552;&#20379;&#12377;&#12427;&#22580;&#21512;&#12289;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12489;&#12521;&#12483;&#12464;&#12472;&#12455;&#12473;&#12481;&#12515;&#12364; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38626;&#12428;&#12427;&#12392;&#12377;&#12368;&#12395;&#12289;&#12487;&#12540;&#12479;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#32080;&#26524;&#12289;&#36890;&#24120;&#12399;&#12501;&#12449;&#12452;&#12523;&#12487;&#12540;&#12479;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#20013;&#12414;&#12383;&#12399;&#20316;&#25104;&#20013;&#12395;&#12289;&#20104;&#26399;&#12379;&#12378;&#20572;&#27490;&#12377;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#30446;&#30340;&#12391;&#12399;&#12289;URLFilePromise &#12434;&#20195;&#12431;&#12426;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	<p>&#22522;&#12395;&#12394;&#12427;&#12487;&#12540;&#12479;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12381;&#12398;&#12487;&#12540;&#12479;&#12434;&#20445;&#35703;&#12377;&#12427;&#25163;&#38918;&#12434;&#23455;&#34892;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#12495;&#12531;&#12489;&#12521;&#12540;&#12434;&#36861;&#21152;&#12375;&#12383;&#26178;&#28857;&#12363;&#12425;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#21462;&#12427;&#26178;&#28857;&#12414;&#12391;&#12398;&#38291;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12395;&#12424;&#12387;&#12390;&#34920;&#12373;&#12428;&#12427;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#19978;&#12398;&#12487;&#12540;&#12479;&#12364;&#35079;&#25968;&#22238;&#35501;&#12415;&#21462;&#12425;&#12428;&#12383;&#22580;&#21512;&#12398;&#21205;&#20316;&#12399;&#20445;&#35388;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12399;&#12289;&#26368;&#21021;&#12398;&#38306;&#25968;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12387;&#12390;&#20316;&#25104;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12364;&#36820;&#12373;&#12428;&#12427;&#22580;&#21512;&#12418;&#12354;&#12428;&#12400;&#12289;&#38306;&#25968;&#12364;&#20877;&#24230;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12356;&#12378;&#12428;&#12398;&#21205;&#20316;&#12395;&#12418;&#20381;&#23384;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
	&#13;
	&#13;
	<p>Adobe AIR &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12391;&#12399;&#12289;&#12356;&#12388;&#12391;&#12418; <code>setDataHandler()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20182;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;&#12461;&#12540;&#20837;&#21147;&#12420;&#12510;&#12454;&#12473;&#12463;&#12522;&#12483;&#12463;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#25805;&#20316;&#12395;&#24540;&#31572;&#12377;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12289;<code>setDataHandler()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<p>&#12371;&#12398; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12487;&#12540;&#12479;&#12434;&#30452;&#25509;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#20195;&#12431;&#12426;&#12395; <code>setData()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#21516;&#12376;&#24418;&#24335;&#21517;&#12434;&#20351;&#29992;&#12375;&#12390; <code>setData()</code> &#12513;&#12477;&#12483;&#12489;&#12392; <code>setDataHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#20001;&#26041;&#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12399;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
	&#13;
	<p><b>&#27880;&#24847;&#65306;</b>Mac OS &#12391; <code>format</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395; <code>ClipboardFormats.URL_FORMAT</code> &#12434;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;URL &#12364;&#36578;&#36865;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#12364;&#26377;&#21177;&#12394; URL &#12434;&#36820;&#12377;&#22580;&#21512;&#12395;&#38480;&#12425;&#12428;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#31354;&#12395;&#12394;&#12426;&#12414;&#12377;&#65288;<code>getData()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;<code>null</code> &#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#65289;&#12290;</p>&#13;
	&#13;
	<p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">format</span>:<a href="../../String.html">String</a></code> &#8212; &#36578;&#36865;&#12377;&#12427;&#12487;&#12540;&#12479;&#12434;&#36820;&#12377;&#38306;&#25968;&#12391;&#12377;&#12290;&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">handler</span>:<a href="../../Function.html">Function</a></code> &#8212; &#12487;&#12540;&#12479;&#24418;&#24335;&#12391;&#12377;&#12290; &#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">serializable</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>true</code>)<code></code> &#8212; <code>true</code> &#12434;&#25351;&#23450;&#12377;&#12427;&#12398;&#12399;&#12289;<code>handler</code> &#12391;&#36820;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#30452;&#21015;&#21270;&#65288;&#12362;&#12424;&#12403;&#38750;&#30452;&#21015;&#21270;&#65289;&#12391;&#12365;&#12427;&#22580;&#21512;&#12391;&#12377;&#12290;&#13;
	&#13;
	</td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Boolean.html">Boolean</a></code> &#8212; &#12495;&#12531;&#12489;&#12521;&#12540;&#12364;&#27491;&#24120;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399; <code>true</code>&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399; <code>false</code> &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
	&#13;
	</td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; <code>format</code> &#12414;&#12383;&#12399; <code>handler</code> &#12399; <code>null</code> &#12391;&#12377;&#12290;&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; &#35201;&#27714;&#12373;&#12428;&#12383; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12473;&#12467;&#12540;&#12503;&#20869;&#12395;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#65288;AIR &#12398;&#12415;&#65289;&#12290;&#13;
	</td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#12371;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#12399;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12363;&#12425;&#12398;&#35501;&#12415;&#21462;&#12426;&#12414;&#12383;&#12399;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#12399;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;Flash Player &#12391;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#12289;&#12461;&#12540;&#20837;&#21147;&#12420;&#12510;&#12454;&#12473;&#12398;&#12463;&#12522;&#12483;&#12463;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12452;&#12505;&#12531;&#12488;&#12398;&#20966;&#29702;&#26178;&#12395;&#12398;&#12415;&#25104;&#21151;&#12375;&#12414;&#12377;&#12290;AIR &#12391;&#12399;&#12289;&#12371;&#12398;&#21046;&#38480;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#22806;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	&#13;
	</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Clipboard.html#setData()" target="">setData()</a><br /><a href="ClipboardFormats.html" target="">flash.desktop.ClipboardFormats</a><br />flash.desktop.URLFilePromise</div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#36933;&#24310;&#12487;&#12540;&#12479;&#38306;&#25968;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12395;&#20081;&#25968;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 import flash.desktop.ClipboardFormats;&#13;
 &#13;
 Clipboard.generalClipboard.setDataHandler(ClipboardFormats.TEXT_FORMAT, randomNumberGenerator);&#13;
&#13;
 public function randomNumberGenerator():String{&#13;
     return Math.random().toString();&#13;
 }&#13;
</pre></div></div></span></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">ClipboardExample.as</div><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;ClipboardExample &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12354;&#12427;&#22793;&#25968;&#12363;&#12425;&#21029;&#12398;&#22793;&#25968;&#12395;&#12471;&#12473;&#12486;&#12512;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12434;&#20171;&#12375;&#12390;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#65288;Adobe AIR &#12398;&#22580;&#21512;&#65289;&#12290;&#12371;&#12428;&#12434;&#34892;&#12358;&#12395;&#12399;&#12289;&#20197;&#19979;&#12398;&#25163;&#38918;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
 <ol><li>&#12487;&#12540;&#12479;&#65288;&#12371;&#12398;&#20363;&#12391;&#12399;&#12473;&#12488;&#12522;&#12531;&#12464;&#65289;&#12434; <code>Clipboard.generalClipboard</code> &#12395;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12290;</li><li><code>Clipboard.generalClipboard</code> &#12363;&#12425;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#23450;&#25968;&#12434;&#35501;&#12415;&#21462;&#12426;&#12414;&#12377;&#12290;</li></ol><p><b>&#27880;&#24847;&#65306;</b>&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#12487;&#12540;&#12479;&#12450;&#12463;&#12475;&#12473;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#21046;&#38480;&#12395;&#12424;&#12426;&#12289;&#12371;&#12398;&#20363;&#12399; Flash Player &#12391;&#12399;&#27231;&#33021;&#12375;&#12414;&#12379;&#12435;&#12290;Flash Player &#12398;&#22580;&#21512;&#12289;<code>paste</code> &#12452;&#12505;&#12531;&#12488;&#12495;&#12531;&#12489;&#12521;&#12540;&#12391;&#12399; Clipboard &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>getData()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#12415;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
package&#13;
{&#13;
    import flash.display.Sprite;&#13;
    import flash.desktop.Clipboard;&#13;
    import flash.desktop.ClipboardFormats;&#13;
    import flash.desktop.ClipboardTransferMode;&#13;
&#13;
    public class ClipboardExample extends Sprite&#13;
    {&#13;
        public function ClipboardExample()&#13;
        {&#13;
            var sally:String = "Sally";&#13;
            var person:String;&#13;
            &#13;
            copy(sally);&#13;
            person = paste();&#13;
            trace(person); //traces: "Sally"&#13;
        }&#13;
&#13;
        private function copy(text:String):void &#13;
        {&#13;
            Clipboard.generalClipboard.clear();&#13;
            Clipboard.generalClipboard.setData(ClipboardFormats.TEXT_FORMAT, text);&#13;
        }&#13;
        &#13;
        private function paste():String&#13;
        {&#13;
            if(Clipboard.generalClipboard.hasFormat(ClipboardFormats.TEXT_FORMAT))&#13;
            {&#13;
                return String(Clipboard.generalClipboard.getData(ClipboardFormats.TEXT_FORMAT));&#13;
            } &#13;
            else &#13;
            {&#13;
                return null;&#13;
            }&#13;
        }&#13;
        &#13;
    }&#13;
}&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>