<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:10" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:1.5" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:10" /><meta name="product" content="air" /><meta name="productver" content="air:1.5" /><meta name="product" content="osmf" /><meta name="prodver" content="osmf:1.0" /><link rel="stylesheet" href="../../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../../override.css" type="text/css" /><link rel="stylesheet" href="../../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../../ion.css" type="text/css" /><meta name="keywords" content="ParallelElement,org.osmf.elements.ParallelElement" /><title>ParallelElement - Adobe ActionScript&#174; 3&#65288;AS3  OSMF&#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">org.osmf.elements</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  ParallelElement</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">ParallelElement  <img src="../../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../../org/osmf/elements/CompositeElement.html">CompositeElement</a> <img src="../../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../../org/osmf/media/MediaElement.html">MediaElement</a> <img src="../../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>OSMF 1.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
	 ParallelElement &#12399;&#12513;&#12487;&#12451;&#12450;&#12467;&#12531;&#12509;&#12472;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;ParallelElement &#12395;&#21547;&#12414;&#12428;&#12427;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#20006;&#21015;&#30340;&#65288;&#21516;&#26178;&#65289;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 &#13;
	 <p>ParallelElement &#12434;&#27083;&#25104;&#12377;&#12427;&#12513;&#12487;&#12451;&#12450;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#32113;&#21512;&#12373;&#12428;&#12383; 1 &#12388;&#12398;&#12513;&#12487;&#12451;&#12450;&#12456;&#12524;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ParallelElement &#12395;&#12452;&#12513;&#12540;&#12472;&#12392;&#12458;&#12540;&#12487;&#12451;&#12458;&#12364;&#12459;&#12503;&#12475;&#12523;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;ParallelElement &#12399;&#12458;&#12540;&#12487;&#12451;&#12458;&#12501;&#12449;&#12452;&#12523;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#29305;&#24615;&#12392;&#12452;&#12513;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12398;&#34920;&#31034;&#29305;&#24615;&#12434;&#25345;&#12388;&#21336;&#19968;&#12398; MediaElement &#12398;&#12424;&#12358;&#12395;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	              <p>&#36890;&#24120;&#12289;ParallelElement &#12398;&#29305;&#24615;&#12399;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12289;&#12388;&#12414;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398;&#29305;&#24615;&#12434;&#32113;&#21512;&#12375;&#12383;&#12418;&#12398;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#26032;&#12375;&#12356;&#12513;&#12487;&#12451;&#12450;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#12513;&#12487;&#12451;&#12450;&#12467;&#12531;&#12509;&#12472;&#12471;&#12519;&#12531;&#12398;&#23376;&#12392;&#12375;&#12390;&#36861;&#21152;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12513;&#12487;&#12451;&#12450;&#12467;&#12531;&#12509;&#12472;&#12471;&#12519;&#12531;&#12392;&#23376;&#12398;&#29305;&#24615;&#12364;&#25972;&#21512;&#12377;&#12427;&#12424;&#12358;&#12395;&#12289;&#36861;&#21152;&#12375;&#12383;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#29305;&#24615;&#12414;&#12383;&#12399;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12398;&#29305;&#24615;&#12364;&#35519;&#25972;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	              <p> &#26368;&#21021;&#12398;&#12465;&#12540;&#12473;&#12398;&#20363;&#12392;&#12375;&#12390;&#12289;AudioTrait &#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;AudioTrait &#12508;&#12522;&#12517;&#12540;&#12512;&#12364; 0.5 &#12398;&#26032;&#12375;&#12356; MediaElement &#12434;&#12289;AudioTrait &#12508;&#12522;&#12517;&#12540;&#12512;&#12364; 0.3 &#12398; ParallelElement &#12395;&#36861;&#21152;&#12375;&#12383;&#22580;&#21512;&#12289;ParallelElement &#12398;&#29305;&#24615;&#12392;&#25972;&#21512;&#12377;&#12427;&#12424;&#12358;&#12395;&#12289;&#36861;&#21152;&#12375;&#12383;&#23376; MediaElement &#12398; AudioTrait &#12508;&#12522;&#12517;&#12540;&#12512;&#12364; 0.3 &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	              <p>&#12418;&#12358;&#19968;&#26041;&#12398;&#12465;&#12540;&#12473;&#12398;&#20363;&#12392;&#12375;&#12390;&#12289;BufferTrait &#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;&#36861;&#21152;&#12375;&#12383; MediaElement &#12395; BufferTrait &#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12371;&#12398; MediaElement &#12398;&#12496;&#12483;&#12501;&#12449;&#12540;&#12469;&#12452;&#12474;&#12364;&#20182;&#12398;&#12393;&#12398;&#23376;&#12424;&#12426;&#12418;&#22823;&#12365;&#12356;&#22580;&#21512;&#12399;&#12289;ParallelElement &#12398; BufferTrait &#12434;&#22679;&#21152;&#12373;&#12379;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;ParallelElement &#12398;&#12496;&#12483;&#12501;&#12449;&#12540;&#12364;&#26032;&#12375;&#12356;&#23376;&#12398;&#12469;&#12452;&#12474;&#12395;&#35519;&#25972;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 </p>&#13;
	 &#13;
	 &#20006;&#21015;&#26178;&#12395;&#21508;&#29305;&#24615;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#34920;&#29694;&#12373;&#12428;&#12427;&#12363;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;&#13;
	 <ul><li>&#13;
	 AudioTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398; audible &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;1 &#12388;&#12398;&#23376;&#12456;&#12524;&#12513;&#12531;&#12488;&#65288;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12398;&#12508;&#12522;&#12517;&#12540;&#12512;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#38899;&#12434;&#30330;&#29983;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#23376;&#65288;&#12362;&#12424;&#12403;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#65289;&#12395;&#12388;&#12356;&#12390;&#12418;&#12508;&#12522;&#12517;&#12540;&#12512;&#12364;&#21516;&#27096;&#12395;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 </li>&#13;
                  <li>&#13;
	 BufferTrait - &#12356;&#12378;&#12428;&#12363;&#12398;&#23376;&#12391;&#12496;&#12483;&#12501;&#12449;&#12522;&#12531;&#12464;&#12434;&#34892;&#12358;&#22580;&#21512;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12418;&#12496;&#12483;&#12501;&#12449;&#12522;&#12531;&#12464;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12496;&#12483;&#12501;&#12449;&#12540;&#12398;&#38263;&#12373;&#12392;&#12469;&#12452;&#12474;&#12399;&#12289;&#26368;&#12418;&#38263;&#12356;&#12496;&#12483;&#12501;&#12449;&#12540;&#12434;&#25345;&#12388;&#23376;&#12398;&#38263;&#12373;&#12392;&#12469;&#12452;&#12474;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#38283;&#22987;&#20301;&#32622;&#12399;&#12289;&#23376;&#12398;&#20013;&#12391;&#26368;&#23567;&#12398;&#65288;&#26368;&#12418;&#26089;&#12356;&#65289;&#38283;&#22987;&#20301;&#32622;&#12434;&#25345;&#12388;&#23376;&#12398;&#38283;&#22987;&#20301;&#32622;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 </li>&#13;
                  <li>&#13;
	 DisplayObjectTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12398;&#23376;&#12398;&#20013;&#12395; DisplayObjectTrait &#12434;&#25345;&#12388;&#23376;&#12364; 1 &#12388;&#20197;&#19978;&#12354;&#12427;&#22580;&#21512;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12398;&#31354;&#38291;&#30340;&#12394;&#12469;&#12452;&#12474;&#12399; DisplayObject &#12398;&#22659;&#30028;&#12508;&#12483;&#12463;&#12473;&#12395;&#12424;&#12387;&#12390;&#23450;&#32681;&#12373;&#12428;&#12414;&#12377;&#12290;DisplayObject &#12399;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12398; DisplayObjectTrait &#12398;<code>displayObject</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#21442;&#29031;&#12373;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12395; DisplayObjectTrait &#12434;&#25345;&#12388;&#23376;&#12364; 1 &#12388;&#12418;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12398; <code>mediaWidth</code> &#12399;&#26368;&#12418;&#24133;&#12398;&#24195;&#12356;&#23376;&#12398;&#24133;&#12395;&#12289;<code>mediaHeight</code> &#12399;&#26368;&#12418;&#39640;&#12373;&#12398;&#39640;&#12356;&#23376;&#12398;&#39640;&#12373;&#12395;&#12381;&#12428;&#12382;&#12428;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 </li>&#13;
                  <li>&#13;
	 DRMTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398; DRM &#12398;&#29366;&#24907;&#12434;&#19968;&#33268;&#12373;&#12379;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;1 &#12388;&#12398;&#23376;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#35469;&#35388;&#12373;&#12428;&#12427;&#12392;&#12289;DRM &#12364;&#26377;&#21177;&#12391;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#23376;&#12364;&#21516;&#26178;&#12395;&#35469;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 </li>&#13;
                  <li>&#13;
	 DVRTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398; DVR &#12398;&#29366;&#24907;&#12434;&#19968;&#33268;&#12373;&#12379;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;&#13;
	 </li>&#13;
                  <li>&#13;
	 DynamicStreamTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398;&#12480;&#12452;&#12490;&#12511;&#12483;&#12463;&#12473;&#12488;&#12522;&#12540;&#12511;&#12531;&#12464;&#12398;&#29366;&#24907;&#12434;&#19968;&#33268;&#12373;&#12379;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;&#29305;&#12395; <code>autoSwitch</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#12289;&#12414;&#12383;&#12289;&#21516;&#12376;&#12499;&#12483;&#12488;&#12524;&#12540;&#12488;&#31684;&#22258;&#20869;&#12398;&#29694;&#22312;&#12398;&#12473;&#12488;&#12522;&#12540;&#12512;&#12450;&#12452;&#12486;&#12512;&#12391;&#19968;&#33268;&#12364;&#22259;&#12425;&#12428;&#12414;&#12377;&#12290;&#13;
	 </li>&#13;
                  <li>&#13;
	 LoadTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398;&#12525;&#12540;&#12489;&#29366;&#24907;&#12434;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;1 &#12388;&#12398;&#23376;&#12456;&#12524;&#12513;&#12531;&#12488;&#65288;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12392;&#12289;&#12525;&#12540;&#12489;&#21487;&#33021;&#12394;&#12377;&#12409;&#12390;&#12398;&#23376;&#65288;&#12362;&#12424;&#12403;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12364;&#21516;&#26178;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 </li>&#13;
                  <li>&#13;
	 PlayTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398;&#19968;&#26178;&#20572;&#27490;&#12392;&#20877;&#29983;&#12398;&#29366;&#24907;&#12434;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;1 &#12388;&#12398;&#23376;&#12456;&#12524;&#12513;&#12531;&#12488;&#65288;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12364;&#19968;&#26178;&#20572;&#27490;&#12373;&#12428;&#12427;&#12392;&#12289;&#19968;&#26178;&#20572;&#27490;&#21487;&#33021;&#12394;&#12377;&#12409;&#12390;&#12398;&#23376;&#65288;&#12362;&#12424;&#12403;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12364;&#21516;&#26178;&#12395;&#19968;&#26178;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;1 &#12388;&#12398;&#23376;&#12456;&#12524;&#12513;&#12531;&#12488;&#65288;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12364;&#20877;&#29983;&#12373;&#12428;&#12427;&#12392;&#12289;&#20877;&#29983;&#21487;&#33021;&#12394;&#12377;&#12409;&#12390;&#12398;&#23376;&#65288;&#12362;&#12424;&#12403;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12364;&#21516;&#26178;&#12395;&#20877;&#29983;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 </li>&#13;
                  <li>&#13;
	 SeekTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398;&#12471;&#12540;&#12463;&#29366;&#24907;&#12434;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;1 &#12388;&#12398;&#23376;&#12456;&#12524;&#12513;&#12531;&#12488;&#65288;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12391;&#12471;&#12540;&#12463;&#12434;&#34892;&#12358;&#12392;&#12289;&#12471;&#12540;&#12463;&#21487;&#33021;&#12394;&#12377;&#12409;&#12390;&#12398;&#23376;&#65288;&#12362;&#12424;&#12403;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#65289;&#12391;&#21516;&#27096;&#12398;&#12471;&#12540;&#12463;&#12364;&#21516;&#26178;&#12395;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290; &#13;
	 </li>&#13;
                  <li>&#13;
	 TimeTrait - &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#29305;&#24615;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398;&#12479;&#12452;&#12512;&#12521;&#12452;&#12531;&#12434;&#12459;&#12503;&#12475;&#12523;&#21270;&#12375;&#12383;&#12479;&#12452;&#12512;&#12521;&#12452;&#12531;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#23376;&#12398;&#26368;&#22823;&#32153;&#32154;&#26178;&#38291;&#12364;&#12289;&#32153;&#32154;&#26178;&#38291;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#23376;&#12395;&#12388;&#12356;&#12390;&#20301;&#32622;&#12398;&#19968;&#33268;&#12364;&#22259;&#12425;&#12428;&#12414;&#12377;&#12364;&#12289;&#23376;&#12398;&#20301;&#32622;&#12364;&#12381;&#12398;&#32153;&#32154;&#26178;&#38291;&#12434;&#36229;&#12360;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#13;
	 </li>&#13;
               </ul><p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProperty" id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="OSMF::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#ParallelElement()" class="signatureLink">ParallelElement</a>()</div><div class="summaryTableDescription">&#13;
		 &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">ParallelElement</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="protectedMethodSummary" id="protectedMethodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12503;&#12525;&#12486;&#12463;&#12488;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProtectedMethod" id="summaryTableProtectedMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedEvent" id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="OSMF::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../org/osmf/media/MediaElement.html#event:containerChange" class="signatureLink">containerChange</a></div></td><td class="summaryTableDescription summaryTableCol">&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12467;&#12531;&#12486;&#12490;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../org/osmf/media/MediaElement.html">MediaElement</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="OSMF::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../org/osmf/media/MediaElement.html#event:mediaError" class="signatureLink">mediaError</a></div></td><td class="summaryTableDescription summaryTableCol">&#12513;&#12487;&#12451;&#12450;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#25805;&#20316;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../org/osmf/media/MediaElement.html">MediaElement</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="OSMF::2.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../org/osmf/media/MediaElement.html#event:mediaInfo" class="signatureLink">mediaInfo</a></div></td><td class="summaryTableDescription summaryTableCol">&#12513;&#12487;&#12451;&#12450;&#35201;&#32032;&#12398;&#25805;&#20316;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#24773;&#22577;&#12364;&#25552;&#20379;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../org/osmf/media/MediaElement.html">MediaElement</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="OSMF::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../org/osmf/media/MediaElement.html#event:metadataAdd" class="signatureLink">metadataAdd</a></div></td><td class="summaryTableDescription summaryTableCol">Metadata &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12371;&#12398;&#12513;&#12487;&#12451;&#12450;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../org/osmf/media/MediaElement.html">MediaElement</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="OSMF::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../org/osmf/media/MediaElement.html#event:metadataRemove" class="signatureLink">metadataRemove</a></div></td><td class="summaryTableDescription summaryTableCol">Metadata &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12371;&#12398;&#12513;&#12487;&#12451;&#12450;&#12456;&#12524;&#12513;&#12531;&#12488;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../org/osmf/media/MediaElement.html">MediaElement</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="OSMF::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../org/osmf/media/MediaElement.html#event:traitAdd" class="signatureLink">traitAdd</a></div></td><td class="summaryTableDescription summaryTableCol">&#29305;&#24615;&#12364;&#12513;&#12487;&#12451;&#12450;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../org/osmf/media/MediaElement.html">MediaElement</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##" product="OSMF::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../../org/osmf/media/MediaElement.html#event:traitRemove" class="signatureLink">traitRemove</a></div></td><td class="summaryTableDescription summaryTableCol">&#29305;&#24615;&#12364;&#12513;&#12487;&#12451;&#12450;&#12456;&#12524;&#12513;&#12531;&#12488;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../../org/osmf/media/MediaElement.html">MediaElement</a></td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="OSMF::1.0##"><a name="//apple_ref/cpp/Constructor/ParallelElement()" class="dashAnchor" id="//apple_ref/cpp/Constructor/ParallelElement()"></a><a name="ParallelElement()" id="ParallelElement()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>ParallelElement</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function ParallelElement()</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>OSMF 1.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p>&#13;
		 &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;&#13;
		  &#13;
		  </p></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">ParallelElementExample.as</div><br /><div class="detailBody"><div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>package&#13;
{&#13;
    import flash.display.Sprite;&#13;
    import flash.display.StageAlign;&#13;
    import flash.display.StageScaleMode;&#13;
    &#13;
    import org.osmf.elements.LightweightVideoElement;&#13;
    import org.osmf.elements.ParallelElement;&#13;
    import org.osmf.elements.VideoElement;&#13;
    import org.osmf.layout.LayoutMetadata;&#13;
    import org.osmf.layout.LayoutMode;&#13;
    import org.osmf.media.MediaPlayer;&#13;
    import org.osmf.media.MediaPlayerSprite;&#13;
    import org.osmf.media.URLResource;&#13;
    &#13;
    public class ParallelElementExample extends Sprite&#13;
    {&#13;
        public function ParallelElementExample()&#13;
        {&#13;
            super();&#13;
            &#13;
            stage.scaleMode = StageScaleMode.NO_SCALE;&#13;
            stage.align = StageAlign.TOP_LEFT;&#13;
            &#13;
            var mediaPlayerSprite:MediaPlayerSprite = new MediaPlayerSprite();&#13;
            var parallelElement:ParallelElement = new ParallelElement();&#13;
                        &#13;
            var videoElement:LightweightVideoElement = new LightweightVideoElement();&#13;
            videoElement.resource = new URLResource("http://mediapm.edgesuite.net/strobe/content/test/AFaerysTale_sylviaApostol_640_500_short.flv");&#13;
            &#13;
            var videoElement2:LightweightVideoElement = new LightweightVideoElement();&#13;
            videoElement2.resource = new URLResource("http://mediapm.edgesuite.net/strobe/content/test/elephants_dream_768x428_24_short.flv");&#13;
                        &#13;
            parallelElement.addChild(videoElement);&#13;
            parallelElement.addChild(videoElement2);&#13;
            &#13;
            // Add a vertical layout&#13;
            var layout:LayoutMetadata = new LayoutMetadata();&#13;
            layout.layoutMode = LayoutMode.VERTICAL;&#13;
            parallelElement.addMetadata(LayoutMetadata.LAYOUT_NAMESPACE, layout);            &#13;
            &#13;
            addChild(mediaPlayerSprite);&#13;
            mediaPlayerSprite.media = parallelElement;    &#13;
            &#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>