<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:9" /><meta name="runtime" content="lite" /><meta name="runtimever" content="lite:4" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:9" /><meta name="product" content="lite" /><meta name="productver" content="lite:4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="LocalConnection,flash.net.LocalConnection,client,domain,isPerUser,isSupported,allowDomain,allowInsecureDomain,close,connect,send" /><title>LocalConnection - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.net</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  LocalConnection</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">LocalConnection  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
 LocalConnection &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#21029;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290; &#27425;&#12398;&#36890;&#20449;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;&#13;
 &#13;
 <ul><li>&#21336;&#19968;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#20869;&#12391;&#12398;&#36890;&#20449;</li>&#13;
                  <li>&#35079;&#25968;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#38291;&#12398;&#36890;&#20449;</li>&#13;
                  <li>AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;SWF &#12505;&#12540;&#12473;&#12414;&#12383;&#12399; HTML &#12505;&#12540;&#12473;&#65289;&#38291;&#12398;&#36890;&#20449;</li>&#13;
                  <li>AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;SWF &#12505;&#12540;&#12473;&#12414;&#12383;&#12399; HTML &#12505;&#12540;&#12473;&#65289;&#12392;&#12502;&#12521;&#12454;&#12470;&#12540;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427; SWF &#12467;&#12531;&#12486;&#12531;&#12484;&#38291;&#12398;&#36890;&#20449;</li>&#13;
               </ul><p>AIR &#12503;&#12525;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12509;&#12540;&#12488;&#65306;<i></i>&#12371;&#12398;&#27231;&#33021;&#12399;&#12377;&#12409;&#12390;&#12398;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12362;&#12424;&#12403;&#12377;&#12409;&#12390;&#12398;&#12486;&#12524;&#12499;&#29992; AIR &#12487;&#12496;&#12452;&#12473;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;&#12514;&#12496;&#12452;&#12523;&#12487;&#12496;&#12452;&#12473;&#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;<code>LocalConnection.isSupported</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#23455;&#34892;&#26178;&#12395;&#12486;&#12473;&#12488;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12503;&#12525;&#12501;&#12449;&#12452;&#12523;&#38291;&#12391;&#12398; API &#12469;&#12509;&#12540;&#12488;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;<a href="http://help.adobe.com/en_US/air/build/WS144092a96ffef7cc16ddeea2126bb46b82f-8000.html">AIR &#12503;&#12525;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12509;&#12540;&#12488;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#27880;&#24847;&#65306;</b>&#12486;&#12524;&#12499;&#29992; AIR &#12487;&#12496;&#12452;&#12473;&#12391;&#12399;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398; SWF &#12505;&#12540;&#12473;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#38291;&#12391;&#12398;&#12415;&#36890;&#20449;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12525;&#12540;&#12459;&#12523;&#25509;&#32154;&#12391;&#12399;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#38291;&#12398;&#12371;&#12398;&#31278;&#12398;&#36890;&#20449;&#12399; <code>fscommand()</code> &#12414;&#12383;&#12399; JavaScript &#12434;&#20351;&#29992;&#12375;&#12394;&#12367;&#12390;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#12387;&#12390;&#36890;&#20449;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#21516;&#12376;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#19978;&#12391;&#23455;&#34892;&#20013;&#12398;&#12501;&#12449;&#12452;&#12523;&#38291;&#12384;&#12369;&#12391;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12371;&#12428;&#12425;&#12399;&#30064;&#12394;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;&#20363;&#12360;&#12400;&#12289;&#12502;&#12521;&#12454;&#12470;&#12540;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#12392;&#12289;Adobe AIR &#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12392;&#12398;&#38291;&#12391;&#36890;&#20449;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; </p>&#13;
 &#13;
               <p>ActionScript 3.0 &#12391;&#20316;&#25104;&#12373;&#12428;&#12383; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;ActionScript 1.0 &#12414;&#12383;&#12399; 2.0 &#12391;&#20316;&#25104;&#12373;&#12428;&#12383; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#36890;&#20449;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12381;&#12398;&#36870;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;ActionScript 1.0 &#12414;&#12383;&#12399; 2.0 &#12391;&#20316;&#25104;&#12373;&#12428;&#12383; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;ActionScript 3.0 &#12391;&#20316;&#25104;&#12373;&#12428;&#12383; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#36890;&#20449;&#12391;&#12365;&#12414;&#12377;&#12290;Flasn Player &#12391;&#12399;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#30064;&#12394;&#12427; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#38291;&#12398;&#36890;&#20449;&#12364;&#33258;&#21205;&#30340;&#12395;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398; 3 &#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <ul><li>LocalConnection &#12463;&#12521;&#12473;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12434;&#20316;&#25104;&#12375;&#12390;&#12513;&#12477;&#12483;&#12489;&#12434;&#36861;&#21152;&#12377;&#12427;&#26041;&#27861;</li>&#13;
                  <li>&#13;
                     <code>LocalConnection.client</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12289;&#12513;&#12477;&#12483;&#12489;&#12434;&#23455;&#35013;&#12375;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35373;&#23450;&#12377;&#12427;&#26041;&#27861;</li>&#13;
                  <li>LocalConnection &#12434;&#25313;&#24373;&#12375;&#12383;&#21205;&#30340;&#12394;&#12463;&#12521;&#12473;&#12434;&#20316;&#25104;&#12375;&#12289;&#21205;&#30340;&#12395;&#12513;&#12477;&#12483;&#12489;&#12434;&#36861;&#21152;&#12377;&#12427;&#26041;&#27861;</li>&#13;
               </ul><p>&#21508;&#12501;&#12449;&#12452;&#12523;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12467;&#12510;&#12531;&#12489;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;2 &#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#38291;&#12391;&#36890;&#20449;&#12434;&#34892;&#12358;&#12383;&#12417;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20351;&#29992;&#26041;&#27861;&#12364;&#29702;&#35299;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#19968;&#26041;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;<i>&#21463;&#20449;&#20596;</i>&#12501;&#12449;&#12452;&#12523;&#12392;&#21628;&#12403;&#12414;&#12377;&#12290;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12513;&#12477;&#12483;&#12489;&#12364;&#21547;&#12414;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;&#21463;&#20449;&#20596;&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392; <code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12418;&#12358;&#19968;&#26041;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;<i>&#36865;&#20449;&#20596;</i>&#12501;&#12449;&#12452;&#12523;&#12392;&#21628;&#12403;&#12414;&#12377;&#12290;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;&#36865;&#20449;&#20596;&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;&#12418;&#12358; 1 &#12388;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392; <code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <code>send()</code> &#12392; <code>connect()</code> &#12398;&#20351;&#12356;&#26041;&#12399;&#12289;&#20001;&#26041;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#12395;&#12354;&#12427;&#22580;&#21512;&#12289;&#20104;&#28204;&#21487;&#33021;&#12394;&#12489;&#12513;&#12452;&#12531;&#21517;&#12434;&#25345;&#12388;&#30064;&#12394;&#12427;&#12489;&#12513;&#12452;&#12531;&#12395;&#12354;&#12427;&#22580;&#21512;&#12289;&#20104;&#28204;&#19981;&#21487;&#33021;&#12414;&#12383;&#12399;&#21205;&#30340;&#12394;&#12489;&#12513;&#12452;&#12531;&#21517;&#12434;&#25345;&#12388;&#30064;&#12394;&#12427;&#12489;&#12513;&#12452;&#12531;&#12395;&#12354;&#12427;&#22580;&#21512;&#12395;&#12424;&#12426;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#27425;&#12398;&#27573;&#33853;&#12391;&#12399;&#12289;&#19978;&#35352;&#12398; 3 &#12388;&#12398;&#22580;&#21512;&#12381;&#12428;&#12382;&#12428;&#12395;&#12388;&#12356;&#12390;&#12289;&#12469;&#12531;&#12503;&#12523;&#12467;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#12398;&#22580;&#21512;</b>&#65306;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#38291;&#12384;&#12369;&#12391;&#36890;&#20449;&#12434;&#35377;&#21487;&#12375;&#12414;&#12377;&#12290;&#21516;&#19968;&#12489;&#12513;&#12452;&#12531;&#36890;&#20449;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12371;&#12428;&#12399; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26368;&#12418;&#31777;&#21336;&#12394;&#20351;&#29992;&#26041;&#27861;&#12391;&#12377;&#12290; &#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#12395;&#12354;&#12427; 2 &#12388;&#12398; &#12501;&#12449;&#12452;&#12523;&#38291;&#12391;&#36890;&#20449;&#12434;&#34892;&#12358;&#22580;&#21512;&#12399;&#12289;&#29305;&#21029;&#12394;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#23550;&#31574;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;<code>connectionName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12434;&#12381;&#12398;&#12414;&#12414; <code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12392; <code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12377;&#12384;&#12369;&#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <img src="../../images/localconnection_samedomains.gif" alt="&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#12525;&#12540;&#12489;" /></p>&#13;
 &#13;
               <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
// receivingLC is in http://www.domain.com/receiving.swf&#13;
receivingLC.connect('myConnection');&#13;
&#13;
// sendingLC is in http://www.domain.com/sending.swf&#13;
// myMethod() is defined in sending.swf&#13;
sendingLC.send('myConnection', 'myMethod');&#13;
</pre></div>&#13;
               <p>&#13;
                  <b>&#20104;&#28204;&#21487;&#33021;&#12394;&#12489;&#12513;&#12452;&#12531;&#21517;&#12434;&#25345;&#12388;&#30064;&#12394;&#12427;&#12489;&#12513;&#12452;&#12531;&#12398;&#22580;&#21512;</b>&#65306;&#30064;&#12394;&#12427;&#12489;&#12513;&#12452;&#12531;&#12395;&#23384;&#22312;&#12377;&#12427; 2 &#12388;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#38291;&#12391;&#36890;&#20449;&#12434;&#34892;&#12358;&#22580;&#21512;&#12399;&#12289;<code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;2 &#12388;&#12398;&#12489;&#12513;&#12452;&#12531;&#38291;&#12398;&#36890;&#20449;&#12434;&#35377;&#21487;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#25509;&#32154;&#21517;&#12434;&#12289;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12489;&#12513;&#12452;&#12531;&#21517;&#12391;&#20462;&#39166;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <img src="../../images/localconnection_differentdomains.gif" alt="&#21029;&#20491;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#12525;&#12540;&#12489;" /></p>&#13;
 &#13;
               <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
// receivingLC is in http://www.domain.com/receiving.swf&#13;
receivingLC.allowDomain('www.anotherdomain.com');&#13;
receivingLC.connect('myConnection');&#13;
&#13;
// sendingLC is in http://www.anotherdomain.com/sending.swf&#13;
sendingLC.send('www.domain.com:myConnection', 'myMethod');&#13;
</pre></div>&#13;
 &#13;
               <p>&#13;
                  <b>&#20104;&#28204;&#19981;&#21487;&#33021;&#12394;&#12489;&#12513;&#12452;&#12531;&#21517;&#12434;&#25345;&#12388;&#30064;&#12394;&#12427;&#12489;&#12513;&#12452;&#12531;&#12398;&#22580;&#21512;</b>&#65306;&#21463;&#20449;&#20596;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12434;&#12489;&#12513;&#12452;&#12531;&#38291;&#12391;&#31227;&#26893;&#12375;&#12420;&#12377;&#12367;&#12375;&#12383;&#12356;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#12489;&#12513;&#12452;&#12531;&#21517;&#12434;&#25351;&#23450;&#12379;&#12378;&#12395;&#21463;&#20449;&#20596;&#12392;&#36865;&#20449;&#20596;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#12395;&#12394;&#12356;&#12371;&#12392;&#12434; Flash Player &#12395;&#35469;&#35672;&#12373;&#12379;&#12427;&#12395;&#12399;&#12289;<code>connect()</code> &#21628;&#12403;&#20986;&#12375;&#12392; <code>send()</code> &#21628;&#12403;&#20986;&#12375;&#12398;&#20001;&#26041;&#12391;&#12289;&#25509;&#32154;&#21517;&#12398;&#21069;&#12395;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#65288;_&#65289;&#12434;&#20184;&#12369;&#12414;&#12377;&#12290; 2 &#12388;&#12398;&#12489;&#12513;&#12452;&#12531;&#38291;&#12398;&#36890;&#20449;&#12434;&#35377;&#21487;&#12377;&#12427;&#12395;&#12399;&#12289;<code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;LocalConnection &#12398;&#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12377;&#12427;&#12489;&#12513;&#12452;&#12531;&#12434;&#28193;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12399;&#12289;&#12527;&#12452;&#12523;&#12489;&#12459;&#12540;&#12489;&#65288;*&#65289;&#12434;&#24341;&#25968;&#12395;&#28193;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <img src="../../images/localconnection_unknowndomains.gif" alt="&#12489;&#12513;&#12452;&#12531;&#21517;&#12364;&#19981;&#26126;&#12398;&#12392;&#12365;&#12398;&#12525;&#12540;&#12489;" /></p>&#13;
               <div class="listing"><pre>&#13;
// receivingLC is in http://www.domain.com/receiving.swf&#13;
receivingLC.allowDomain('*');&#13;
receivingLC.connect('_myConnection');&#13;
&#13;
// sendingLC is in http://www.anotherdomain.com/sending.swf&#13;
sendingLC.send('_myConnection', 'myMethod');&#13;
</pre><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div></div>&#13;
 &#13;
               <p>&#13;
                  <b>Flash Player &#12363;&#12425; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</b>&#65306;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12391;&#20316;&#25104;&#12373;&#12428;&#12383; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#29305;&#21029;&#12394;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12489;&#12513;&#12452;&#12531;&#21517;&#12391;&#12399;&#12394;&#12367;&#25509;&#32154;&#25509;&#38957;&#36766;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#12501;&#12457;&#12540;&#12512;&#12399; <code>app#appID.pubID</code> &#12391;&#12289;appID &#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID&#12289;pubID &#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#30330;&#34892;&#32773; ID &#12391;&#12377;&#65288;&#30330;&#34892;&#32773; ID &#12399;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#30330;&#34892;&#32773; ID &#12364;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#21547;&#12417;&#12414;&#12377;&#65289;&#12290;&#20363;&#12360;&#12400;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID &#12364;&#12300;com.example&#12301;&#12391;&#12289;&#30330;&#34892;&#32773; ID &#12364;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<code>app#com.example:myConnection</code> &#12434;&#12525;&#12540;&#12459;&#12523;&#25509;&#32154;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399; <code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#21628;&#12403;&#20986;&#12375;&#20596; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#20803;&#12398;&#12489;&#12513;&#12452;&#12531;&#12391;&#28193;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; </p>&#13;
 &#13;
               <p>&#13;
                  <img src="../../images/localconnection_flash2AIR.gif" alt="Flash Player &#12363;&#12425; AIR &#12408;&#12398;&#25509;&#32154;" /></p>&#13;
 &#13;
               <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
// receivingLC is an AIR application with app ID = com.example (and no publisher ID)&#13;
receivingLC.allowDomain('www.domain.com');&#13;
receivingLC.connect('myConnection');&#13;
&#13;
// sendingLC is in http://www.domain.com/sending.swf&#13;
sendingLC.send('app#com.example:myConnection', 'myMethod');&#13;
</pre></div>&#13;
 &#13;
               <p>&#13;
                  <b>&#27880;&#24847;&#65306;</b> AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#22806;&#12391; SWF &#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398; SWF &#12392;&#12525;&#12540;&#12459;&#12523;&#25509;&#32154;&#12434;&#30906;&#31435;&#12377;&#12427;&#38555;&#12398;&#35215;&#21063;&#12399;&#12289;Flash Player &#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427; SWF &#12392;&#12398;&#25509;&#32154;&#12434;&#30906;&#31435;&#12377;&#12427;&#35215;&#21063;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425; Flash Player</b>&#65306;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12289;Flash Player &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427; SWF &#12392;&#36890;&#20449;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;<code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#25509;&#32154;&#25509;&#38957;&#36766;&#12391;&#28193;&#12377;&#12371;&#12392;&#12391;&#12289;&#12371;&#12398; 2 &#12388;&#12398;&#38291;&#12398;&#36890;&#20449;&#12434;&#35377;&#21487;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID &#12364;&#12300;com.example&#12301;&#12391;&#12289;&#30330;&#34892;&#32773; ID &#12364;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464; <code>app#com.example</code> &#12434; <code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#25509;&#32154;&#21517;&#12434;&#12289;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12489;&#12513;&#12452;&#12531;&#21517;&#12391;&#20462;&#39166;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12377;&#65288;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12363;&#12425;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12489;&#12513;&#12452;&#12531;&#12392;&#12375;&#12390;&#12300;localhost&#12301;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#65289;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <img src="../../images/localconnection_AIR2flash.gif" alt="AIR &#12363;&#12425; Flash Player &#12408;&#12398;&#36890;&#20449;" /></p>&#13;
 &#13;
               <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
// receivingLC is in http://www.domain.com/receiving.swf&#13;
receivingLC.allowDomain('app#com.example');&#13;
receivingLC.connect('myConnection');&#13;
&#13;
// sendingLC is an AIR application with app ID = com.example (and no publisher ID)&#13;
sendingLC.send('www.domain.com:myConnection', 'myMethod');&#13;
</pre></div>&#13;
 &#13;
               <p>&#13;
                  <b>AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#20182;&#12398; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</b>&#65306;2 &#12388;&#12398; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38291;&#12434;&#36890;&#20449;&#12377;&#12427;&#12395;&#12399;&#12289;<code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#36865;&#20449;&#20596; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#25509;&#32154;&#25509;&#38957;&#36766;&#12391;&#28193;&#12377;&#12371;&#12392;&#12391;&#12289;&#12371;&#12398; 2 &#12388;&#12398;&#38291;&#12398;&#36890;&#20449;&#12434;&#35377;&#21487;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#36865;&#20449;&#20596;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID &#12364;&#12300;com.example&#12301;&#12391;&#12289;&#30330;&#34892;&#32773; ID &#12364;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464; <code>app#com.example</code> &#12434;&#21463;&#20449;&#20596;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398; <code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#25509;&#32154;&#21517;&#12434;&#12289;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#25509;&#32154;&#25509;&#38957;&#36766;&#12391;&#20462;&#39166;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <img src="../../images/localconnection_AIR2AIR.gif" alt="AIR &#38291;&#12398;&#36890;&#20449;" /></p>&#13;
 &#13;
               <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
// receivingLC is an AIR application with app ID = com.sample (and no publisher ID)&#13;
receivingLC.allowDomain('app#com.example');&#13;
receivingLC.connect('myConnection');&#13;
&#13;
// sendingLC is an AIR application with app ID = com.example (and no publisher ID)&#13;
sendingLC.send('app#com.sample:myConnection', 'myMethod');&#13;
</pre></div>&#13;
 &#13;
               <p>LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;1 &#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#20869;&#12391;&#12487;&#12540;&#12479;&#12434;&#36865;&#21463;&#20449;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399;&#19968;&#33324;&#30340;&#12394;&#26041;&#27861;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12392; <code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<code>connectionName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65288;<code>LocalConnection.send()</code> &#12456;&#12531;&#12488;&#12522;&#12362;&#12424;&#12403; <code>LocalConnection.connect()</code> &#12456;&#12531;&#12488;&#12522;&#65289;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12414;&#12383;&#12289;<code>allowDomain()</code> &#12456;&#12531;&#12488;&#12522;&#12362;&#12424;&#12403; <code>domain</code> &#12456;&#12531;&#12488;&#12522;&#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
            <p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><p id="moreExamples"><span class="classHeaderTableLabel">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118666ade46-7c7e.html" target="_blank">Flash Player &#12362;&#12424;&#12403; AIR &#12398;&#20182;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#36890;&#20449;</a></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#send()" target="">flash.net.LocalConnection.send()</a><br /><a href="LocalConnection.html#allowDomain()" target="">flash.net.LocalConnection.allowDomain()</a><br /><a href="LocalConnection.html#domain" target="">flash.net.LocalConnection.domain</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#client" class="signatureLink">client</a> : <a href="../../Object.html">Object</a><div class="summaryTableDescription">&#13;
     &#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#domain" class="signatureLink">domain</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
     &#29694;&#22312;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12377;&#12427;&#12489;&#12513;&#12452;&#12531;&#12434;&#34920;&#12377;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class=""><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#isPerUser" class="signatureLink">isPerUser</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription"></div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#isSupported" class="signatureLink">isSupported</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#38745;&#30340;] [&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
    &#29694;&#22312;&#12398;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12391; LocalConnection &#12463;&#12521;&#12473;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;isSupported &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;false &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#LocalConnection()" class="signatureLink">LocalConnection</a>()</div><div class="summaryTableDescription">&#13;
     LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#allowDomain()" class="signatureLink">allowDomain</a>(<a href="../../statements.html#..._(rest)_parameter">...</a> domains):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#12371;&#12398; LocalConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#36865;&#20449;&#12391;&#12365;&#12427; 1 &#12388;&#20197;&#19978;&#12398;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#allowInsecureDomain()" class="signatureLink">allowInsecureDomain</a>(<a href="../../statements.html#..._(rest)_parameter">...</a> domains):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#12371;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#36865;&#20449;&#12391;&#12365;&#12427; 1 &#12388;&#20197;&#19978;&#12398;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#close()" class="signatureLink">close</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38281;&#12376;&#12414;&#12377;&#65288;&#20999;&#26029;&#12375;&#12414;&#12377;&#65289;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#connect()" class="signatureLink">connect</a>(connectionName:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     send() &#12467;&#12510;&#12531;&#12489;&#65288;&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12363;&#12425;&#36865;&#20449;&#12373;&#12428;&#12383;&#12467;&#12510;&#12531;&#12489;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12424;&#12358;&#12395; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#28310;&#20633;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#send()" class="signatureLink">send</a>(connectionName:<a href="../../String.html">String</a>, methodName:<a href="../../String.html">String</a>, <a href="../../statements.html#..._(rest)_parameter">...</a> arguments):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     connect(connectionName) &#12513;&#12477;&#12483;&#12489;&#65288;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12391;&#30906;&#31435;&#12375;&#12383;&#25509;&#32154;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;methodName &#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">LocalConnection</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:asyncError" class="signatureLink">asyncError</a></div></td><td class="summaryTableDescription summaryTableCol">&#38750;&#21516;&#26399;&#24418;&#24335;&#12391;&#12289;&#12388;&#12414;&#12426;&#12493;&#12452;&#12486;&#12451;&#12502;&#38750;&#21516;&#26399;&#12467;&#12540;&#12489;&#12363;&#12425;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:securityError" class="signatureLink">securityError</a></div></td><td class="summaryTableDescription summaryTableCol">LocalConnection.send() &#12398;&#21628;&#12403;&#20986;&#12375;&#12391;&#12289;&#30064;&#12394;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12395;&#12487;&#12540;&#12479;&#12434;&#36865;&#20449;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">LocalConnection</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:status" class="signatureLink">status</a></div></td><td class="summaryTableDescription summaryTableCol">LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12473;&#12486;&#12540;&#12479;&#12473;&#12434;&#22577;&#21578;&#12377;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">LocalConnection</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/client" class="dashAnchor" id="//apple_ref/cpp/Property/client"></a><a name="client" id="client"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>client</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>client:<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#20316;&#25104;&#12373;&#12428;&#12427;&#12525;&#12540;&#12459;&#12523;&#25509;&#32154; <code>this</code> &#12391;&#12377;&#12290;<code>client</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21029;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#21029;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get client():<a href="../../Object.html">Object</a></code><br /><code>&#160;&#160;&#160;&#160;public function set client(value:<a href="../../Object.html">Object</a>):<a href="../../specialTypes.html#void">void</a></code><br /><br /><span class="label"> &#20363;&#22806; </span><br /><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; <code>client</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;null &#20197;&#22806;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118666ade46-7c7e.html" target="_blank">Flash Player &#12362;&#12424;&#12403; AIR &#12398;&#20182;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#36890;&#20449;</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/domain" class="dashAnchor" id="//apple_ref/cpp/Property/domain"></a><a name="domain" id="domain"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>domain</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>domain:<a href="../../String.html">String</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#29694;&#22312;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12377;&#12427;&#12489;&#12513;&#12452;&#12531;&#12434;&#34920;&#12377;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#13;
     &#13;
     </p><p>Adobe AIR &#12398;<code>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</code>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#20849;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#12391;&#12399;&#12289;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;<code>app#</code> + AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID&#65288;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#12501;&#12449;&#12452;&#12523;&#12391;&#23450;&#32681;&#65289;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; <code></code>&#20363;&#12360;&#12400;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID &#12364; <code>com.example.air.MyApp</code> &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;<code>connectionName</code> &#12399; <code>"app#com.example.air.MyApp:connectionName"</code> &#12395;&#35299;&#27770;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>Flash Player 9 &#20197;&#38477;&#29992;&#12395;&#12497;&#12502;&#12522;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12502;&#12489;&#12513;&#12452;&#12531;&#12434;&#21547;&#12416;&#27491;&#30906;&#12394;&#12489;&#12513;&#12452;&#12531;&#12434;&#31034;&#12377;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;&#29694;&#22312;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364; www.adobe.com &#12395;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;<code>"www.adobe.com"</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290; </p>&#13;
     &#13;
     <p>&#29694;&#22312;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#12289;Flash Player &#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#19978;&#12398;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;<code>"localhost"</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#20351;&#29992;&#26041;&#27861;&#12392;&#12375;&#12390;&#12399;&#12289;&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12489;&#12513;&#12452;&#12531;&#21517;&#12434;&#12289;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#21628;&#12403;&#20986;&#12377;&#12513;&#12477;&#12483;&#12489;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390;&#32068;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#12354;&#12427;&#12356;&#12399;&#12289;<code>LocalConnection.allowDomain()</code> &#12392;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#20351;&#29992;&#12375;&#12390;&#12289;&#29305;&#23450;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#21463;&#12369;&#20837;&#12428;&#12414;&#12377;&#12290;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12354;&#12427; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#38291;&#12391;&#12398;&#12415;&#36890;&#20449;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#36890;&#24120;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get domain():<a href="../../String.html">String</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#allowDomain()" target="">flash.net.LocalConnection.allowDomain()</a><br /><a href="LocalConnection.html#connect()" target="">flash.net.LocalConnection.connect()</a></div></div></span><span id="pageFilter"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/isPerUser" class="dashAnchor" id="//apple_ref/cpp/Property/isPerUser"></a><a name="isPerUser" id="isPerUser"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>isPerUser</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>isPerUser:<a href="../../Boolean.html">Boolean</a></code><p></p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get isPerUser():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set isPerUser(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/isSupported" class="dashAnchor" id="//apple_ref/cpp/Property/isSupported"></a><a name="isSupported" id="isSupported"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>isSupported</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>isSupported:<a href="../../Boolean.html">Boolean</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
    &#29694;&#22312;&#12398;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12391; LocalConnection &#12463;&#12521;&#12473;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>isSupported</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<code>false</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public static function get isSupported():<a href="../../Boolean.html">Boolean</a></code><br /></div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Constructor/LocalConnection()" class="dashAnchor" id="//apple_ref/cpp/Constructor/LocalConnection()"></a><a name="LocalConnection()" id="LocalConnection()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>LocalConnection</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function LocalConnection()</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p>&#13;
     LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#21516;&#12376;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#19978;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#30064;&#12394;&#12427;&#12501;&#12449;&#12452;&#12523;&#38291;&#12391;&#36890;&#20449;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#connect()" target="">flash.net.LocalConnection.connect()</a><br /><a href="LocalConnection.html#send()" target="">flash.net.LocalConnection.send()</a></div></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/allowDomain()" class="dashAnchor" id="//apple_ref/cpp/Method/allowDomain()"></a><a name="allowDomain()" id="allowDomain()"></a><a name="allowDomain(restParam)" id="allowDomain(restParam)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>allowDomain</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function allowDomain(<a href="../../statements.html#..._(rest)_parameter">...</a> domains):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12371;&#12398; LocalConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#36865;&#20449;&#12391;&#12365;&#12427; 1 &#12388;&#20197;&#19978;&#12398;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12475;&#12461;&#12517;&#12450;&#12391;&#12394;&#12356;&#12503;&#12525;&#12488;&#12467;&#12523;&#12391;&#12507;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12289;&#12475;&#12461;&#12517;&#12450;&#12394;&#12503;&#12525;&#12488;&#12467;&#12523;&#65288;HTTPS&#65289;&#12434;&#20351;&#29992;&#12375;&#12390;&#12507;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35377;&#21487;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;<code>allowInsecureDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12356;&#12290;</p>&#13;
     &#13;
     <p>&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12489;&#12513;&#12452;&#12531;&#12398;&#30064;&#12394;&#12427;&#23376;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#35242;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#12289;&#23376;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#32066;&#30340;&#12394;&#12489;&#12513;&#12452;&#12531;&#12364;&#19981;&#26126;&#12394;&#29366;&#24907;&#12391;&#12418;&#23455;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12356;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;&#12525;&#12540;&#12489;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12420;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#35069;&#12469;&#12540;&#12496;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12289;&#12525;&#12540;&#12489;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427; LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>url</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12377;&#12428;&#12400;&#12289;<code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#20351;&#29992;&#12377;&#12427;&#12489;&#12513;&#12452;&#12531;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#23376;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#24460;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>contentLoaderInfo.url</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#23436;&#20840;&#12394; URL &#12473;&#12488;&#12522;&#12531;&#12464;&#12363;&#12425;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12489;&#12513;&#12452;&#12531;&#12434;&#35299;&#26512;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12414;&#12391;&#24453;&#12388;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12501;&#12449;&#12452;&#12523;&#12364;&#23436;&#20840;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12414;&#12391;&#12289;<code>contentLoaderInfo.url</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#26368;&#32066;&#30340;&#12394;&#27491;&#12375;&#12356;&#20516;&#12395;&#35373;&#23450;&#12373;&#12428;&#12394;&#12356;&#12383;&#12417;&#12391;&#12377;&#12290; </p>&#13;
     &#13;
     <p>&#12414;&#12383;&#12289;&#12371;&#12428;&#12392;&#12399;&#21453;&#23550;&#12395;&#12289;&#12489;&#12513;&#12452;&#12531;&#12398;&#19981;&#26126;&#12394;&#35242;&#12363;&#12425;&#12398; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#23376;&#12501;&#12449;&#12452;&#12523;&#12395;&#21463;&#12369;&#20837;&#12428;&#12373;&#12379;&#12383;&#12356;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398; <code>loaderInfo.url</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12489;&#12513;&#12452;&#12531;&#12395;&#19968;&#33268;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#23455;&#35013;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12418;&#12289;<code>loaderInfo.url</code> &#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#23436;&#20840;&#12394; URL &#12363;&#12425;&#12489;&#12513;&#12452;&#12531;&#12434;&#35299;&#26512;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#29366;&#27841;&#12391;&#12399;&#12289;&#35242;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12414;&#12391;&#24453;&#12388;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35242; SWF &#12501;&#12449;&#12452;&#12523;&#12399;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#26178;&#28857;&#12391;&#26082;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;Flash Player &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12514;&#12487;&#12523;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12381;&#12428;&#12434;&#20316;&#25104;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12289;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12463;&#12525;&#12473;&#12489;&#12513;&#12452;&#12531;&#21628;&#12403;&#20986;&#12375;&#12399;&#12289;&#21463;&#20449;&#20596;&#12501;&#12449;&#12452;&#12523;&#12391; <code>LocalConnection.allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#38480;&#12426;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;Adobe AIR &#12391;&#12399;&#12289;<code>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</code>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20869;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#20849;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#38480;&#12395;&#12424;&#12427;&#21046;&#38480;&#12434;&#21463;&#12369;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><b>&#27880;&#24847;&#65306;</b><code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;ActionScript 1.0 &#12362;&#12424;&#12403; 2.0 &#12391;&#12398;&#24418;&#24335;&#12363;&#12425;&#22793;&#26356;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#20197;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;<code>allowDomain</code> &#12399;&#23455;&#35013;&#12377;&#12427;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12391;&#12375;&#12383;&#12290;ActionScript 3.0 &#12391;&#12399;&#12289;<code>allowDomain()</code> &#12399; LocalConnection &#12398;&#12499;&#12523;&#12488;&#12452;&#12531;&#12513;&#12477;&#12483;&#12489;&#12392;&#12375;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#22793;&#26356;&#12373;&#12428;&#12383; <code>allowDomain()</code> &#12399; <code>flash.system.Security.allowDomain()</code> &#12392;&#12411;&#12412;&#21516;&#12376;&#12424;&#12358;&#12395;&#20316;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><a href="../../statements.html#..._(rest)_parameter">...</a> <span class="label">domains</span></code> &#8212; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12377;&#12427;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12377;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#12399;&#27425;&#12398; 2 &#12388;&#12398;&#29305;&#27530;&#12394;&#12465;&#12540;&#12473;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     <ul><li>&#12527;&#12452;&#12523;&#12489;&#12459;&#12540;&#12489;&#25991;&#23383; "*" &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12391;&#12365;&#12414;&#12377;&#12290;</li><li>"<code>localhost</code>" &#12392;&#12356;&#12358;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12525;&#12540;&#12459;&#12523;&#29872;&#22659;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;<span>Flash Player 8 &#12363;&#12425;&#12289;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#38480;&#12364;&#23566;&#20837;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;Flash Player &#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12289;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35377;&#21487;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; Flash Player &#12391;&#12399;&#12289;"<code>localhost</code>" &#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12377;&#12409;&#12390;&#12398;&#12525;&#12540;&#12459;&#12523; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12371;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;</span> </li></ul></td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; &#25351;&#23450;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12289;null &#20197;&#22806;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118666ade46-7c7e.html" target="_blank">Flash Player &#12362;&#12424;&#12403; AIR &#12398;&#20182;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#36890;&#20449;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#allowInsecureDomain()" target="">flash.net.LocalConnection.allowInsecureDomain()</a><br /><a href="../../flash/display/LoaderInfo.html#url" target="">flash.display.LoaderInfo.url</a><br /><a href="../../flash/system/Security.html#allowDomain()" target="">flash.system.Security.allowDomain()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/allowInsecureDomain()" class="dashAnchor" id="//apple_ref/cpp/Method/allowInsecureDomain()"></a><a name="allowInsecureDomain()" id="allowInsecureDomain()"></a><a name="allowInsecureDomain(restParam)" id="allowInsecureDomain(restParam)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>allowInsecureDomain</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function allowInsecureDomain(<a href="../../statements.html#..._(rest)_parameter">...</a> domains):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12371;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#36865;&#20449;&#12391;&#12365;&#12427; 1 &#12388;&#20197;&#19978;&#12398;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><code>allowInsecureDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12399; <code>allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#20316;&#29992;&#12375;&#12414;&#12377;&#12364;&#12289;<code>allowInsecureDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;HTTPS &#20197;&#22806;&#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12364; HTTPS &#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12395; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#36865;&#20449;&#12377;&#12427;&#12371;&#12392;&#12418;&#35377;&#21487;&#12377;&#12427;&#28857;&#12364;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#36949;&#12356;&#12399;&#12289;HTTPS &#12434;&#20351;&#29992;&#12375;&#12390;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425; <code>allowInsecureDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#22580;&#21512;&#12395;&#12398;&#12415;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398;&#38750; HTTPS &#12392; HTTPS &#12398;&#22659;&#30028;&#12434;&#36234;&#12360;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;<code>allowInsecureDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#20869;&#12391;&#12418; &#38750; HTTPS &#12501;&#12449;&#12452;&#12523;&#12363;&#12425; HTTPS &#12501;&#12449;&#12452;&#12523;&#12408;&#12398; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12399;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p><code>allowInsecureDomain()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12399;&#12289;HTTPS &#12395;&#12424;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12364;&#25613;&#12394;&#12431;&#12428;&#12427;&#24656;&#12428;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;&#12362;&#21223;&#12417;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;HTTPS &#12395;&#12424;&#12387;&#12390;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12411;&#12412;&#30906;&#23455;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12391;&#12398;&#37197;&#20449;&#20013;&#12395;&#19981;&#27491;&#25805;&#20316;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#38750; HTTPS &#12501;&#12449;&#12452;&#12523;&#12363;&#12425; HTTPS &#12501;&#12449;&#12452;&#12523;&#12408;&#12398; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12375;&#12383;&#22580;&#21512;&#12289;&#37197;&#20449;&#20013;&#12395;&#19981;&#27491;&#25805;&#20316;&#12373;&#12428;&#12383;&#21487;&#33021;&#24615;&#12398;&#12354;&#12427;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12398;&#21628;&#12403;&#20986;&#12375;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;HTTPS &#12501;&#12449;&#12452;&#12523;&#12395;&#36865;&#12425;&#12428;&#12390;&#12365;&#12383; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12398;&#27491;&#24403;&#24615;&#12434;&#20449;&#38972;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12289;&#19968;&#33324;&#12395;&#29305;&#21029;&#12394;&#35686;&#25106;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;HTTPS &#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12507;&#12473;&#12488;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;HTTPS &#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12507;&#12473;&#12488;&#12373;&#12428;&#12383;&#20182;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#12398;&#12415;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#23455;&#35013;&#26041;&#27861;&#12395;&#12424;&#12426;&#12289;HTTPS &#12503;&#12525;&#12488;&#12467;&#12523;&#12364;&#25552;&#20379;&#12377;&#12427;&#25972;&#21512;&#24615;&#12364;&#20445;&#12383;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12391;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12399;&#12362;&#21223;&#12417;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289;HTTPS &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12364;&#25613;&#12394;&#12431;&#12428;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12434;&#22793;&#26356;&#12379;&#12374;&#12427;&#12434;&#12360;&#12394;&#12356;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;Flash Player 9 &#20197;&#38477;&#29992;&#12395;&#12497;&#12502;&#12522;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383; HTTPS SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;&#12289;Flash Player 6 &#20197;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#29992;&#12395;&#12497;&#12502;&#12522;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383; HTTP SWF &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35377;&#21487;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><a href="../../statements.html#..._(rest)_parameter">...</a> <span class="label">domains</span></code> &#8212; LocalConnection &#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12377;&#12427;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12377;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#12399; 2 &#12388;&#12398;&#29305;&#27530;&#12394;&#12465;&#12540;&#12473;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     <ul><li>&#12527;&#12452;&#12523;&#12489;&#12459;&#12540;&#12489;&#25991;&#23383; "*" &#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12391;&#12365;&#12414;&#12377;&#12290;"*" &#12434;&#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12289;&#12525;&#12540;&#12459;&#12523;&#12507;&#12473;&#12488;&#12399;&#21547;&#12414;&#12428;&#12414;&#12379;&#12435;&#12290;</li><li>"<code>localhost</code>" &#12392;&#12356;&#12358;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12525;&#12540;&#12459;&#12523;&#29872;&#22659;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12371;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#21628;&#12403;&#20986;&#12375;&#12434;&#35377;&#21487;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;Flash Player 8 &#12363;&#12425;&#12289;&#12525;&#12540;&#12459;&#12523; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#38480;&#12364;&#23566;&#20837;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35377;&#21487;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12395;&#12399;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;"<code>localhost</code>" &#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12393;&#12398;&#12525;&#12540;&#12459;&#12523; SWF &#12501;&#12449;&#12452;&#12523;&#12418;&#12371;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;&#12458;&#12540;&#12469;&#12522;&#12531;&#12464;&#26178;&#12395;&#12289;&#21628;&#12403;&#20986;&#12375;&#20803;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12434; local-with-networking &#12479;&#12452;&#12503;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;</li></ul></td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; &#25351;&#23450;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12289;null &#20197;&#22806;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118666ade46-7c7e.html" target="_blank">Flash Player &#12362;&#12424;&#12403; AIR &#12398;&#20182;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#36890;&#20449;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#allowDomain()" target="">flash.net.LocalConnection.allowDomain()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/close()" class="dashAnchor" id="//apple_ref/cpp/Method/close()"></a><a name="close()" id="close()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>close</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function close():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38281;&#12376;&#12414;&#12377;&#65288;&#20999;&#26029;&#12375;&#12414;&#12377;&#65289;&#12290;&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12418;&#12358;&#12467;&#12510;&#12531;&#12489;&#12434;&#21463;&#12369;&#20837;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#22580;&#21512;&#12395;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>connect()</code> &#12467;&#12510;&#12531;&#12489;&#12434;&#12289;&#21029;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#21516;&#12376; <code>connectionName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12390;&#23455;&#34892;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;&#13;
     &#13;
     </p><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; LocalConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12289;&#38281;&#12376;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#connect()" target="">flash.net.LocalConnection.connect()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/connect()" class="dashAnchor" id="//apple_ref/cpp/Method/connect()"></a><a name="connect()" id="connect()"></a><a name="connect(String)" id="connect(String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>connect</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function connect(connectionName:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     <code>send()</code> &#12467;&#12510;&#12531;&#12489;&#65288;<i>&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</i>&#65289;&#12363;&#12425;&#36865;&#20449;&#12373;&#12428;&#12383;&#12467;&#12510;&#12531;&#12489;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12424;&#12358;&#12395; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#28310;&#20633;&#12375;&#12414;&#12377;&#12290; <code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;<i>&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</i>&#12392;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;&#21463;&#20449;&#20596;&#12392;&#36865;&#20449;&#20596;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#21516;&#12376;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#19978;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#31478;&#21512;&#29366;&#27841;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#21069;&#12395;&#12289;&#21463;&#20449;&#20596;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12427;&#12513;&#12477;&#12483;&#12489;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#65288;LocalConnection &#12463;&#12521;&#12473;&#12398;&#20363;&#12434;&#21442;&#29031;&#65289;&#12290; </p>&#13;
     &#13;
     <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;<code>connectionName</code> &#24341;&#25968;&#12399; <code>"<i>superdomain</i>:connectionName"</code> &#12398;&#20516;&#12395;&#35299;&#27770;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391; <code><i>superdomain</i></code> &#12399;&#12289;<code>connect()</code> &#12467;&#12510;&#12531;&#12489;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12398;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12364; www.someDomain.com &#12395;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>connectionName</code> &#12399; <code>"someDomain.com:connectionName"</code> &#12395;&#35299;&#27770;&#12373;&#12428;&#12414;&#12377;&#12290;&#65288;Flash Player &#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12395;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>superdomain</code> &#12395;&#12399; <code>"localhost"</code> &#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;&#65289;</p>&#13;
     &#13;
     <p>Adobe AIR &#12398;<code>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</code>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#20849;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#12391;&#12399;&#12289;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;<code>app#</code> + AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID&#65288;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#12501;&#12449;&#12452;&#12523;&#12391;&#23450;&#32681;&#65289;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; <code></code>&#20363;&#12360;&#12400;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; ID &#12364; <code>com.example.air.MyApp</code> &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;<code>connectionName</code> &#12399; <code>"app#com.example.air.MyApp:connectionName"</code> &#12395;&#35299;&#27770;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12414;&#12383;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#25509;&#32154;&#21517;&#12364; <code>"</code><code><i>superdomain</i></code><code>:connectionName"</code> &#12398;&#20516;&#12395;&#35299;&#27770;&#12373;&#12428;&#12427;&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12384;&#12369;&#12434;&#21463;&#12369;&#20837;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#12395;&#32622;&#12363;&#12428;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#38291;&#12398;&#36890;&#20449;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#12398;&#12501;&#12449;&#12452;&#12523;&#38291;&#12398;&#12415;&#12398;&#36890;&#20449;&#12434;&#23455;&#35013;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#20808;&#38957;&#12364;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#65288;_&#65289;&#12391;&#12394;&#12367;&#12489;&#12513;&#12452;&#12531;&#21517;&#12434;&#21547;&#12414;&#12394;&#12356;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434; <code>connectionName</code> &#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#65288;<code>"myDomain:connectionName"</code> &#12394;&#12393;&#65289;&#12290;<code>connect(connectionName)</code> &#12513;&#12477;&#12483;&#12489;&#12392;&#21516;&#12376;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p>&#30064;&#12394;&#12427;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398;&#12501;&#12449;&#12452;&#12523;&#38291;&#12398;&#36890;&#20449;&#12434;&#23455;&#35013;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#65288;_&#65289;&#12391;&#22987;&#12414;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434; <code>connectionName</code> &#12395;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12434;&#12489;&#12513;&#12452;&#12531;&#38291;&#12391;&#31227;&#26893;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#32771;&#12360;&#12425;&#12428;&#12427; 2 &#12388;&#12398;&#29366;&#27841;&#12434;&#27425;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <ul><li><code>connectionName</code> &#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#65288;_&#65289;&#12391;&#22987;&#12414;&#12387;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<code>"myDomain:connectionName"</code> &#12398;&#12424;&#12358;&#12395;&#12289;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12392;&#12467;&#12525;&#12531;&#12364;&#21069;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#20182;&#12398;&#12489;&#12513;&#12452;&#12531;&#12398;&#21516;&#12376;&#21517;&#21069;&#12434;&#25345;&#12388;&#25509;&#32154;&#12392;&#12398;&#31478;&#21512;&#12399;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#24517;&#12378;&#12371;&#12398;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65288;<code>"myDomain:connectionName"</code> &#12394;&#12393;&#65289;&#12290;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12364;&#21029;&#12398;&#12489;&#12513;&#12452;&#12531;&#12395;&#31227;&#21205;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399;&#12289;<code>"anotherDomain:connectionName"</code> &#12398;&#12424;&#12358;&#12395;&#12289;&#26032;&#12375;&#12356;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12395;&#24540;&#12376;&#12390;&#25509;&#38957;&#36766;&#12364;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#26032;&#12375;&#12356;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12434;&#21442;&#29031;&#12377;&#12427;&#12424;&#12358;&#12395;&#25163;&#21205;&#12391;&#32232;&#38598;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</li><li><code>connectionName</code> &#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#65288;_&#65289;&#12391;&#22987;&#12414;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#65288;<code>"_connectionName"</code> &#12394;&#12393;&#65289;&#12399;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#25509;&#38957;&#36766;&#12399;&#36861;&#21152;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#12388;&#12414;&#12426;&#12289;&#21463;&#20449;&#20596;&#12392;&#36865;&#20449;&#20596;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;<code>connectionName</code> &#12395;&#12414;&#12387;&#12383;&#12367;&#21516;&#12376;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#21463;&#20449;&#20596;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; <code>allowDomain()</code> &#12434;&#20351;&#29992;&#12375;&#12289;&#12377;&#12409;&#12390;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#36890;&#20449;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#22793;&#26356;&#12379;&#12378;&#12395;&#12289;&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12434;&#21029;&#12398;&#12489;&#12513;&#12452;&#12531;&#12395;&#31227;&#21205;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</li></ul><p>&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12463;&#12521;&#12473;&#12398;&#27010;&#35201;&#12398;&#35500;&#26126;&#12289;<code>connectionName</code>&#65288;<code>send()</code>&#65289;&#12398;&#35500;&#26126;&#12289;&#12362;&#12424;&#12403; <code>allowDomain()</code> &#12456;&#12531;&#12488;&#12522;&#12392; <code>domain</code> &#12456;&#12531;&#12488;&#12522;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><b>&#27880;&#24847;&#65306;</b>&#12467;&#12525;&#12531;&#12399;&#12289;<code>connectionName</code> &#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12434;&#21306;&#20999;&#12427;&#29305;&#27530;&#25991;&#23383;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;<code>connectionName</code> &#12395;&#12467;&#12525;&#12531;&#12434;&#21547;&#12416;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#25351;&#23450;&#12377;&#12427;&#12398;&#12399;&#28961;&#21177;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;<span>Flash Player</span> &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12514;&#12487;&#12523;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12381;&#12428;&#12434;&#20316;&#25104;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12289;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12463;&#12525;&#12473;&#12489;&#12513;&#12452;&#12531;&#21628;&#12403;&#20986;&#12375;&#12399;&#12289;&#21463;&#20449;&#20596;&#12501;&#12449;&#12452;&#12523;&#12391; <code>LocalConnection.allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#38480;&#12426;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;<span>&#12501;&#12449;&#12452;&#12523;&#12364;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;SWF &#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#21547;&#12416; HTML &#12506;&#12540;&#12472;&#12395; <code>allowNetworking</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65288;<code>object</code> &#12479;&#12464;&#12362;&#12424;&#12403; <code>embed</code> &#12479;&#12464;&#65289;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</span>&#12383;&#12384;&#12375;&#12289;Adobe AIR &#12391;&#12399;&#12289;<code>application</code> &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20869;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#20849;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#38480;&#12395;&#12424;&#12427;&#21046;&#38480;&#12434;&#21463;&#12369;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">connectionName</span>:<a href="../../String.html">String</a></code> &#8212; &#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#36890;&#20449;&#12377;&#12427;&#12289;<code>send()</code> &#12467;&#12510;&#12531;&#12489;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#25509;&#32154;&#21517;&#12395;&#23550;&#24540;&#12377;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; <code>connectionName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28193;&#12373;&#12428;&#12427;&#20516;&#12399; null &#20197;&#22806;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; &#12371;&#12398;&#12456;&#12521;&#12540;&#12399;&#12289;&#27425;&#12398; 3 &#12388;&#12398;&#29702;&#30001;&#12395;&#12424;&#12387;&#12390;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;1) <code>connectionName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28193;&#12373;&#12428;&#12383;&#12473;&#12488;&#12522;&#12531;&#12464;&#20516;&#12364; null &#12384;&#12387;&#12383;&#22580;&#21512;&#12290;null &#20197;&#22806;&#12398;&#20516;&#12434;&#28193;&#12375;&#12414;&#12377;&#12290;2) <code>connectionName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28193;&#12373;&#12428;&#12383;&#20516;&#12395;&#12467;&#12525;&#12531;&#65288;:&#65289;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12290;&#12467;&#12525;&#12531;&#12399;&#12289;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12392; <code>connectionName</code> &#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#21306;&#20999;&#12427;&#29305;&#27530;&#25991;&#23383;&#12392;&#12375;&#12390; <code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;<code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;3) LocalConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#26082;&#12395;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118666ade46-7c7e.html" target="_blank">Flash Player &#12362;&#12424;&#12403; AIR &#12398;&#20182;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#36890;&#20449;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#send()" target="">flash.net.LocalConnection.send()</a><br /><a href="LocalConnection.html#allowDomain()" target="">flash.net.LocalConnection.allowDomain()</a><br /><a href="LocalConnection.html#domain" target="">flash.net.LocalConnection.domain</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/send()" class="dashAnchor" id="//apple_ref/cpp/Method/send()"></a><a name="send()" id="send()"></a><a name="send(String,String,restParam)" id="send(String,String,restParam)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>send</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function send(connectionName:<a href="../../String.html">String</a>, methodName:<a href="../../String.html">String</a>, <a href="../../statements.html#..._(rest)_parameter">...</a> arguments):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     <code>connect(connectionName)</code> &#12513;&#12477;&#12483;&#12489;&#65288;<i>&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</i>&#65289;&#12391;&#30906;&#31435;&#12375;&#12383;&#25509;&#32154;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;<code>methodName</code> &#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;<code>send()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;<i>&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</i>&#12392;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;&#36865;&#20449;&#20596;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#21463;&#20449;&#20596;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#21516;&#12376;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#19978;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12395;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390;&#28193;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12487;&#12540;&#12479;&#12398;&#37327;&#12399; 40 KB &#12395;&#21046;&#38480;&#12373;&#12428;&#12414;&#12377;&#12290;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12364;&#27491;&#12375;&#12356;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;<code>send()</code> &#12364; <code>ArgumentError</code> &#12434;&#12473;&#12525;&#12540;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;<code>send()</code> &#35201;&#27714;&#12434;&#35079;&#25968;&#12398;&#12467;&#12510;&#12531;&#12489;&#12395;&#20998;&#21106;&#12375;&#12390;&#12381;&#12428;&#12382;&#12428;&#12398;&#12487;&#12540;&#12479;&#12434; 40 KB &#12424;&#12426;&#23567;&#12373;&#12367;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><code>connect()</code> &#12398;&#38917;&#30446;&#12391;&#35500;&#26126;&#12375;&#12383;&#12424;&#12358;&#12395;&#12289;<code>connectionName</code> &#12395;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#29694;&#22312;&#12398;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290; &#30064;&#12394;&#12427;&#12489;&#12513;&#12452;&#12531;&#38291;&#12398;&#36890;&#20449;&#12434;&#23455;&#35013;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#36865;&#20449;&#20596;&#12392;&#21463;&#20449;&#20596;&#12398;&#20001;&#26041;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>connectionName</code> &#12434;&#12289;&#29694;&#22312;&#12398;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12364; <code>connectionName</code> &#12395;&#36861;&#21152;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#23450;&#32681;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12428;&#12395;&#12399;&#12289;&#27425;&#12398; 2 &#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <ul><li>&#36865;&#20449;&#20596;&#12392;&#21463;&#20449;&#20596;&#12398;&#20001;&#26041;&#12398; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12289;<code>connectionName</code> &#12398;&#20808;&#38957;&#12395;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#65288;_&#65289;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#21463;&#20449;&#20596;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#12289;<code>LocalConnection.allowDomain()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12393;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#25509;&#32154;&#12418;&#21463;&#12369;&#20837;&#12428;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#26041;&#27861;&#12391;&#12399;&#12289;&#36865;&#20449;&#20596;&#12392;&#21463;&#20449;&#20596;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#20219;&#24847;&#12398;&#12489;&#12513;&#12452;&#12531;&#12395;&#37197;&#32622;&#12391;&#12365;&#12414;&#12377;&#12290;</li><li>&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>connectionName</code> &#12395;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12434;&#21547;&#12417;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>myDomain.com:myConnectionName</code> &#12392;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#21463;&#20449;&#20596;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;<code>LocalConnection.allowDomain()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#25351;&#23450;&#12375;&#12383;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#65288;&#12371;&#12398;&#20363;&#12391;&#12399; myDomain.com&#65289;&#12363;&#12425;&#12398;&#25509;&#32154;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12377;&#12409;&#12390;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#25509;&#32154;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</li></ul><p><b>&#27880;&#24847;&#65306;</b>&#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>connectionName</code> &#12391;&#12399;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12473;&#12540;&#12497;&#12540;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12391;&#12365;&#12427;&#12398;&#12399;&#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12384;&#12369;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;<span>Flash Player</span> &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12514;&#12487;&#12523;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12381;&#12428;&#12434;&#20316;&#25104;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12289;LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12463;&#12525;&#12473;&#12489;&#12513;&#12452;&#12531;&#21628;&#12403;&#20986;&#12375;&#12399;&#12289;&#21463;&#20449;&#20596;&#12501;&#12449;&#12452;&#12523;&#12391; <code>LocalConnection.allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#38480;&#12426;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12502;&#12521;&#12454;&#12470;&#12540;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427; SWF &#12467;&#12531;&#12486;&#12531;&#12484;&#12391;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;SWF &#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#21547;&#12416; HTML &#12506;&#12540;&#12472;&#12395; <code>allowNetworking</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65288;<code>object</code> &#12479;&#12464;&#12362;&#12424;&#12403; <code>embed</code> &#12479;&#12464;&#65289;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290; &#12383;&#12384;&#12375;&#12289;Adobe AIR &#12391;&#12399;&#12289;<code>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</code>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20869;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#20849;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#38480;&#12395;&#12424;&#12427;&#21046;&#38480;&#12434;&#21463;&#12369;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">connectionName</span>:<a href="../../String.html">String</a></code> &#8212; &#36865;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#36890;&#20449;&#12377;&#12427;&#12289;<code>connect()</code> &#12467;&#12510;&#12531;&#12489;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#25509;&#32154;&#21517;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">methodName</span>:<a href="../../String.html">String</a></code> &#8212; &#21463;&#20449;&#20596; LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12513;&#12477;&#12483;&#12489;&#12398;&#21517;&#21069;&#12290;&#27425;&#12398;&#12513;&#12477;&#12483;&#12489;&#21517;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;<code>send</code>&#12289;<code>connect</code>&#12289;<code>close</code>&#12289;<code>allowDomain</code>&#12289;<code>allowInsecureDomain</code>&#12289;<code>client</code>&#12289;&#12362;&#12424;&#12403; <code>domain</code>&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><a href="../../statements.html#..._(rest)_parameter">...</a> <span class="label">arguments</span></code> &#8212; &#25351;&#23450;&#12377;&#12427;&#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12377;&#36861;&#21152;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#12452;&#12505;&#12531;&#12488;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><b>securityError</b>:<a href="../../flash/events/SecurityErrorEvent.html"><code>SecurityErrorEvent</code></a></code> &#8212; <code>LocalConnection.send()</code> &#12399;&#12289;&#21628;&#12403;&#20986;&#12375;&#20803;&#12398;&#12467;&#12540;&#12489;&#12364;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451; Sandbox &#12363;&#12425; SWF &#12501;&#12449;&#12452;&#12523;&#12392;&#36890;&#20449;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#21839;&#38988;&#12399;&#12289;&#21463;&#20449;&#20596;&#12364; <code>LocalConnection.allowDomain()</code> &#12434;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12391;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>status</b>:<a href="../../flash/events/StatusEvent.html"><code>StatusEvent</code></a></code> &#8212; <code>Level</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364; <code>"status"</code> &#12398;&#22580;&#21512;&#12399;&#21628;&#12403;&#20986;&#12375;&#12364;&#25104;&#21151;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12289;<code>"error"</code> &#12398;&#22580;&#21512;&#12399;&#21628;&#12403;&#20986;&#12375;&#12364;&#22833;&#25943;&#12375;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#21463;&#20449;&#20596;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#25509;&#32154;&#12434;&#25298;&#21542;&#12375;&#12383;&#22580;&#21512;&#12289;&#21628;&#12403;&#20986;&#12375;&#12399;&#22833;&#25943;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; <code>connectionName</code> &#12414;&#12383;&#12399; <code>methodName</code> &#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#20516;&#12364; null &#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395; null &#20197;&#22806;&#12398;&#20516;&#12434;&#28193;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; &#12371;&#12398;&#12456;&#12521;&#12540;&#12399;&#12289;&#27425;&#12398;&#12358;&#12385;&#12356;&#12378;&#12428;&#12363;&#12398;&#29702;&#30001;&#12391;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;1) <code>connectionName</code> &#12414;&#12383;&#12399; <code>methodName</code> &#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#20516;&#12364;&#31354;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#12354;&#12427;&#22580;&#21512;&#12290;&#12371;&#12428;&#12425;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#26377;&#21177;&#12394;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#28193;&#12375;&#12414;&#12377;&#12290;2) <code>methodName</code> &#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12477;&#12483;&#12489;&#12364;&#21046;&#38480;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12290;3) &#36865;&#20449;&#12373;&#12428;&#12383;&#30452;&#21015;&#21270;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#22823;&#12365;&#12377;&#12366;&#12427;&#22580;&#21512;&#65288;40 K &#20197;&#19978;&#65289;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118666ade46-7c7e.html" target="_blank">Flash Player &#12362;&#12424;&#12403; AIR &#12398;&#20182;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#36890;&#20449;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#allowDomain()" target="">flash.net.LocalConnection.allowDomain()</a><br /><a href="LocalConnection.html#connect()" target="">flash.net.LocalConnection.connect()</a><br /><a href="LocalConnection.html#domain" target="">flash.net.LocalConnection.domain</a></div></div></span><div class="detailSectionHeader"> &#12452;&#12505;&#12531;&#12488;&#12398;&#35443;&#32048; </div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:asyncError" id="event:asyncError"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>asyncError</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/AsyncErrorEvent.html"><code>flash.events.AsyncErrorEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; AsyncErrorEvent.type  =  </span><a href="../../flash/events/AsyncErrorEvent.html#ASYNC_ERROR"><code>flash.events.AsyncErrorEvent.ASYNC_ERROR</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 &#38750;&#21516;&#26399;&#24418;&#24335;&#12391;&#12289;&#12388;&#12414;&#12426;&#12493;&#12452;&#12486;&#12451;&#12502;&#38750;&#21516;&#26399;&#12467;&#12540;&#12489;&#12363;&#12425;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
 </p>&#13;
	<code>AsyncErrorEvent.ASYNC_ERROR</code> &#23450;&#25968;&#12399;&#12289;<code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>asyncError</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#13;
	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290; </td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; </td></tr><tr><td><code>target</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>error</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12434;&#12488;&#12522;&#12460;&#12540;&#12375;&#12383;&#12456;&#12521;&#12540;&#12391;&#12377;&#12290;</td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:securityError" id="event:securityError"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>securityError</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/SecurityErrorEvent.html"><code>flash.events.SecurityErrorEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; SecurityErrorEvent.type  =  </span><a href="../../flash/events/SecurityErrorEvent.html#SECURITY_ERROR"><code>flash.events.SecurityErrorEvent.SECURITY_ERROR</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 <code>LocalConnection.send()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12391;&#12289;&#30064;&#12394;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12395;&#12487;&#12540;&#12479;&#12434;&#36865;&#20449;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
	<code>SecurityErrorEvent.SECURITY_ERROR</code> &#23450;&#25968;&#12399;&#12289;<code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>securityError</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#13;
	&#13;
	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12456;&#12521;&#12540;&#12434;&#22577;&#21578;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>text</code></td><td>&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12427;&#12486;&#12461;&#12473;&#12488;&#12391;&#12377;&#12290;</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#send()" target="">send()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:status" id="event:status"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>status</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/StatusEvent.html"><code>flash.events.StatusEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; StatusEvent.type  =  </span><a href="../../flash/events/StatusEvent.html#STATUS"><code>flash.events.StatusEvent.STATUS</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 LocalConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12473;&#12486;&#12540;&#12479;&#12473;&#12434;&#22577;&#21578;&#12377;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>LocalConnection.send()</code> &#12364;&#27491;&#24120;&#12395;&#23455;&#34892;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;<code>status</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>level</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399; <code>"status"</code> &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#21628;&#12403;&#20986;&#12375;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12289;<code>level</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399; <code>"error"</code> &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#21463;&#20449;&#20596;&#12501;&#12449;&#12452;&#12523;&#12391;&#25509;&#32154;&#12364;&#25298;&#21542;&#12373;&#12428;&#12427;&#12392;&#12289;&#36865;&#20449;&#20596;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#36890;&#30693;&#12394;&#12375;&#12391;&#21628;&#12403;&#20986;&#12375;&#12364;&#22833;&#25943;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
 &#13;
 </p>&#13;
     <code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>status</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#13;
	 <p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	 <table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>code</code></td><td>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12398;&#35500;&#26126;&#12391;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>level</code></td><td><code>"status"</code>&#12289;<code>"warning"</code>&#12289;<code>"error"</code> &#12394;&#12393;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12459;&#12486;&#12468;&#12522;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12381;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12434;&#12524;&#12509;&#12540;&#12488;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocalConnection.html#send()" target="">LocalConnection.send()</a></div></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">LocalConnectionSenderExample.as</div><br /><div class="detailBody"> &#12371;&#12398;&#12469;&#12531;&#12503;&#12523;&#12399;&#12289;2 &#12388;&#12398;&#30064;&#12394;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#24517;&#35201;&#12398;&#12354;&#12427; 2 &#12388;&#12398; ActionScript &#12463;&#12521;&#12473;&#12363;&#12425;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>LocalConnectionSenderExample SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12399; LocalConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;&#12508;&#12479;&#12531;&#12364;&#25276;&#12373;&#12428;&#12427;&#12392; <code>call()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390; SWF &#12501;&#12449;&#12452;&#12523;&#20869;&#12398; <code>lcHandler</code> &#12392;&#12356;&#12358;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12392;&#12365;&#25509;&#32154;&#21517; "myConnection" &#12364;&#20351;&#29992;&#12373;&#12428;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390; TextField &#12398;&#20869;&#23481;&#12364;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
 <p>LocalConnectionReceiverExample SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12399; LocalConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;<code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#12289;&#12371;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#25509;&#32154;&#21517; "myConnection" &#23451;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#21463;&#20449;&#32773;&#12395;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#12373;&#12425;&#12395;&#12371;&#12398;&#12463;&#12521;&#12473;&#12395;&#12399;&#12289;<code>lcHandler()</code> &#12392;&#12356;&#12358;&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;LocalConnectionSenderExample SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#12424;&#12387;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12513;&#12477;&#12483;&#12489;&#12391;&#12377;&#12290;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12392;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390;&#28193;&#12373;&#12428;&#12427;&#12486;&#12461;&#12473;&#12488;&#12364;&#12473;&#12486;&#12540;&#12472;&#19978;&#12398; TextField &#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
 <p><b>&#27880;&#24847;&#65306;</b>&#12371;&#12398;&#20363;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;&#20001;&#26041;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#21516;&#12376;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#19978;&#12395;&#21516;&#26178;&#12395;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
&#13;
// Code in LocalConnectionSenderExample.as&#13;
package {&#13;
    import flash.display.Sprite;&#13;
    import flash.events.MouseEvent;&#13;
    import flash.net.LocalConnection;&#13;
    import flash.text.TextField;&#13;
    import flash.text.TextFieldType;&#13;
    import flash.events.StatusEvent;&#13;
    import flash.text.TextFieldAutoSize;&#13;
&#13;
    public class LocalConnectionSenderExample extends Sprite {&#13;
        private var conn:LocalConnection;&#13;
        &#13;
        // UI elements&#13;
        private var messageLabel:TextField;&#13;
        private var message:TextField;&#13;
        private var sendBtn:Sprite;&#13;
        &#13;
        public function LocalConnectionSenderExample() {&#13;
            buildUI();&#13;
            sendBtn.addEventListener(MouseEvent.CLICK, sendMessage);&#13;
            conn = new LocalConnection();&#13;
            conn.addEventListener(StatusEvent.STATUS, onStatus);&#13;
        }&#13;
        &#13;
        private function sendMessage(event:MouseEvent):void {&#13;
            conn.send("myConnection", "lcHandler", message.text);&#13;
        }&#13;
        &#13;
        private function onStatus(event:StatusEvent):void {&#13;
            switch (event.level) {&#13;
                case "status":&#13;
                    trace("LocalConnection.send() succeeded");&#13;
                    break;&#13;
                case "error":&#13;
                    trace("LocalConnection.send() failed");&#13;
                    break;&#13;
            }&#13;
        }&#13;
        &#13;
        private function buildUI():void {&#13;
            const hPadding:uint = 5;&#13;
            // messageLabel&#13;
            messageLabel = new TextField();&#13;
            messageLabel.x = 10;&#13;
            messageLabel.y = 10;&#13;
            messageLabel.text = "Text to send:";&#13;
            messageLabel.autoSize = TextFieldAutoSize.LEFT;&#13;
            addChild(messageLabel);&#13;
            &#13;
            // message&#13;
            message = new TextField();&#13;
            message.x = messageLabel.x + messageLabel.width + hPadding;&#13;
            message.y = 10;&#13;
            message.width = 120;&#13;
            message.height = 20;&#13;
            message.background = true;&#13;
            message.border = true;&#13;
            message.type = TextFieldType.INPUT;&#13;
            addChild(message);&#13;
            &#13;
            // sendBtn&#13;
            sendBtn = new Sprite();&#13;
            sendBtn.x = message.x + message.width + hPadding;&#13;
            sendBtn.y = 10;&#13;
            var sendLbl:TextField = new TextField();&#13;
            sendLbl.x = 1 + hPadding;&#13;
            sendLbl.y = 1;&#13;
            sendLbl.selectable = false;&#13;
            sendLbl.autoSize = TextFieldAutoSize.LEFT;&#13;
            sendLbl.text = "Send";&#13;
            sendBtn.addChild(sendLbl);&#13;
            sendBtn.graphics.lineStyle(1);&#13;
            sendBtn.graphics.beginFill(0xcccccc);&#13;
            sendBtn.graphics.drawRoundRect(0, 0, (sendLbl.width + 2 + hPadding + hPadding), (sendLbl.height + 2), 5, 5);&#13;
            sendBtn.graphics.endFill();&#13;
            addChild(sendBtn);&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><span id="pageFilter"><div class="exampleHeader">LocalConnectionReceiverExample.as</div><br /><div class="detailBody"><div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
// Code in LocalConnectionReceiverExample.as&#13;
package {&#13;
    import flash.display.Sprite;&#13;
    import flash.net.LocalConnection;&#13;
    import flash.text.TextField;&#13;
&#13;
    public class LocalConnectionReceiverExample extends Sprite {&#13;
        private var conn:LocalConnection;&#13;
        private var output:TextField;&#13;
        &#13;
        public function LocalConnectionReceiverExample()     {&#13;
            buildUI();&#13;
            &#13;
            conn = new LocalConnection();&#13;
            conn.client = this;&#13;
            try {&#13;
                conn.connect("myConnection");&#13;
            } catch (error:ArgumentError) {&#13;
                trace("Can't connect...the connection name is already being used by another SWF");&#13;
            }&#13;
        }&#13;
        &#13;
        public function lcHandler(msg:String):void {&#13;
            output.appendText(msg + "\n");&#13;
        }&#13;
        &#13;
        private function buildUI():void {&#13;
            output = new TextField();&#13;
            output.background = true;&#13;
            output.border = true;&#13;
            output.wordWrap = true;&#13;
            addChild(output);&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>