<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:9" /><meta name="runtime" content="lite" /><meta name="runtimever" content="lite:4" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:9" /><meta name="product" content="lite" /><meta name="productver" content="lite:4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="SharedObject,flash.net.SharedObject,client,data,defaultObjectEncoding,fps,objectEncoding,preventBackup,size,clear,close,connect,flush,getLocal,getRemote,send,setDirty,setProperty" /><title>SharedObject - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.net</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  SharedObject</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">SharedObject  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
 SharedObject &#12463;&#12521;&#12473;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12414;&#12383;&#12399;&#12469;&#12540;&#12496;&#12540;&#19978;&#12391;&#38480;&#23450;&#12373;&#12428;&#12383;&#37327;&#12398;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#36796;&#12415;&#12362;&#12424;&#12403;&#26684;&#32013;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12525;&#12540;&#12459;&#12523;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12414;&#12383;&#12399;&#12522;&#12514;&#12540;&#12488;&#12469;&#12540;&#12496;&#12540;&#19978;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488; SWF &#12501;&#12449;&#12452;&#12523;&#12392;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#38291;&#12391;&#12289;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12391;&#12487;&#12540;&#12479;&#12434;&#20849;&#26377;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12502;&#12521;&#12454;&#12470;&#12540;&#12398;&#12463;&#12483;&#12461;&#12540;&#12395;&#20284;&#12390;&#12362;&#12426;&#12289;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12487;&#12540;&#12479;&#36578;&#36865;&#12487;&#12496;&#12452;&#12473;&#12395;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;Adobe Flash Media Server &#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#13;
 &#13;
 <p>&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#27425;&#12398;&#25805;&#20316;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <ul><li>&#13;
                     <b>&#12525;&#12540;&#12459;&#12523;&#12398;&#27704;&#32154;&#24615;&#12434;&#32173;&#25345;&#12377;&#12427;</b>&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12371;&#12428;&#12364;&#26368;&#12418;&#31777;&#21336;&#12394;&#26041;&#27861;&#12391;&#12289;Flash Media Server &#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;&#20363;&#12360;&#12400;&#12289;<code>SharedObject.getLocal()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12395;&#12513;&#12514;&#12522;&#20184;&#12365;&#38651;&#21331;&#12394;&#12393;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12364;&#38651;&#21331;&#12434;&#38281;&#12376;&#12427;&#12392;&#12289;Flash Player &#12395;&#12424;&#12426;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26368;&#24460;&#12398;&#20516;&#12364;&#12518;&#12540;&#12470;&#12540;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;&#27425;&#12395;&#38651;&#21331;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;&#38651;&#21331;&#12395;&#21069;&#12398;&#20516;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#38651;&#21331;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38281;&#12376;&#12427;&#21069;&#12395;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code>null</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#27425;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36215;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#38651;&#21331;&#12395;&#12356;&#12378;&#12428;&#12398;&#20516;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12381;&#12398;&#20182;&#12398;&#12525;&#12540;&#12459;&#12523;&#12398;&#27704;&#32154;&#24615;&#12398;&#31649;&#29702;&#20363;&#12392;&#12375;&#12390;&#12399;&#12289;&#35079;&#38609;&#12394; Web &#12469;&#12452;&#12488;&#12398;&#12518;&#12540;&#12470;&#12540;&#29872;&#22659;&#35373;&#23450;&#12420;&#12381;&#12398;&#20182;&#12398;&#12487;&#12540;&#12479;&#65288;&#12491;&#12517;&#12540;&#12473;&#12469;&#12452;&#12488;&#19978;&#12391;&#12518;&#12540;&#12470;&#12540;&#12364;&#38322;&#35239;&#12375;&#12383;&#35352;&#20107;&#12398;&#12524;&#12467;&#12540;&#12489;&#12394;&#12393;&#65289;&#12398;&#12488;&#12521;&#12483;&#12461;&#12531;&#12464;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#24773;&#22577;&#12434;&#12488;&#12521;&#12483;&#12461;&#12531;&#12464;&#12377;&#12427;&#12392;&#12289;&#26032;&#35215;&#12391;&#26410;&#35501;&#12398;&#35352;&#20107;&#12391;&#12394;&#12367;&#12289;&#26082;&#12395;&#38322;&#35239;&#12373;&#12428;&#12383;&#35352;&#20107;&#12434;&#34920;&#31034;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#24773;&#22577;&#12434;&#12518;&#12540;&#12470;&#12540;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12395;&#20445;&#23384;&#12377;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#36000;&#33655;&#12434;&#21066;&#28187;&#12391;&#12365;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#13;
                     <b>Flash Media Server &#12395;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12362;&#12424;&#12403;&#20849;&#26377;&#12377;&#12427;</b>&#12290;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;&#20182;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#21462;&#24471;&#21487;&#33021;&#12394;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>SharedObject.getRemote()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#38651;&#35441;&#24115;&#12394;&#12393;&#12398;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#19978;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;&#12354;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289;&#29694;&#22312;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12362;&#12424;&#12403;&#24460;&#12391;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12377;&#12409;&#12390;&#12364;&#12289;&#22793;&#26356;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12525;&#12540;&#12459;&#12523;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12365;&#12395;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12487;&#12540;&#12479;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289;&#27425;&#22238;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;&#12487;&#12540;&#12479;&#12364;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#13;
                     <b>&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12391;&#12487;&#12540;&#12479;&#12434;&#20849;&#26377;&#12377;&#12427;</b>&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#35079;&#25968;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#38291;&#12391;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#12487;&#12540;&#12479;&#12434;&#20849;&#26377;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12481;&#12515;&#12483;&#12488;&#12523;&#12540;&#12512;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;&#12522;&#12473;&#12488;&#12434;&#26684;&#32013;&#12377;&#12427;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38283;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12364;&#12481;&#12515;&#12483;&#12488;&#12523;&#12540;&#12512;&#12395;&#20837;&#36864;&#23460;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#26356;&#26032;&#12373;&#12428;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#12289;&#26356;&#26032;&#24460;&#12398;&#12481;&#12515;&#12483;&#12488;&#12523;&#12540;&#12512;&#12518;&#12540;&#12470;&#12540;&#12398;&#19968;&#35239;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
               </ul><p> &#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>SharedObject.getLocal()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>SharedObject.getRemote()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;</p> &#13;
 &#13;
               <p> &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38281;&#12376;&#12427;&#12392;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;<i>&#20445;&#23384;</i>&#12373;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<code>flush()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12487;&#12540;&#12479;&#12434;&#26126;&#31034;&#30340;&#12395;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12416;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#12525;&#12540;&#12459;&#12523;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12395;&#12388;&#12356;&#12390;&#12398;&#32771;&#24942;&#20107;&#38917;&#12290;</b> &#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#35373;&#35336;&#12377;&#12427;&#38555;&#12395;&#32771;&#24942;&#12364;&#24517;&#35201;&#12394;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#21046;&#38480;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26360;&#12365;&#36796;&#12415;&#12364;&#35377;&#21487;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12487;&#12540;&#12479;&#12364;&#12289;&#12431;&#12363;&#12425;&#12394;&#12356;&#12358;&#12385;&#12395;&#21066;&#38500;&#12373;&#12428;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;Flash Player &#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#20491;&#12293;&#12398;&#12489;&#12513;&#12452;&#12531;&#12414;&#12383;&#12399;&#12377;&#12409;&#12390;&#12398;&#12489;&#12513;&#12452;&#12531;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12434;&#31649;&#29702;&#12391;&#12365;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12364;&#20351;&#29992;&#21487;&#33021;&#12394;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12398;&#37327;&#12434;&#28187;&#12425;&#12377;&#12392;&#12289;&#19968;&#37096;&#12398;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Flash Player &#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12399;&#12289;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12489;&#12513;&#12452;&#12531;&#65288;&#29694;&#22312;&#12398;&#12502;&#12521;&#12454;&#12470;&#12540;&#12398;&#12450;&#12489;&#12524;&#12473;&#12496;&#12540;&#12395;&#12354;&#12427;&#12489;&#12513;&#12452;&#12531;&#20197;&#22806;&#12398;&#12489;&#12513;&#12452;&#12531;&#65289;&#12395;&#12424;&#12427;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35501;&#12415;&#21462;&#12426;&#12414;&#12383;&#12399;&#26360;&#12365;&#36796;&#12415;&#12434;&#38450;&#27490;&#12391;&#12365;&#12427;&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#27231;&#33021;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;Mac OS &#12391;&#12399; AIR 3.3 &#20197;&#38477;&#12395;&#12289;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#25152;&#12364;&#22793;&#26356;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;3.3 &#21517;&#21069;&#31354;&#38291;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#23455;&#38555;&#12395;&#12399;&#28040;&#22833;&#12375;&#12390;&#12356;&#12394;&#12356;&#12398;&#12395;&#12289;&#28040;&#22833;&#12375;&#12383;&#12424;&#12358;&#12394;&#29366;&#24907;&#12395;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#27880;&#24847;&#65306;</b>&#12522;&#12514;&#12540;&#12488;&#12469;&#12540;&#12496;&#12540;&#12391;&#12399;&#12394;&#12367;&#12525;&#12540;&#12459;&#12523;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12395;&#26684;&#32013;&#12362;&#12424;&#12403;&#23455;&#34892;&#12373;&#12428;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#24120;&#12395;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;Flash Player &#12398;&#12504;&#12523;&#12503;&#12398;&#12300;<a href="http://www.macromedia.com/support/documentation/jp/flashplayer/help/settings_manager03.html" target="external">&#12464;&#12525;&#12540;&#12496;&#12523;&#12473;&#12488;&#12524;&#12540;&#12472;&#35373;&#23450;&#12497;&#12493;&#12523;</a>&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
               <p>&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12398;&#37327;&#12392;&#12518;&#12540;&#12470;&#12540;&#12398;&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12395;&#38306;&#12377;&#12427;&#22833;&#25943;&#12395;&#12388;&#12356;&#12390;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;<code>getLocal()</code> &#12362;&#12424;&#12403; <code>flush()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#26178;&#12395;&#12371;&#12428;&#12425;&#12398;&#12481;&#12455;&#12483;&#12463;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
 </p><ul><li>&#13;
                        <code>SharedObject.getLocal()</code>  &#12518;&#12540;&#12470;&#12540;&#12364;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#28961;&#21177;&#12395;&#12375;&#12390;&#12356;&#12390;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12489;&#12513;&#12452;&#12531;&#12392;&#12502;&#12521;&#12454;&#12470;&#12540;&#12398;&#12450;&#12489;&#12524;&#12473;&#12496;&#12540;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12489;&#12513;&#12452;&#12531;&#12364;&#19968;&#33268;&#12375;&#12394;&#12356;&#22580;&#21512;&#12394;&#12393;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#22833;&#25943;&#12377;&#12427;&#12392;&#12289;Flash Player &#12399;&#20363;&#22806;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#13;
                        <code>SharedObject.flush()</code>  &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#22833;&#25943;&#12377;&#12427;&#12392;&#12289;Flash Player &#12399;&#20363;&#22806;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;&#21628;&#12403;&#20986;&#12375;&#12395;&#25104;&#21151;&#12377;&#12427;&#12392;&#12289;<code>SharedObjectFlushStatus.FLUSHED</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#36861;&#21152;&#12398;&#35352;&#25014;&#22495;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12399;&#12289;<code>SharedObjectFlushStatus.PENDING</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;Flash Player &#12399;&#12525;&#12540;&#12459;&#12523;&#12395;&#20445;&#23384;&#12377;&#12427;&#24773;&#22577;&#29992;&#12398;&#35352;&#25014;&#22495;&#12434;&#22679;&#21152;&#12377;&#12427;&#12424;&#12358;&#12395;&#12518;&#12540;&#12470;&#12540;&#12395;&#35201;&#27714;&#12375;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;<code>netStatus</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#20445;&#23384;&#12395;&#22833;&#25943;&#12375;&#12383;&#12363;&#25104;&#21151;&#12375;&#12383;&#12363;&#12434;&#31034;&#12377;&#24773;&#22577;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#19968;&#32210;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  </ul><p>SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12414;&#12383;&#12399;&#22793;&#26356;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#22580;&#21512;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#24133;&#12364;&#26368;&#20302;&#12391;&#12418; 215 &#12500;&#12463;&#12475;&#12523;&#12289;&#39640;&#12373;&#12364;&#26368;&#20302;&#12391;&#12418; 138 &#12500;&#12463;&#12475;&#12523;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;&#12469;&#12452;&#12474;&#12399;&#12289;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#65288;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35352;&#25014;&#22495;&#21046;&#38480;&#12434;&#22679;&#12420;&#12377;&#12363;&#12393;&#12358;&#12363;&#12434;&#12518;&#12540;&#12470;&#12540;&#12395;&#30906;&#35469;&#12377;&#12427;&#65289;&#12434;&#34920;&#31034;&#12377;&#12427;&#12383;&#12417;&#12398;&#26368;&#23567;&#12398;&#22823;&#12365;&#12373;&#12391;&#12377;&#12290;SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12371;&#12398;&#22823;&#12365;&#12373;&#12424;&#12426;&#12418;&#23567;&#12373;&#12367;&#12289;&#35352;&#25014;&#22495;&#21046;&#38480;&#12434;&#22679;&#12420;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;<code>SharedObject.flush()</code> &#12399;&#22833;&#25943;&#12375;&#12289;<code>SharedObjectFlushedStatus.PENDING</code> &#12434;&#36820;&#12375;&#12289;<code>netStatus</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290;</b> Flash Media Server &#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12391;&#20849;&#26377;&#12377;&#12427;&#12289;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12362;&#12424;&#12403;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12354;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#20363;&#12360;&#12400;&#12289;&#12510;&#12523;&#12481;&#12503;&#12524;&#12540;&#12516;&#12540;&#12466;&#12540;&#12512;&#12398;&#12518;&#12540;&#12470;&#12540;&#12394;&#12393;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#21516;&#26399;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
 &#13;
               <p>&#13;
 &#21508;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395; <code>data</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12388;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;<code>setProperty()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#26356;&#26032;&#12375;&#12289;<code>sync</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12375;&#12289;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36820;&#36865;&#12375;&#12414;&#12377;&#12290; &#13;
 </p>&#13;
 &#13;
               <p>&#13;
 &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12289;&#12469;&#12540;&#12496;&#12540;&#12289;&#12414;&#12383;&#12399;&#12381;&#12398;&#20001;&#26041;&#12398;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27704;&#32154;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12469;&#12452;&#12474;&#12364;&#26368;&#22823; 100K &#12398;&#27704;&#32154;&#30340;&#12394;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12525;&#12540;&#12459;&#12523;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;&#22823;&#12365;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20445;&#23384;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#12525;&#12540;&#12459;&#12523;&#35352;&#25014;&#38936;&#22495;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12391;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#29992;&#12398;&#12525;&#12540;&#12459;&#12523;&#35352;&#25014;&#22495;&#12398;&#20351;&#29992;&#12434;&#35377;&#21487;&#12414;&#12383;&#12399;&#25298;&#21542;&#12391;&#12365;&#12414;&#12377;&#12290;&#12473;&#12486;&#12540;&#12472;&#12398;&#12469;&#12452;&#12474;&#12399;&#24517;&#12378; 215 &#215; 138 &#12500;&#12463;&#12475;&#12523;&#20197;&#19978;&#12395;&#35373;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12428;&#12399;&#12289;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#26368;&#23567;&#12469;&#12452;&#12474;&#12391;&#12377;&#12290;&#13;
 </p>&#13;
               <p>&#13;
 &#12518;&#12540;&#12470;&#12540;&#12364;&#12300;&#35377;&#21487;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#20445;&#23384;&#12373;&#12428;&#12289;<code>netStatus</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12392;&#12365;&#12398; <code>code</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; <code>SharedObject.Flush.Success</code> &#12391;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12364;&#12300;&#25298;&#21542;&#12301;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#20445;&#23384;&#12373;&#12428;&#12378;&#12289;<code>netStatus</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12392;&#12365;&#12398; <code>code</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; <code>SharedObject.Flush.Failed</code> &#12391;&#12377;&#12290;&#13;
 </p>&#13;
 &#13;
            <p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#flush()" target="">flush()</a><br /><a href="SharedObject.html#getLocal()" target="">getLocal()</a><br /><a href="SharedObject.html#event:netStatus" target="">netStatus</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#client" class="signatureLink">client</a> : <a href="../../Object.html">Object</a><div class="summaryTableDescription">&#13;
     &#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#data" class="signatureLink">data</a> : <a href="../../Object.html">Object</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
     &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; data &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#23646;&#24615;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#23646;&#24615;&#12399;&#20849;&#26377;&#12362;&#12424;&#12403;&#20445;&#23384;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#defaultObjectEncoding" class="signatureLink">defaultObjectEncoding</a> : <a href="../../uint.html">uint</a><div class="summaryTableDescription">[&#38745;&#30340;] &#13;
     SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#20316;&#25104;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12456;&#12531;&#12467;&#12540;&#12489;&#65288;AMF &#12496;&#12540;&#12472;&#12519;&#12531;&#65289;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#fps" class="signatureLink">fps</a> : <a href="../../Number.html">Number</a><div class="summaryTableDescription">[&#26360;&#12365;&#36796;&#12415;&#23554;&#29992;] &#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#22793;&#26356;&#12364;&#12469;&#12540;&#12496;&#12540;&#12395;&#36865;&#20449;&#12373;&#12428;&#12427;&#22238;&#25968;&#65288;1 &#31186;&#12354;&#12383;&#12426;&#65289;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#objectEncoding" class="signatureLink">objectEncoding</a> : <a href="../../uint.html">uint</a><div class="summaryTableDescription">&#13;
     &#12371;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12456;&#12531;&#12467;&#12540;&#12489;&#65288;AMF &#12496;&#12540;&#12472;&#12519;&#12531;&#65289;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="AIR::3.7##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#preventBackup" class="signatureLink">preventBackup</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#38745;&#30340;] &#13;
     &#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; iOS &#12398;&#12463;&#12521;&#12454;&#12489;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12469;&#12540;&#12499;&#12473;&#12391;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#size" class="signatureLink">size</a> : <a href="../../uint.html">uint</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29694;&#22312;&#12398;&#12469;&#12452;&#12474;&#65288;&#12496;&#12452;&#12488;&#25968;&#65289;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#clear()" class="signatureLink">clear</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12434;&#28040;&#21435;&#12375;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12487;&#12451;&#12473;&#12463;&#12363;&#12425;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#close()" class="signatureLink">close</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12469;&#12540;&#12496;&#12540;&#12392;&#12398;&#38291;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#connect()" class="signatureLink">connect</a>(myConnection:<a href="../../flash/net/NetConnection.html">NetConnection</a>, params:<a href="../../String.html">String</a> = null):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#25351;&#23450;&#12375;&#12383; NetConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20171;&#12375;&#12390;&#12289;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#flush()" class="signatureLink">flush</a>(minDiskSpace:<a href="../../int.html">int</a> = 0):<a href="../../String.html">String</a></div><div class="summaryTableDescription">&#13;
     &#12525;&#12540;&#12459;&#12523;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#30452;&#12385;&#12395;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#getLocal()" class="signatureLink">getLocal</a>(name:<a href="../../String.html">String</a>, localPath:<a href="../../String.html">String</a> = null, secure:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../flash/net/SharedObject.html">SharedObject</a></div><div class="summaryTableDescription">[&#38745;&#30340;] &#13;
  &#29694;&#22312;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12384;&#12369;&#12364;&#21033;&#29992;&#12391;&#12365;&#12427;&#12525;&#12540;&#12459;&#12523;&#27704;&#32154;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#getRemote()" class="signatureLink">getRemote</a>(name:<a href="../../String.html">String</a>, remotePath:<a href="../../String.html">String</a> = null, persistence:<a href="../../Object.html">Object</a> = false, secure:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../flash/net/SharedObject.html">SharedObject</a></div><div class="summaryTableDescription">[&#38745;&#30340;] &#13;
     &#35079;&#25968;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12289;Flash Media Server &#19978;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#send()" class="signatureLink">send</a>(<a href="../../statements.html#..._(rest)_parameter">...</a> arguments):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#65288;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#20449;&#12375;&#12383;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12418;&#21547;&#12416;&#65289;&#12395;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#setDirty()" class="signatureLink">setDirty</a>(propertyName:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#12469;&#12540;&#12496;&#12540;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#setProperty()" class="signatureLink">setProperty</a>(propertyName:<a href="../../String.html">String</a>, value:<a href="../../Object.html">Object</a> = null):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#26356;&#26032;&#12375;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#12469;&#12540;&#12496;&#12540;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">SharedObject</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:asyncError" class="signatureLink">asyncError</a></div></td><td class="summaryTableDescription summaryTableCol">&#38750;&#21516;&#26399;&#24418;&#24335;&#12391;&#12289;&#12388;&#12414;&#12426;&#12493;&#12452;&#12486;&#12451;&#12502;&#38750;&#21516;&#26399;&#12467;&#12540;&#12489;&#12363;&#12425;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:netStatus" class="signatureLink">netStatus</a></div></td><td class="summaryTableDescription summaryTableCol">SharedObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12289;&#12381;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12414;&#12383;&#12399;&#12456;&#12521;&#12540;&#12398;&#29366;&#27841;&#12434;&#12524;&#12509;&#12540;&#12488;&#12377;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">SharedObject</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:sync" class="signatureLink">sync</a></div></td><td class="summaryTableDescription summaryTableCol">&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12469;&#12540;&#12496;&#12540;&#12395;&#12424;&#12387;&#12390;&#26356;&#26032;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">SharedObject</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/client" class="dashAnchor" id="//apple_ref/cpp/Property/client"></a><a name="client" id="client"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>client</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>client:<a href="../../Object.html">Object</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; <code>this</code> &#12391;&#12377;&#12290;client &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21029;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35373;&#23450;&#12375;&#12289;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12434;&#12381;&#12398;&#21029;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get client():<a href="../../Object.html">Object</a></code><br /><code>&#160;&#160;&#160;&#160;public function set client(value:<a href="../../Object.html">Object</a>):<a href="../../specialTypes.html#void">void</a></code><br /><br /><span class="label"> &#20363;&#22806; </span><br /><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; <code>client</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;null &#20197;&#22806;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/data" class="dashAnchor" id="//apple_ref/cpp/Property/data"></a><a name="data" id="data"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>data</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>data:<a href="../../Object.html">Object</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>data</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#23646;&#24615;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#23646;&#24615;&#12399;&#20849;&#26377;&#12362;&#12424;&#12403;&#20445;&#23384;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#12382;&#12428;&#12398;&#23646;&#24615;&#12399;&#12289;ActionScript &#12414;&#12383;&#12399; JavaScript &#12479;&#12452;&#12503;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;Array&#12289;Number&#12289;Boolean&#12289;ByteArray&#12289;XML &#12394;&#12393;&#12391;&#12377;&#12290;&#27425;&#12398;&#12467;&#12540;&#12489;&#12391;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21508;&#31278;&#23646;&#24615;&#12395;&#20516;&#12434;&#21106;&#12426;&#24403;&#12390;&#12390;&#12356;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
     var items_array:Array = new Array(101, 346, 483);&#13;
     var currentUserIsAdmin:Boolean = true;&#13;
     var currentUserName:String = "Ramona";&#13;
     &#13;
     var my_so:SharedObject = SharedObject.getLocal("superfoo");&#13;
     my_so.data.itemNumbers = items_array;&#13;
     my_so.data.adminPrivileges = currentUserIsAdmin;&#13;
     my_so.data.userName = currentUserName;&#13;
     &#13;
     for (var prop in my_so.data) {&#13;
       trace(prop+": "+my_so.data[prop]);&#13;
     }&#13;
     </pre></div>&#13;
     &#13;
     &#13;
     &#13;
     <p>&#27704;&#32154;&#30340;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>data</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12377;&#12409;&#12390;&#12398;&#23646;&#24615;&#12364;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#27425;&#12398;&#24773;&#22577;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
     userName: Ramona&#13;
     adminPrivileges: true&#13;
     itemNumbers: 101,346,483&#13;
     </pre></div>&#13;
     &#13;
     <p><b>&#27880;&#24847;&#65306;</b>&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>data</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12289;<code>so.data = someValue</code> &#12398;&#12424;&#12358;&#12395;&#20516;&#12434;&#30452;&#25509;&#21106;&#12426;&#24403;&#12390;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#21106;&#12426;&#24403;&#12390;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23646;&#24615;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;<code>delete so.data.attributeName</code> &#12392;&#12356;&#12358;&#12467;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23646;&#24615;&#12434; <code>null</code> &#12414;&#12383;&#12399; <code>undefined</code> &#12395;&#35373;&#23450;&#12375;&#12390;&#12418;&#12289;&#23646;&#24615;&#12399;&#21066;&#38500;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p>&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;<i>&#12503;&#12521;&#12452;&#12505;&#12540;&#12488;</i>&#20516;&#65288;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20351;&#29992;&#20013;&#12395;&#12381;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12398;&#12415;&#21033;&#29992;&#12391;&#12365;&#12289;&#38281;&#12376;&#12427;&#12392;&#12365;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#20849;&#12395;&#20445;&#23384;&#12373;&#12428;&#12394;&#12356;&#20516;&#65289;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>data</code> &#20197;&#22806;&#12398;&#21517;&#21069;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20316;&#25104;&#12375;&#12390;&#12289;&#12381;&#12398;&#20516;&#12434;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
     var my_so:SharedObject = SharedObject.getLocal("superfoo");&#13;
     my_so.favoriteColor = "blue";&#13;
     my_so.favoriteNightClub = "The Bluenote Tavern";&#13;
     my_so.favoriteSong = "My World is Blue";&#13;
     &#13;
     for (var prop in my_so) {&#13;
       trace(prop+": "+my_so[prop]);&#13;
     }&#13;
     </pre></div>&#13;
     &#13;
     &#13;
     &#13;
     <p>&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#27425;&#12398;&#12487;&#12540;&#12479;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
     favoriteSong: My World is Blue&#13;
     favoriteNightClub: The Bluenote Tavern&#13;
     favoriteColor: blue&#13;
     data: [object Object]&#13;
     </pre></div>&#13;
     &#13;
     <p>&#13;
     &#12469;&#12540;&#12496;&#12540;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364; <code>data</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12377;&#12409;&#12390;&#12398;&#23646;&#24615;&#12434;&#21033;&#29992;&#21487;&#33021;&#12391;&#12289;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12377;&#12409;&#12390;&#12398;&#23646;&#24615;&#12364;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;&#12354;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#23646;&#24615;&#12398;&#20516;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#26032;&#12375;&#12356;&#20516;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get data():<a href="../../Object.html">Object</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#getLocal()" target="">getLocal()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/defaultObjectEncoding" class="dashAnchor" id="//apple_ref/cpp/Property/defaultObjectEncoding"></a><a name="defaultObjectEncoding" id="defaultObjectEncoding"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>defaultObjectEncoding</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>defaultObjectEncoding:<a href="../../uint.html">uint</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#20316;&#25104;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12456;&#12531;&#12467;&#12540;&#12489;&#65288;AMF &#12496;&#12540;&#12472;&#12519;&#12531;&#65289;&#12391;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12427;&#12392;&#12365;&#12289;<code>SharedObject.defaultObjectEncoding</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12398;&#12354;&#12427; Action Message Format &#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;ActionScript 3.0 &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#65288;AMF3&#65289;&#12414;&#12383;&#12399; ActionScript 1.0 &#12414;&#12383;&#12399; 2.0 &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#65288;AMF0&#65289;&#12391;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12456;&#12531;&#12467;&#12540;&#12489;&#12398;&#36949;&#12356;&#12434;&#21547;&#12416;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12456;&#12531;&#12467;&#12540;&#12489;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<code>objectEncoding</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><code>SharedObject.defaultObjectEncoding</code> &#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;ActionScript 3.0 &#12501;&#12457;&#12540;&#12510;&#12483;&#12488; AMF3 &#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;ActionScript 2.0 &#12414;&#12383;&#12399; 1.0 SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#35501;&#12415;&#36796;&#12417;&#12427;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26360;&#12365;&#36796;&#12415;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#21069;&#12395;&#12289;&#12473;&#12463;&#12522;&#12503;&#12488;&#12398;&#20808;&#38957;&#37096;&#20998;&#12391; <code>SharedObject.defaultObjectEncoding</code> &#12434;&#35373;&#23450;&#12375;&#12390;&#12289;ActionScript 1.0 &#12414;&#12383;&#12399; ActionScript 2.0 &#12501;&#12457;&#12540;&#12510;&#12483;&#12488; <code>flash.net.ObjectEncoding.AMF0</code> &#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#38477;&#12395;&#20316;&#25104;&#12373;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12289;AMF0 &#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12364;&#20351;&#29992;&#12373;&#12428;&#12289;&#21476;&#12356;&#12467;&#12531;&#12486;&#12531;&#12484;&#12392;&#12420;&#12426;&#21462;&#12426;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12383;&#24460;&#12399;&#12289;&#26082;&#23384;&#12398;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>objectEncoding</code> &#20516;&#12434; <code>SharedObject.defaultObjectEncoding</code> &#12434;&#35373;&#23450;&#12375;&#12390;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p>SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#20316;&#25104;&#12375;&#12383;&#12377;&#12409;&#12390;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12372;&#12392;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12456;&#12531;&#12467;&#12540;&#12489;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>objectEncoding</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public static function get defaultObjectEncoding():<a href="../../uint.html">uint</a></code><br /><code>&#160;&#160;&#160;&#160;public static function set defaultObjectEncoding(value:<a href="../../uint.html">uint</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#objectEncoding" target="">objectEncoding &#12503;&#12525;&#12497;&#12486;&#12451;</a><br /><a href="ObjectEncoding.html" target="">ObjectEncoding &#12463;&#12521;&#12473;</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/fps" class="dashAnchor" id="//apple_ref/cpp/Property/fps"></a><a name="fps" id="fps"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>fps</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>fps:<a href="../../Number.html">Number</a></code>&#160;&#160;[&#26360;&#12365;&#36796;&#12415;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#22793;&#26356;&#12364;&#12469;&#12540;&#12496;&#12540;&#12395;&#36865;&#20449;&#12373;&#12428;&#12427;&#22238;&#25968;&#65288;1 &#31186;&#12354;&#12383;&#12426;&#65289;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#13;
     &#13;
     </p><p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12392;&#12469;&#12540;&#12496;&#12540;&#38291;&#12398;&#12488;&#12521;&#12501;&#12451;&#12483;&#12463;&#37327;&#12434;&#21046;&#38480;&#12377;&#12427;&#22580;&#21512;&#12395;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12392;&#12469;&#12540;&#12496;&#12540;&#38291;&#12398;&#25509;&#32154;&#12364;&#27604;&#36611;&#30340;&#36933;&#12356;&#22580;&#21512;&#12399;&#12289;<code>fps</code> &#12434;&#23567;&#12373;&#12417;&#12398;&#20516;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#36870;&#12395;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12289;&#12479;&#12452;&#12511;&#12531;&#12464;&#12364;&#37325;&#35201;&#12394;&#12510;&#12523;&#12481;&#12518;&#12540;&#12470;&#12540;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;<code>fps</code> &#12434;&#12420;&#12420;&#22823;&#12365;&#12417;&#12398;&#20516;&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><code>fps</code> &#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;<code>sync</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#23550;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#22793;&#26356;&#12364;&#26356;&#26032;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12434;&#25163;&#21205;&#12398;&#12415;&#12391;&#26356;&#26032;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;<code>fps</code> &#12434; 0 &#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><code>sync</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12427;&#12414;&#12391;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#22793;&#26356;&#12399;&#36865;&#20449;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12388;&#12414;&#12426;&#12289;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#12398;&#24540;&#31572;&#26178;&#38291;&#12364;&#36933;&#12356;&#22580;&#21512;&#12289;&#26356;&#26032;&#12364;&#12469;&#12540;&#12496;&#12540;&#12395;&#36865;&#12425;&#12428;&#12427;&#38971;&#24230;&#12399;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#25351;&#23450;&#12375;&#12383;&#20516;&#12424;&#12426;&#12418;&#23569;&#12394;&#12367;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; </p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function set fps(value:<a href="../../Number.html">Number</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/objectEncoding" class="dashAnchor" id="//apple_ref/cpp/Property/objectEncoding"></a><a name="objectEncoding" id="objectEncoding"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>objectEncoding</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>objectEncoding:<a href="../../uint.html">uint</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12371;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12456;&#12531;&#12467;&#12540;&#12489;&#65288;AMF &#12496;&#12540;&#12472;&#12519;&#12531;&#65289;&#12391;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12427;&#12392;&#12365;&#12289;<code>objectEncoding</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12398;&#12354;&#12427; Action Message Format &#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;ActionScript 3.0 &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#65288;AMF3&#65289;&#12414;&#12383;&#12399; ActionScript 1.0 &#12414;&#12383;&#12399; 2.0 &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#65288;AMF0&#65289;&#12391;&#12377;&#12290; &#13;
     &#13;
     </p><p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12456;&#12531;&#12467;&#12540;&#12489;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12525;&#12540;&#12459;&#12523;&#12363;&#12522;&#12514;&#12540;&#12488;&#12363;&#12395;&#12424;&#12387;&#12390;&#12289;&#20966;&#29702;&#26041;&#27861;&#12364;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     <ul><li><b>&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</b>&#12290;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>objectEncoding</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#21462;&#24471;&#12414;&#12383;&#12399;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;<code>objectEncoding</code> &#12398;&#20516;&#12399;&#12289;&#12371;&#12398;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;<i>&#26360;&#12365;&#36796;&#12415;</i> &#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#24433;&#38911;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; ActionScript 2.0 &#12414;&#12383;&#12399; 1.0 SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#35501;&#12415;&#36796;&#12417;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<code>objectEncoding</code> &#12434; <code>ObjectEncoding.AMF0</code> &#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12456;&#12531;&#12467;&#12540;&#12489;&#12364; AMF3 &#12434;&#26360;&#12365;&#36796;&#12416;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#12289;Flash Player &#12391; AMF0 &#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65288;<code>ObjectEncoding.AMF3</code>&#65289;&#12434;&#20351;&#29992;&#12377;&#12428;&#12400;&#12289;ActionScript 2.0 &#12414;&#12383;&#12399; 1.0 SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#20316;&#25104;&#12375;&#12383;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12418;&#24341;&#12365;&#32154;&#12365; SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     </li><li><b>&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</b>&#12290;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12365;&#12399;&#12289;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383; NetConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#65288;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#25509;&#32154;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#65289;&#12398; <code>objectEncoding</code> &#35373;&#23450;&#12434;&#32153;&#25215;&#12375;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12365;&#12399;&#12289;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#38306;&#36899;&#20184;&#12369;&#12373;&#12428;&#12383; NetConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425; <code>defaultObjectEncoding</code> &#35373;&#23450;&#12434;&#32153;&#25215;&#12375;&#12414;&#12377;&#12290;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>objectEncoding</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399; NetConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12424;&#12426;&#27770;&#23450;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
     </li></ul><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get objectEncoding():<a href="../../uint.html">uint</a></code><br /><code>&#160;&#160;&#160;&#160;public function set objectEncoding(value:<a href="../../uint.html">uint</a>):<a href="../../specialTypes.html#void">void</a></code><br /><br /><span class="label"> &#20363;&#22806; </span><br /><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../ReferenceError.html">ReferenceError</a> </code> &#8212; &#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>objectEncoding</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#35373;&#23450;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383; NetConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12424;&#12426;&#20516;&#12364;&#27770;&#23450;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#defaultObjectEncoding" target="">defaultObjectEncoding</a><br /><a href="ObjectEncoding.html" target="">flash.net.ObjectEncoding</a></div></div></span><span id="pageFilter" runtime="AIR::3.7##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/preventBackup" class="dashAnchor" id="//apple_ref/cpp/Property/preventBackup"></a><a name="preventBackup" id="preventBackup"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<h3>preventBackup</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>preventBackup:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 3.7</td></tr></table><p></p><p></p><p>&#13;
     &#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; iOS &#12398;&#12463;&#12521;&#12454;&#12489;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12469;&#12540;&#12499;&#12473;&#12391;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#13;
     </p><p>true &#12414;&#12383;&#12399; false &#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     <ul><li><b>true</b> - &#12377;&#12409;&#12390;&#12398;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; iOS&#12398;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12463;&#12521;&#12454;&#12489;&#12469;&#12540;&#12499;&#12473;&#12391;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</li><li><b>false</b>&#65288;&#12487;&#12501;&#12457;&#12523;&#12488;&#65289; - &#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; iOS &#12398;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12463;&#12521;&#12454;&#12489;&#12469;&#12540;&#12499;&#12473;&#12391;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12373;&#12428;&#12414;&#12377;&#12290;</li></ul><p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12415;&#12395;&#36969;&#29992;&#12373;&#12428;&#12289;iOS &#12395;&#12398;&#12415;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public static function get preventBackup():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public static function set preventBackup(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/size" class="dashAnchor" id="//apple_ref/cpp/Property/size"></a><a name="size" id="size"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>size</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>size:<a href="../../uint.html">uint</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29694;&#22312;&#12398;&#12469;&#12452;&#12474;&#65288;&#12496;&#12452;&#12488;&#25968;&#65289;&#12391;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#38918;&#12395;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12364;&#35336;&#31639;&#12373;&#12428;&#12414;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#25345;&#12388;&#12487;&#12540;&#12479;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22810;&#12356;&#12411;&#12393;&#12289;&#12469;&#12452;&#12474;&#12398;&#35336;&#31639;&#12395;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12434;&#35519;&#12409;&#12427;&#20966;&#29702;&#12399;&#38750;&#24120;&#12395;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#22580;&#21512;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;&#29305;&#12395;&#24517;&#35201;&#12364;&#12394;&#12356;&#38480;&#12426;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#20351;&#29992;&#12399;&#36991;&#12369;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get size():<a href="../../uint.html">uint</a></code><br /><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d80.html" target="_blank">&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><div class="detailBody"> &#27425;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;ID <code>"thehobbit"</code> &#12434;&#20351;&#29992;&#12375;&#12390; SharedObject &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;<code>username</code> &#12392;&#12356;&#12358;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12289;SharedObject &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#27425;&#12395; <code>size</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12488;&#12524;&#12540;&#12473;&#12373;&#12428;&#12289;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#20516;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
&#13;
import flash.net.SharedObject;&#13;
&#13;
// if these get copied or not&#13;
var mySo:SharedObject = SharedObject.getLocal("thehobbit");&#13;
mySo.data.username = "bilbobaggins";&#13;
trace(mySo.size); // 55&#13;
</pre></div></div></span></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/clear()" class="dashAnchor" id="//apple_ref/cpp/Method/clear()"></a><a name="clear()" id="clear()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>clear</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function clear():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12525;&#12540;&#12459;&#12523;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12434;&#28040;&#21435;&#12375;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12487;&#12451;&#12473;&#12463;&#12363;&#12425;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12399;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12414;&#12414;&#12391;&#12289;&#12381;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#13;
     Flash Media Server &#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;<code>clear()</code> &#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20999;&#26029;&#12375;&#12289;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12525;&#12540;&#12459;&#12523;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12395;&#12424;&#12387;&#12390;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12418;&#12487;&#12451;&#12473;&#12463;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12399;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12414;&#12414;&#12391;&#12289;&#12381;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
      &#13;
     &#13;
     <span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;<code>hostName</code> &#12398;&#20516;&#12434; ID &#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12390;&#12289;SharedObject &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#65288;&#20197;&#38477;&#12398;&#23455;&#34892;&#12391;&#12399;&#21462;&#24471;&#65289;&#12375;&#12414;&#12377;&#12290;<code>username</code> &#12392;&#12356;&#12358;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12289;SharedObject &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#26368;&#24460;&#12395; <code>clear()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12289;&#12487;&#12540;&#12479;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#24773;&#22577;&#65288;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;<code>username</code> &#12392;&#12356;&#12358;&#21336;&#19968;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;&#12364;&#28040;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
&#13;
package {&#13;
    import flash.net.SharedObject;&#13;
&#13;
    public class SharedObject_clear {&#13;
        private var hostName:String = "yourDomain";&#13;
        private var username:String = "yourUsername";&#13;
&#13;
        public function SharedObject_clear() {&#13;
            var mySo:SharedObject = SharedObject.getLocal(hostName);&#13;
            if(mySo.data.username == null) {&#13;
                mySo.data.username = username;&#13;
                trace("set: " + mySo.data.username); // yourUsername&#13;
            }&#13;
            else {&#13;
                mySo.clear();&#13;
                trace("cleared: " + mySo.data.username); // undefined&#13;
            }&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/close()" class="dashAnchor" id="//apple_ref/cpp/Method/close()"></a><a name="close()" id="close()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>close</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function close():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12469;&#12540;&#12496;&#12540;&#12392;&#12398;&#38291;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12414;&#12377;&#12290;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12525;&#12540;&#12459;&#12523;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12518;&#12540;&#12470;&#12540;&#12399;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#24460;&#12395;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12459;&#12523;&#12467;&#12500;&#12540;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22793;&#26356;&#12399;&#12289;&#27425;&#22238;&#12395;&#12518;&#12540;&#12470;&#12540;&#12364;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#36865;&#12425;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/connect()" class="dashAnchor" id="//apple_ref/cpp/Method/connect()"></a><a name="connect()" id="connect()"></a><a name="connect(flash.net.NetConnection,String)" id="connect(flash.net.NetConnection,String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>connect</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function connect(myConnection:<a href="../../flash/net/NetConnection.html">NetConnection</a>, params:<a href="../../String.html">String</a> = null):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#25351;&#23450;&#12375;&#12383; NetConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20171;&#12375;&#12390;&#12289;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;<code>getRemote()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12383;&#24460;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#25509;&#32154;&#12395;&#25104;&#21151;&#12377;&#12427;&#12392;&#12289;<code>sync</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#25805;&#20316;&#12434;&#34892;&#12358;&#21069;&#12395;&#12289;<code>try..catch..finally</code> &#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;<code>sync</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#30435;&#35222;&#12375;&#12390;&#20966;&#29702;&#12375;&#12383;&#24460;&#12391;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;<code>sync</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12377;&#12427;&#21069;&#12395;&#12525;&#12540;&#12459;&#12523;&#12391;&#34892;&#12387;&#12383;&#22793;&#26356;&#12399;&#22833;&#12431;&#12428;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
     <p>&#13;
     &#27425;&#12398;&#20363;&#12399;&#12289;<code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
     var myRemoteSO:SharedObject = SharedObject.getRemote("mo", myNC.uri, false);&#13;
     myRemoteSO.connect(myNC);&#13;
     </pre></div>&#13;
     &#13;
     &#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">myConnection</span>:<a href="../../flash/net/NetConnection.html">NetConnection</a></code> &#8212; Flash Media Server &#12392;&#12398;&#36890;&#20449;&#12395;&#20351;&#29992;&#12377;&#12427; NetConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12394;&#12393;&#12289;RTMP&#65288;Real-Time Messaging Protocol&#65289;&#12434;&#20351;&#29992;&#12377;&#12427; NetConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">params</span>:<a href="../../String.html">String</a></code> (default = <code>null</code>)<code></code> &#8212; &#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#28193;&#12377;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#23450;&#32681;&#12377;&#12427;&#25991;&#23383;&#21015;&#12290;Flash Media Server &#12391;&#12399;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Error.html">Error</a> </code> &#8212; Flash Player &#12399;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;NetConnection &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#26377;&#21177;&#12391;&#12354;&#12426;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12289;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12469;&#12540;&#12496;&#12540;&#12395;&#27491;&#24120;&#12395;&#20316;&#25104;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#getRemote()" target="">getRemote()</a><br /><a href="SharedObject.html#event:sync" target="">sync</a><br /><a href="../../statements.html#try..catch..finally" target="">try..catch..finally</a><br /><a href="NetConnection.html" target="">NetConnection</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/flush()" class="dashAnchor" id="//apple_ref/cpp/Method/flush()"></a><a name="flush()" id="flush()"></a><a name="flush(int)" id="flush(int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>flush</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function flush(minDiskSpace:<a href="../../int.html">int</a> = 0):<a href="../../String.html">String</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12525;&#12540;&#12459;&#12523;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#30452;&#12385;&#12395;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12427;&#12398;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#32066;&#20102;&#26178;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#38281;&#12376;&#12425;&#12428;&#12427;&#12392;&#12365;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21442;&#29031;&#12373;&#12428;&#12394;&#12367;&#12394;&#12387;&#12390;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12392;&#12365;&#12289;<code>SharedObject.clear()</code> &#12414;&#12383;&#12399; <code>SharedObject.close()</code> &#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#12392;&#12365;&#12289;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#26178;&#28857;&#12391;&#12377;&#12290; &#13;
     &#13;
     </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364; <code>SharedObjectFlushStatus.PENDING</code> &#12434;&#36820;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20445;&#23384;&#12377;&#12427;&#12383;&#12417;&#12398;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12434;&#22679;&#12420;&#12377;&#12424;&#12358;&#12518;&#12540;&#12470;&#12540;&#12395;&#27714;&#12417;&#12427;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#20445;&#23384;&#12373;&#12428;&#12427;&#12392;&#12365;&#12399;&#12381;&#12398;&#12383;&#12417;&#12398;&#38936;&#22495;&#12434;&#22823;&#12365;&#12367;&#12375;&#12390; <code>PENDING</code> &#12364;&#36820;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;<code>minDiskSpace</code> &#12395;&#20516;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;Flash Player &#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#26360;&#12365;&#36796;&#12416;&#38555;&#12289;&#29694;&#22312;&#12398;&#12469;&#12452;&#12474;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20445;&#23384;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#38936;&#22495;&#12391;&#12399;&#12394;&#12367;&#12289;<code>minDiskSpace</code> &#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12496;&#12452;&#12488;&#25968;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290; </p>&#13;
     &#13;
     <p>&#20363;&#12360;&#12400;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12364;&#12289;&#26368;&#21021;&#12399;&#23567;&#12373;&#12367;&#12390;&#12418;&#26368;&#22823; 500 &#12496;&#12452;&#12488;&#12414;&#12391;&#22823;&#12365;&#12367;&#12394;&#12427;&#12392;&#20104;&#24819;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;<code>minDiskSpace</code> &#12395; 500 &#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12398;&#21106;&#12426;&#24403;&#12390;&#12434;&#27714;&#12417;&#12427;&#38555;&#12395;&#12399;&#12289;500 &#12496;&#12452;&#12488;&#12398;&#38936;&#22495;&#12364;&#35201;&#27714;&#12373;&#12428;&#12414;&#12377;&#12290;&#35201;&#27714;&#12373;&#12428;&#12383;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12434;&#12518;&#12540;&#12470;&#12540;&#12364;&#21106;&#12426;&#24403;&#12390;&#12383;&#22580;&#21512;&#12289;&#12381;&#12428;&#20197;&#38477;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12364; 500 &#12496;&#12452;&#12488;&#12434;&#36229;&#12360;&#12394;&#12356;&#38480;&#12426;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20445;&#23384;&#12377;&#12427;&#38555;&#12395;&#36861;&#21152;&#12398;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12434;&#35201;&#27714;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; </p>&#13;
     &#13;
     <p>&#12518;&#12540;&#12470;&#12540;&#12364;&#12371;&#12398;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12395;&#24540;&#31572;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#12418;&#12358;&#19968;&#24230;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>netStatus</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12392;&#12365;&#12398; <code>code</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; <code>SharedObject.Flush.Success</code> &#12414;&#12383;&#12399; <code>SharedObject.Flush.Failed</code> &#12391;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">minDiskSpace</span>:<a href="../../int.html">int</a></code> (default = <code>0</code>)<code></code> &#8212; &#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#24517;&#35201;&#12398;&#12354;&#12427;&#26368;&#23567;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#65288;&#12496;&#12452;&#12488;&#21336;&#20301;&#65289;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../String.html">String</a></code> &#8212; &#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#20516;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
     <ul><li><code>SharedObjectFlushStatus.PENDING</code>&#65306;&#12518;&#12540;&#12470;&#12540;&#12399;&#12371;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12525;&#12540;&#12459;&#12523;&#24773;&#22577;&#35352;&#25014;&#22495;&#12434;&#35377;&#21487;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#38936;&#22495;&#12364;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20445;&#23384;&#12377;&#12427;&#12398;&#12395;&#21313;&#20998;&#12391;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;Flash Player &#12399;&#12518;&#12540;&#12470;&#12540;&#12395;&#38936;&#22495;&#12434;&#22679;&#12420;&#12377;&#12424;&#12358;&#12395;&#35201;&#27714;&#12375;&#12414;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20445;&#23384;&#12377;&#12427;&#12392;&#12365;&#12395;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#29992;&#12398;&#38936;&#22495;&#12434;&#22679;&#21152;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;<code>SharedObjectFlushStatus.PENDING</code> &#25147;&#12426;&#20516;&#12434;&#28961;&#21177;&#12395;&#12375;&#12390;&#12289;<code>minDiskSpace</code> &#12398;&#20516;&#12434;&#28193;&#12375;&#12414;&#12377;&#12290;&#13;
     </li><li><code>SharedObjectFlushStatus.FLUSHED</code>&#65306;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12525;&#12540;&#12459;&#12523;&#12487;&#12451;&#12473;&#12463;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#27491;&#24120;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12414;&#12375;&#12383;&#12290;</li></ul></td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Error.html">Error</a> </code> &#8212; Flash Player &#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12456;&#12521;&#12540;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12371;&#12398;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#27704;&#32154;&#30340;&#12395;&#12525;&#12540;&#12459;&#12523;&#24773;&#22577;&#12434;&#20445;&#23384;&#12377;&#12427;&#12371;&#12392;&#12434;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12395;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
      &#13;
     &#13;
     <p><b>&#27880;&#24847;&#65306;</b>&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12489;&#12513;&#12452;&#12531;&#65288;&#29694;&#22312;&#12398;&#12502;&#12521;&#12454;&#12470;&#12540;&#12398;&#12450;&#12489;&#12524;&#12473;&#12496;&#12540;&#12395;&#12354;&#12427;&#12489;&#12513;&#12452;&#12531;&#20197;&#22806;&#12398;&#12489;&#12513;&#12452;&#12531;&#65289;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12451;&#12473;&#12463;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#12434;&#35377;&#21487;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12391;&#12418;&#12289;&#12525;&#12540;&#12459;&#12523;&#12467;&#12531;&#12486;&#12531;&#12484;&#12391;&#12399;&#12289;&#24120;&#12395;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12489;&#12513;&#12452;&#12531;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d80.html" target="_blank">&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#clear()" target="">clear()</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><br /><div class="detailBody"> &#27425;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;<code>hostName</code> &#12398;&#20516;&#12434; ID &#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12390;&#12289;SharedObject &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#65288;&#20197;&#38477;&#12398;&#23455;&#34892;&#12391;&#12399;&#21462;&#24471;&#65289;&#12375;&#12414;&#12377;&#12290;<code>username</code> &#12392;&#12356;&#12358;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12289;SharedObject &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;<code>flush()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#24460;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464; <code>pending</code> &#12354;&#12427;&#12356;&#12399;&#12502;&#12540;&#12523;&#20516;&#12398; <code>true</code> &#12414;&#12383;&#12399; <code>false</code> &#12364;&#36820;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#12363;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#12458;&#12540;&#12503;&#12531; SharedObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;Flash Player &#12398;&#29694;&#22312;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#38281;&#12376;&#12427;&#12383;&#12403;&#12395;&#33258;&#21205;&#30340;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
package {&#13;
    import flash.net.SharedObject;&#13;
&#13;
    public class SharedObject_flush {&#13;
        private var hostName:String = "yourDomain";&#13;
        private var username:String = "yourUsername";&#13;
&#13;
        public function SharedObject_flush() {&#13;
            var mySo:SharedObject = SharedObject.getLocal(hostName);&#13;
            mySo.data.username = username;&#13;
            var flushResult:Object = mySo.flush();&#13;
            trace("flushResult: " + flushResult);&#13;
            trace(mySo.data.username); // yourUsername&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/getLocal()" class="dashAnchor" id="//apple_ref/cpp/Method/getLocal()"></a><a name="getLocal()" id="getLocal()"></a><a name="getLocal(String,String,Boolean)" id="getLocal(String,String,Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>getLocal</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public static function getLocal(name:<a href="../../String.html">String</a>, localPath:<a href="../../String.html">String</a> = null, secure:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../flash/net/SharedObject.html">SharedObject</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
  &#29694;&#22312;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12384;&#12369;&#12364;&#21033;&#29992;&#12391;&#12365;&#12427;&#12525;&#12540;&#12459;&#12523;&#27704;&#32154;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12414;&#12384;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12395;&#12424;&#12426;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;<code>getLocal()</code> &#12395;&#28193;&#12373;&#12428;&#12383;&#20516;&#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#12414;&#12383;&#12399;&#21628;&#12403;&#20986;&#12375;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12289;Flash Player &#12399;&#20363;&#22806;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;&#13;
  &#13;
  </p><p>&#27425;&#12398;&#12467;&#12540;&#12489;&#12391;&#12399;&#12289;&#36820;&#12373;&#12428;&#12383;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21442;&#29031;&#12398;&#22793;&#25968;&#12408;&#12398;&#21106;&#12426;&#24403;&#12390;&#26041;&#27861;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
  <p><code>var so:SharedObject = SharedObject.getLocal("savedData");</code></p>&#13;
  &#13;
  <p><b>&#27880;&#24847;&#65306;</b>&#12518;&#12540;&#12470;&#12540;&#12364;&#12371;&#12398;&#12489;&#12513;&#12452;&#12531;&#29992;&#12398;&#12525;&#12540;&#12459;&#12523;&#35352;&#25014;&#22495;&#12434;&#35377;&#21487;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<code>localPath</code> &#12398;&#20516;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12525;&#12540;&#12459;&#12523;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#12525;&#12540;&#12459;&#12523;&#12467;&#12531;&#12486;&#12531;&#12484;&#12399;&#20363;&#22806;&#12391;&#12377;&#12290;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12489;&#12513;&#12452;&#12531;&#65288;&#29694;&#22312;&#12398;&#12502;&#12521;&#12454;&#12470;&#12540;&#12398;&#12450;&#12489;&#12524;&#12473;&#12496;&#12540;&#12395;&#12354;&#12427;&#12489;&#12513;&#12452;&#12531;&#20197;&#22806;&#12398;&#12489;&#12513;&#12452;&#12531;&#65289;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12451;&#12473;&#12463;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#12434;&#35377;&#21487;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12391;&#12418;&#12289;&#12525;&#12540;&#12459;&#12523;&#12467;&#12531;&#12486;&#12531;&#12484;&#12391;&#12399;&#12289;&#24120;&#12395;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12489;&#12513;&#12452;&#12531;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
  </p>&#13;
  &#13;
  <p>&#21517;&#21069;&#12398;&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12390;&#12356;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#20301;&#32622;&#12364;&#32771;&#24942;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;www.myCompany.com/apps/stockwatcher.swf &#12395;&#12354;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12364; <code>portfolio</code> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;www.yourCompany.com/photoshoot.swf &#12395;&#12354;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#20316;&#25104;&#12375;&#12383; <code>portfolio</code> &#12392;&#12356;&#12358;&#21029;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12399;&#31478;&#21512;&#12375;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;&#12371;&#12398; 2 &#12388;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#30064;&#12394;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#32622;&#12363;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290; </p>&#13;
  &#13;
  <p><code>localPath</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12364;&#12289;&#24910;&#37325;&#12395;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#29305;&#12395;&#12289;&#20182;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12540;&#12479;&#12364;&#12289;&#21029;&#12398;&#22580;&#25152;&#12395;&#31227;&#21205;&#12373;&#12428;&#12394;&#12356; 1 &#12388;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#22266;&#26377;&#12398;&#12418;&#12398;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;&#20182;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#12414;&#12383;&#12399;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#24460;&#12391;&#31227;&#21205;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12395;&#12424;&#12426;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12395;&#24433;&#38911;&#12364;&#29983;&#12376;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>localPath</code> &#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12391;&#12354;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#23436;&#20840;&#12497;&#12473;&#12395;&#35373;&#23450;&#12375;&#12390;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12289;&#20182;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12399;&#12381;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#20803;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#24460;&#12391;&#21029;&#12398;&#22580;&#25152;&#12395;&#31227;&#21205;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12418;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12487;&#12540;&#12479;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
  &#13;
  <p>&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35492;&#12387;&#12390;&#21046;&#38480;&#12375;&#12390;&#12375;&#12414;&#12358;&#12398;&#12434;&#36991;&#12369;&#12427;&#12395;&#12399;&#12289;<code>localpath</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#26368;&#12418;&#21046;&#38480;&#12398;&#32233;&#12420;&#12363;&#12394;&#26041;&#27861;&#12399;&#12289;<code>localPath</code> &#12434; <code>/</code>&#65288;&#12473;&#12521;&#12483;&#12471;&#12517;&#65289;&#12395;&#35373;&#23450;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290;&#12489;&#12513;&#12452;&#12531;&#12398;&#12377;&#12409;&#12390;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398;&#20182;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12398;&#21517;&#21069;&#12398;&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;&#12364;&#36215;&#12371;&#12426;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12424;&#12426;&#21046;&#38480;&#12398;&#21427;&#12375;&#12356;&#26041;&#27861;&#12399;&#12289;<code>localPath</code> &#12395; SWF &#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#23436;&#20840;&#12497;&#12473;&#20869;&#12398;&#12501;&#12457;&#12523;&#12480;&#12540;&#21517;&#12434;&#20184;&#21152;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;www.myCompany.com/apps/stockwatcher.swf &#12395;&#12354;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#20316;&#25104;&#12373;&#12428;&#12383; <code>portfolio</code> &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12399;&#12289;<code>localPath</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434; <code>/</code>&#12289;<code>/apps</code>&#12289;&#12414;&#12383;&#12399; <code>/apps/stockwatcher.swf</code> &#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#26368;&#36969;&#12394;&#26580;&#36575;&#24615;&#12434;&#25552;&#20379;&#12391;&#12365;&#12427;&#26041;&#27861;&#12364;&#12393;&#12428;&#12363;&#12434;&#21028;&#26029;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
  &#13;
  <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#27425;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12514;&#12487;&#12523;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
  &#13;
  </p><ul><li>&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12398;&#22659;&#30028;&#12434;&#36234;&#12360;&#12390;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</li><li>Flash Player &#12398;&#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12414;&#12383;&#12399;&#35373;&#23450;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#21046;&#38480;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12489;&#12513;&#12452;&#12531;&#12372;&#12392;&#12395;&#26368;&#22823; 100 KB &#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;&#31649;&#29702;&#32773;&#12362;&#12424;&#12403;&#19968;&#33324;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#27231;&#33021;&#12395;&#21046;&#38480;&#12434;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</li></ul><p>&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#65288;&#12525;&#12540;&#12459;&#12523;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399; EXE &#12501;&#12449;&#12452;&#12523;&#65289;&#12392;&#12375;&#12390;&#20877;&#29983;&#12377;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#12497;&#12502;&#12522;&#12483;&#12471;&#12517;&#12375;&#12289;&#35079;&#25968;&#12398;&#12525;&#12540;&#12459;&#12523; SWF &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#29305;&#23450;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#29366;&#27841;&#12391;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20445;&#23384;&#12395; 2 &#12388;&#12398;&#30064;&#12394;&#12427;&#22580;&#25152;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#20351;&#29992;&#12373;&#12428;&#12427;&#12489;&#12513;&#12452;&#12531;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12383;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12395;&#20184;&#19982;&#12373;&#12428;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35377;&#21487;&#12395;&#12424;&#12387;&#12390;&#22793;&#12431;&#12426;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;&#27425;&#12398; 3 &#12388;&#12398;&#30064;&#12394;&#12427;&#35377;&#21487;&#12524;&#12505;&#12523;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
  &#13;
  </p><ol><li>&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#12415;&#12395;&#23550;&#12377;&#12427;&#12450;&#12463;&#12475;&#12473;</li><li>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#12415;&#12395;&#23550;&#12377;&#12427;&#12450;&#12463;&#12475;&#12473;</li><li>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12392;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#20001;&#26041;&#12395;&#23550;&#12377;&#12427;&#12450;&#12463;&#12475;&#12473;</li></ol><p>&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#25345;&#12388;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#65288;&#12524;&#12505;&#12523; 1 &#12414;&#12383;&#12399; 3&#65289;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; 1 &#12388;&#12398;&#22580;&#25152;&#12395;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#25345;&#12383;&#12394;&#12356;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#65288;&#12524;&#12505;&#12523; 2&#65289;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21029;&#12398;&#22580;&#25152;&#12395;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;</p>&#13;
  &#13;
  <p>SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;SWF &#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427; HTML &#12506;&#12540;&#12472;&#12395; <code>allowNetworking</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65288;<code>object</code> &#12479;&#12464;&#12362;&#12424;&#12403; <code>embed</code> &#12479;&#12464;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65289;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>&#13;
  &#13;
  <p>&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
  &#13;
  <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">name</span>:<a href="../../String.html">String</a></code> &#8212; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#21517;&#12391;&#12377;&#12290;&#21517;&#21069;&#12395;&#12399;&#12473;&#12521;&#12483;&#12471;&#12517;&#65288;<code>/</code>&#65289;&#12434;&#21547;&#12417;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>work/addresses</code> &#12399;&#26377;&#21177;&#12394;&#21517;&#21069;&#12391;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#21517;&#12395;&#12473;&#12506;&#12540;&#12473;&#12289;&#12362;&#12424;&#12403;&#20197;&#19979;&#12398;&#25991;&#23383;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;   &#13;
  <pre>&#13;
  ~ % &amp; \ ; : " ' , &lt; &gt; ? # &#13;
  </pre>&#13;
  &#13;
  </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">localPath</span>:<a href="../../String.html">String</a></code> (default = <code>null</code>)<code></code> &#8212; &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#23436;&#20840;&#12497;&#12473;&#12414;&#12383;&#12399;&#37096;&#20998;&#12497;&#12473;&#12391;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12459;&#12523;&#12395;&#20445;&#23384;&#12377;&#12427;&#22580;&#25152;&#12364;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#23436;&#20840;&#12497;&#12473;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
   &#13;
  </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">secure</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>false</code>)<code></code> &#8212; &#12371;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12364; HTTPS &#25509;&#32154;&#32076;&#30001;&#12391;&#37197;&#24067;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#38480;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#21029;&#12375;&#12414;&#12377;&#12290;SWF &#12501;&#12449;&#12452;&#12523;&#12364; HTTPS &#25509;&#32154;&#32076;&#30001;&#12391;&#37197;&#20449;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12395;&#12399;&#27425;&#12398;&#21177;&#26524;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
  <ul><li>&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434; <code>true</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;Flash Player &#12399;&#26032;&#12375;&#12356;&#12475;&#12461;&#12517;&#12450;&#12394;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12363;&#12289;&#26082;&#23384;&#12398;&#12475;&#12461;&#12517;&#12450;&#12394;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21442;&#29031;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12475;&#12461;&#12517;&#12450;&#12394;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#35501;&#12415;&#21462;&#12426;&#12414;&#12383;&#12399;&#26360;&#12365;&#36796;&#12415;&#12399;&#12289;HTTPS &#12391;&#37197;&#20449;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#12424;&#12387;&#12390;&#12398;&#12415;&#34892;&#12360;&#12414;&#12377;&#12290;&#12371;&#12398;&#12392;&#12365; SWF &#12501;&#12449;&#12452;&#12523;&#12399; <code>SharedObject.getLocal()</code> &#12434;&#12289;<code>secure</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434; <code>true</code> &#12395;&#35373;&#23450;&#12375;&#12390;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;</li><li>&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; <code>false</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;Flash Player &#12399;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#26032;&#12375;&#12367;&#20316;&#25104;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399; HTTPS &#20197;&#22806;&#12398;&#25509;&#32154;&#12391;&#37197;&#20449;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#35501;&#12415;&#36796;&#12415;&#12414;&#12383;&#12399;&#26360;&#12365;&#36796;&#12415;&#12398;&#12391;&#12365;&#12427;&#26082;&#23384;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#21442;&#29031;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;</li></ul><p>SWF &#12501;&#12449;&#12452;&#12523;&#12364; HTTPS &#20197;&#22806;&#12398;&#25509;&#32154;&#12391;&#37197;&#20449;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434; <code>true</code> &#12395;&#35373;&#23450;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#26032;&#12375;&#12356;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20316;&#25104;&#65288;&#12414;&#12383;&#12399;&#20316;&#25104;&#28168;&#12415;&#12398;&#12475;&#12461;&#12517;&#12450;&#12394;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#65289;&#12399;&#22833;&#25943;&#12375;&#12289;<code>null</code> &#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;&#20316;&#25104;&#12373;&#12428;&#12383;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;&#24403;&#35442;&#12489;&#12513;&#12452;&#12531;&#12391;&#20351;&#29992;&#21487;&#33021;&#12394;&#21512;&#35336;&#12487;&#12451;&#12473;&#12463;&#23481;&#37327;&#12398;&#26528;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
  &#13;
  <p>&#27425;&#12398;&#22259;&#12395;&#12289;<code>secure</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20351;&#29992;&#26041;&#27861;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
  <p><img src="../../images/secureParam.jpg" alt="&#12475;&#12461;&#12517;&#12450;&#12394;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22259;" /></p>&#13;
  &#13;
  </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/net/SharedObject.html">SharedObject</a></code> &#8212; &#12525;&#12540;&#12459;&#12523;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12289;&#29694;&#22312;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391;&#12398;&#12415;&#21033;&#29992;&#12391;&#12365;&#12427;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12391;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;&#12414;&#12383;&#12399;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#22580;&#21512;&#65288;<code>localPath</code> &#12395;&#25351;&#23450;&#12375;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12394;&#12393;&#65289;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#20363;&#22806;&#12434;&#12473;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;&#13;
  &#13;
  </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Error.html">Error</a> </code> &#8212; Flash Player &#12399;&#12289;&#20309;&#12425;&#12363;&#12398;&#29702;&#30001;&#12391;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12398; Flash &#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12424;&#12427;&#27704;&#32154;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20316;&#25104;&#12392;&#20445;&#23384;&#12364;&#31105;&#27490;&#12373;&#12428;&#12390;&#12356;&#12427;&#65288;&#12525;&#12540;&#12459;&#12523;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#36969;&#29992;&#12373;&#12428;&#12394;&#12356;&#65289;&#22580;&#21512;&#12289;&#12371;&#12398;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;<a href="http://www.adobe.com/support/documentation/jp/flashplayer/help/settings_manager03.html" target="external">http://www.adobe.com/support/documentation/jp/flashplayer/help/settings_manager03.html</a> &#12395;&#12354;&#12427;&#35373;&#23450;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#12464;&#12525;&#12540;&#12496;&#12523;&#12473;&#12488;&#12524;&#12540;&#12472;&#35373;&#23450;&#12497;&#12493;&#12523;&#12391;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12398;&#27704;&#32154;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#31105;&#27490;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
  &#13;
  </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d80.html" target="_blank">&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/getRemote()" class="dashAnchor" id="//apple_ref/cpp/Method/getRemote()"></a><a name="getRemote()" id="getRemote()"></a><a name="getRemote(String,String,Object,Boolean)" id="getRemote(String,String,Object,Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>getRemote</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public static function getRemote(name:<a href="../../String.html">String</a>, remotePath:<a href="../../String.html">String</a> = null, persistence:<a href="../../Object.html">Object</a> = false, secure:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../flash/net/SharedObject.html">SharedObject</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#35079;&#25968;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12289;Flash Media Server &#19978;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12414;&#12384;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12395;&#12424;&#12426;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </p><p>&#13;
     &#27425;&#12395;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12383;&#12417;&#12395; <code>getRemote()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12289;<code>connect()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
     var nc:NetConnection = new NetConnection();&#13;
     nc.connect("rtmp://somedomain.com/applicationName");&#13;
     var myRemoteSO:SharedObject = SharedObject.getRemote("mo", nc.uri, false);&#13;
     myRemoteSO.connect(nc);&#13;
     </pre></div>&#13;
     &#13;
     &#13;
     &#13;
     <p>&#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12459;&#12523;&#12362;&#12424;&#12403;&#12522;&#12514;&#12540;&#12488;&#12467;&#12500;&#12540;&#12434;&#21516;&#26399;&#12373;&#12379;&#12427;&#12395;&#12399;&#12289;<code>sync</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#30435;&#35222;&#12375;&#12390;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20849;&#26377;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399;&#12289;<code>name</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392; <code>remotePath</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#21516;&#12376;&#20516;&#12434;&#28193;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#13;
     </p> &#13;
     &#13;
     <p>&#29694;&#22312;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391;&#12398;&#12415;&#21033;&#29992;&#12391;&#12365;&#12427;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>SharedObject.getLocal()</code> &#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">name</span>:<a href="../../String.html">String</a></code> &#8212; &#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;&#21517;&#21069;&#12395;&#12399;&#12473;&#12521;&#12483;&#12471;&#12517;&#65288;/&#65289;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;work/addresses &#12399;&#26377;&#21177;&#12394;&#21517;&#21069;&#12391;&#12377;&#12290;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#21517;&#12395;&#12473;&#12506;&#12540;&#12473;&#12289;&#12362;&#12424;&#12403;&#20197;&#19979;&#12398;&#25991;&#23383;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#13;
     <pre>    ~ % &amp; \ ; :  " ' , &gt; ? ? #</pre>&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">remotePath</span>:<a href="../../String.html">String</a></code> (default = <code>null</code>)<code></code> &#8212; &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#20445;&#23384;&#12373;&#12428;&#12427;&#12469;&#12540;&#12496;&#12540;&#12398; URI&#12391;&#12377;&#12290;&#12371;&#12398; URI &#12399;&#12289;<code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12373;&#12428;&#12383; NetConnection &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; URI &#12392;&#21516;&#19968;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">persistence</span>:<a href="../../Object.html">Object</a></code> (default = <code>false</code>)<code></code> &#8212; &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12540;&#12479;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#23646;&#24615;&#12364;&#12289;&#12393;&#12371;&#12391;&#27704;&#32154;&#30340;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12363;&#65288;&#12525;&#12540;&#12459;&#12523;&#12289;&#12522;&#12514;&#12540;&#12488;&#12289;&#12414;&#12383;&#12399;&#12381;&#12398;&#20001;&#26041;&#65289;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12459;&#12523;&#12391;&#20445;&#23384;&#12377;&#12427;&#22580;&#21512;&#12398;&#22580;&#25152;&#12418;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#26377;&#21177;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;&#13;
     <ul><li><code>false</code> &#20516;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12414;&#12383;&#12399;&#12469;&#12540;&#12496;&#12540;&#12391;&#27704;&#32154;&#30340;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</li><li><code>true</code> &#20516;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#12415;&#12391;&#27704;&#32154;&#30340;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</li><li>&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12525;&#12540;&#12459;&#12523;&#12398;&#23436;&#20840;&#12497;&#12473;&#12414;&#12383;&#12399;&#37096;&#20998;&#12497;&#12473;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12392;&#12469;&#12540;&#12496;&#12540;&#19978;&#12391;&#27704;&#32154;&#30340;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#25351;&#23450;&#12373;&#12428;&#12383;&#12497;&#12473;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#19978;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398;&#12469;&#12502;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;</li></ul><p><b>&#27880;&#24847;&#65306;</b>&#12518;&#12540;&#12470;&#12540;&#12364;&#12371;&#12398;&#12489;&#12513;&#12452;&#12531;&#29992;&#12398;&#12525;&#12540;&#12459;&#12523;&#35352;&#25014;&#22495;&#12434;&#35377;&#21487;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#27704;&#32154;&#24615;&#12398;&#12525;&#12540;&#12459;&#12523;&#12497;&#12473;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12525;&#12540;&#12459;&#12523;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12463;&#12521;&#12473;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">secure</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>false</code>)<code></code> &#8212; &#12371;&#12398;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12364; HTTPS &#25509;&#32154;&#32076;&#30001;&#12391;&#37197;&#24067;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#38480;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#21029;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<code>secure</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65288;<code>getLocal</code> &#12513;&#12477;&#12483;&#12489;&#12456;&#12531;&#12488;&#12522;&#65289;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
     &#13;
     </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/net/SharedObject.html">SharedObject</a></code> &#8212; &#35079;&#25968;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391;&#12398;&#20849;&#26377;&#12364;&#12391;&#12365;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Error.html">Error</a> </code> &#8212; Flash Player &#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12289;&#12414;&#12383;&#12399;&#35211;&#12388;&#12369;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;<code>remotePath</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392; <code>persistence</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#12289;&#23384;&#22312;&#12375;&#12394;&#12356;&#12497;&#12473;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#36215;&#12371;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d80.html" target="_blank">&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#connect()" target="">connect()</a><br /><a href="SharedObject.html#getLocal()" target="">getLocal()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/send()" class="dashAnchor" id="//apple_ref/cpp/Method/send()"></a><a name="send()" id="send()"></a><a name="send(restParam)" id="send(restParam)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>send</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function send(<a href="../../statements.html#..._(rest)_parameter">...</a> arguments):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#65288;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#20449;&#12375;&#12383;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12418;&#21547;&#12416;&#65289;&#12395;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20966;&#29702;&#12375;&#12390;&#24540;&#31572;&#12377;&#12427;&#12395;&#12399;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#38306;&#25968;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><a href="../../statements.html#..._(rest)_parameter">...</a> <span class="label">arguments</span></code> &#8212; &#35079;&#25968;&#12398;&#24341;&#25968;&#65306;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35672;&#21029;&#12377;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#35079;&#25968;&#12398;&#12495;&#12531;&#12489;&#12521;&#12540;&#38306;&#25968;&#21517;&#12289;&#12362;&#12424;&#12403;&#20219;&#24847;&#12398;&#12487;&#12540;&#12479;&#22411;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#12377;&#12290;&#12495;&#12531;&#12489;&#12521;&#12540;&#21517;&#12398;&#28145;&#12373;&#12399; 1 &#12524;&#12505;&#12523;&#12398;&#12415;&#12391;&#65288;&#12388;&#12414;&#12426;&#12289;&#35242;&#23376;&#24418;&#24335;&#12434;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#65289;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#30456;&#23550;&#12375;&#12414;&#12377;&#12290;&#24341;&#25968;&#12399;&#30452;&#21015;&#21270;&#12373;&#12428;&#12289;&#25509;&#32154;&#12434;&#20171;&#12375;&#12390;&#36865;&#20449;&#12373;&#12428;&#12414;&#12377;&#12290;&#21463;&#20449;&#20596;&#12398;&#12495;&#12531;&#12489;&#12521;&#12540;&#12399;&#21516;&#12376;&#38918;&#30058;&#12391;&#12381;&#12428;&#12425;&#12398;&#24341;&#25968;&#12434;&#21463;&#12369;&#21462;&#12426;&#12414;&#12377;&#12290;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#24490;&#29872;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65288;&#24490;&#29872;&#12377;&#12427;&#12522;&#12531;&#12463;&#12373;&#12428;&#12383;&#12522;&#12473;&#12488;&#12394;&#12393;&#65289;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#12471;&#12522;&#12450;&#12521;&#12452;&#12470;&#12399;&#21442;&#29031;&#12434;&#27491;&#12375;&#12367;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     <p><b>&#27880;&#24847;&#65306;</b>&#38306;&#25968;&#21517;&#12395;&#12399;&#20104;&#32004;&#35486;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#20363;&#12360;&#12400;&#12289;<code>myRemoteSO.send("close")</code> &#12399;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     </td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/setDirty()" class="dashAnchor" id="//apple_ref/cpp/Method/setDirty()"></a><a name="setDirty()" id="setDirty()"></a><a name="setDirty(String)" id="setDirty(String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>setDirty</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function setDirty(propertyName:<a href="../../String.html">String</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#12469;&#12540;&#12496;&#12540;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#22793;&#26356;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#31034;&#12377; <i>dirty</i> &#12392;&#12375;&#12390;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12510;&#12540;&#12463;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#13;
     <code>SharedObject.setProperty()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; &#13;
     </p>&#13;
      &#13;
     <p>&#13;
     <code>SharedObject.setProperty()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;<code>setDirty()</code> &#12434;&#23455;&#35013;&#12375;&#12414;&#12377;&#12290;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12289;&#20363;&#12360;&#12400;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#12473;&#12488;&#12522;&#12531;&#12464;&#12420;&#25968;&#20516;&#12398;&#12424;&#12358;&#12394;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#22411;&#12398;&#12392;&#12365;&#12399;&#12289;<code>setProperty()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12289;<code>setDirty()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#29420;&#33258;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12388;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;<code>setDirty()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#26085;&#26178;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">propertyName</span>:<a href="../../String.html">String</a></code> &#8212; &#22793;&#26356;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#data" target="">SharedObject.data&#65288;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;</a><br /><a href="SharedObject.html#setProperty()" target="">setProperty()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/setProperty()" class="dashAnchor" id="//apple_ref/cpp/Method/setProperty()"></a><a name="setProperty()" id="setProperty()"></a><a name="setProperty(String,Object)" id="setProperty(String,Object)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>setProperty</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function setProperty(propertyName:<a href="../../String.html">String</a>, value:<a href="../../Object.html">Object</a> = null):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#26356;&#26032;&#12375;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#12469;&#12540;&#12496;&#12540;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;<code>setProperty()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; changed &#12414;&#12383;&#12399; dirty &#12392;&#12375;&#12390;&#26126;&#31034;&#30340;&#12395;&#12510;&#12540;&#12463;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.adobe.com/go/learn_fms_docs_jp">Flash Media Server &#12398;&#12510;&#12491;&#12517;&#12450;&#12523;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><b>&#27880;&#24847;&#65306;</b><code>SharedObject.setProperty()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#12399;&#12289;<code>setDirty()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#23455;&#35013;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12289;&#20363;&#12360;&#12400;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#12473;&#12488;&#12522;&#12531;&#12464;&#12420;&#25968;&#20516;&#12398;&#12424;&#12358;&#12394;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#22411;&#12398;&#12392;&#12365;&#12399;&#12289;<code>setProperty()</code> &#12434;&#20351;&#29992;&#12375;&#12289;<code>setDirty</code> &#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#29420;&#33258;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12388;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;<code>setDirty()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#26085;&#26178;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#19968;&#33324;&#30340;&#12395;&#12399;&#12289;<code>setProperty()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;<code>setDirty()</code> &#12399;&#20351;&#29992;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;<code>setProperty()</code> &#12399;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12384;&#12369;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#12364;&#12289;<code>setDirty()</code> &#12399;&#12469;&#12502;&#12473;&#12463;&#12521;&#12452;&#12502;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#24375;&#21046;&#30340;&#12395;&#21516;&#26399;&#12373;&#12379;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">propertyName</span>:<a href="../../String.html">String</a></code> &#8212; &#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;&#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">value</span>:<a href="../../Object.html">Object</a></code> (default = <code>null</code>)<code></code> &#8212; &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#65288;ActionScript &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12391;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#22580;&#21512;&#12399; <code>null</code> &#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#data" target="">SharedObject.data&#65288;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;</a></div></div></span><div class="detailSectionHeader"> &#12452;&#12505;&#12531;&#12488;&#12398;&#35443;&#32048; </div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:asyncError" id="event:asyncError"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>asyncError</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/AsyncErrorEvent.html"><code>flash.events.AsyncErrorEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; AsyncErrorEvent.type  =  </span><a href="../../flash/events/AsyncErrorEvent.html#ASYNC_ERROR"><code>flash.events.AsyncErrorEvent.ASYNC_ERROR</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 &#38750;&#21516;&#26399;&#24418;&#24335;&#12391;&#12289;&#12388;&#12414;&#12426;&#12493;&#12452;&#12486;&#12451;&#12502;&#38750;&#21516;&#26399;&#12467;&#12540;&#12489;&#12363;&#12425;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
 &#13;
 </p>&#13;
	<code>AsyncErrorEvent.ASYNC_ERROR</code> &#23450;&#25968;&#12399;&#12289;<code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>asyncError</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#13;
	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290; </td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; </td></tr><tr><td><code>target</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>error</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12434;&#12488;&#12522;&#12460;&#12540;&#12375;&#12383;&#12456;&#12521;&#12540;&#12391;&#12377;&#12290;</td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:netStatus" id="event:netStatus"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>netStatus</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/NetStatusEvent.html"><code>flash.events.NetStatusEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; NetStatusEvent.type  =  </span><a href="../../flash/events/NetStatusEvent.html#NET_STATUS"><code>flash.events.NetStatusEvent.NET_STATUS</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 SharedObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12289;&#12381;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12414;&#12383;&#12399;&#12456;&#12521;&#12540;&#12398;&#29366;&#27841;&#12434;&#12524;&#12509;&#12540;&#12488;&#12377;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>netStatus</code> &#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;<code>info</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#25509;&#32154;&#35430;&#34892;&#12364;&#25104;&#21151;&#12375;&#12383;&#12363;&#12393;&#12358;&#12363;&#12420;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12459;&#12523;&#12487;&#12451;&#12473;&#12463;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#12364;&#25104;&#21151;&#12375;&#12383;&#12363;&#12393;&#12358;&#12363;&#12394;&#12393;&#12289;&#12452;&#12505;&#12531;&#12488;&#12395;&#38306;&#12377;&#12427;&#29305;&#23450;&#12398;&#24773;&#22577;&#12434;&#21547;&#12416;&#24773;&#22577;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; &#13;
 &#13;
 </p>&#13;
    <code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>netStatus</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#13;
    <p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
    <table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>info</code></td><td>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12414;&#12383;&#12399;&#12456;&#12521;&#12540;&#29366;&#24907;&#12434;&#35352;&#36848;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12388;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12381;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12434;&#22577;&#21578;&#12377;&#12427; NetConnection &#12414;&#12383;&#12399; NetStream &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/events/NetStatusEvent.html#info" target="">flash.events.NetStatusEvent.info</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:sync" id="event:sync"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>sync</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/SyncEvent.html"><code>flash.events.SyncEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; SyncEvent.type  =  </span><a href="../../flash/events/SyncEvent.html#SYNC"><code>flash.events.SyncEvent.SYNC</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 &#12522;&#12514;&#12540;&#12488;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12469;&#12540;&#12496;&#12540;&#12395;&#12424;&#12387;&#12390;&#26356;&#26032;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
 </p>&#13;
     <code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>sync</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#13;
	 <p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	 <table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>changeList</code></td><td>&#37197;&#21015;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12434;&#35352;&#36848;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12388;&#37197;&#21015;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12469;&#12540;&#12496;&#12540;&#12395;&#12424;&#12387;&#12390;&#26356;&#26032;&#12373;&#12428;&#12383; SharedObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12377;&#12290;</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="SharedObject.html#getRemote()" target="">getRemote()</a></div></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">SharedObjectExample.as</div><br /><div class="detailBody"> &#27425;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;ID <code>"application-name"</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20849;&#26377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#65288;&#20197;&#38477;&#12398;&#23455;&#34892;&#12391;&#12399;&#21462;&#24471;&#65289;&#12375;&#12414;&#12377;&#12290;&#12300;&#20445;&#23384;&#12301;&#12508;&#12479;&#12531;&#12364;&#12463;&#12522;&#12483;&#12463;&#12373;&#12428;&#12427;&#12392;&#12289;<code>saveValue()</code> &#12513;&#12477;&#12483;&#12489;&#12364; <code>savedValue</code> &#12392;&#12356;&#12358;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; SharedObject &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>data</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#20445;&#23384;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;Flash Player &#12364;&#12487;&#12540;&#12479;&#12434;&#20445;&#23384;&#12377;&#12427;&#35377;&#21487;&#12434;&#27714;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#35377;&#21487;&#12434;&#19982;&#12360;&#12427;&#12363;&#25298;&#21542;&#12377;&#12427;&#12392;&#12289;<code>onFlushStatus()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12300;&#12463;&#12522;&#12450;&#12301;&#12508;&#12479;&#12531;&#12364;&#12463;&#12522;&#12483;&#12463;&#12373;&#12428;&#12427;&#12392;&#12289;<code>clearValue()</code> &#12513;&#12477;&#12483;&#12489;&#12364; <code>savedValue</code> &#12395;&#20445;&#23384;&#12373;&#12428;&#12383;&#20516;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#21462;&#24471;&#12373;&#12428;&#12427;&#20516;&#12399;&#12289;<code>undefined</code> &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
 &#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
package {&#13;
    import flash.display.Sprite;&#13;
    import flash.events.MouseEvent;&#13;
    import flash.events.NetStatusEvent;&#13;
    import flash.net.SharedObject;&#13;
    import flash.net.SharedObjectFlushStatus;&#13;
    import flash.text.TextField;&#13;
    import flash.text.TextFieldAutoSize;&#13;
    import flash.text.TextFieldType;&#13;
    &#13;
    public class SharedObjectExample extends Sprite {&#13;
        &#13;
        private var mySo:SharedObject;&#13;
        &#13;
        public function SharedObjectExample() {&#13;
            buildUI();&#13;
            saveBtn.addEventListener(MouseEvent.CLICK, saveValue);&#13;
            clearBtn.addEventListener(MouseEvent.CLICK, clearValue);&#13;
            &#13;
            mySo = SharedObject.getLocal("application-name");&#13;
            output.appendText("SharedObject loaded...\n");&#13;
            output.appendText("loaded value: " + mySo.data.savedValue + "\n\n");&#13;
        }&#13;
&#13;
         private function saveValue(event:MouseEvent):void {&#13;
            output.appendText("saving value...\n");&#13;
            mySo.data.savedValue = input.text;&#13;
            &#13;
            var flushStatus:String = null;&#13;
            try {&#13;
                flushStatus = mySo.flush(10000);&#13;
            } catch (error:Error) {&#13;
                output.appendText("Error...Could not write SharedObject to disk\n");&#13;
            }&#13;
            if (flushStatus != null) {&#13;
                switch (flushStatus) {&#13;
                    case SharedObjectFlushStatus.PENDING:&#13;
                        output.appendText("Requesting permission to save object...\n");&#13;
                        mySo.addEventListener(NetStatusEvent.NET_STATUS, onFlushStatus);&#13;
                        break;&#13;
                    case SharedObjectFlushStatus.FLUSHED:&#13;
                        output.appendText("Value flushed to disk.\n");&#13;
                        break;&#13;
                }&#13;
            }&#13;
            output.appendText("\n");&#13;
        }&#13;
        &#13;
        private function clearValue(event:MouseEvent):void {&#13;
            output.appendText("Cleared saved value...Reload SWF and the value should be \"undefined\".\n\n");&#13;
            delete mySo.data.savedValue;&#13;
        }&#13;
        &#13;
        private function onFlushStatus(event:NetStatusEvent):void {&#13;
            output.appendText("User closed permission dialog...\n");&#13;
            switch (event.info.code) {&#13;
                case "SharedObject.Flush.Success":&#13;
                    output.appendText("User granted permission -- value saved.\n");&#13;
                    break;&#13;
                case "SharedObject.Flush.Failed":&#13;
                    output.appendText("User denied permission -- value not saved.\n");&#13;
                    break;&#13;
            }&#13;
            output.appendText("\n");&#13;
&#13;
            mySo.removeEventListener(NetStatusEvent.NET_STATUS, onFlushStatus);&#13;
        }&#13;
        &#13;
        // UI elements&#13;
        private var inputLbl:TextField;&#13;
        private var input:TextField;&#13;
        private var output:TextField;&#13;
        private var saveBtn:Sprite;&#13;
        private var clearBtn:Sprite;&#13;
    &#13;
        private function buildUI():void {&#13;
            // input label&#13;
            inputLbl = new TextField();&#13;
            addChild(inputLbl);&#13;
            inputLbl.x = 10;&#13;
            inputLbl.y = 10;&#13;
            inputLbl.text = "Value to save:";&#13;
            &#13;
            // input TextField&#13;
            input = new TextField();&#13;
            addChild(input);&#13;
            input.x = 80;&#13;
            input.y = 10;&#13;
            input.width = 100;&#13;
            input.height = 20;&#13;
            input.border = true;&#13;
            input.background = true;&#13;
            input.type = TextFieldType.INPUT;&#13;
            &#13;
            // output TextField&#13;
            output = new TextField();&#13;
            addChild(output);&#13;
            output.x = 10;&#13;
            output.y = 35;&#13;
            output.width = 250;&#13;
            output.height = 250;&#13;
            output.multiline = true;&#13;
            output.wordWrap = true;&#13;
            output.border = true;&#13;
            output.background = true;&#13;
            &#13;
            // Save button&#13;
            saveBtn = new Sprite();&#13;
            addChild(saveBtn);&#13;
            saveBtn.x = 190;&#13;
            saveBtn.y = 10;&#13;
            saveBtn.useHandCursor = true;&#13;
            saveBtn.graphics.lineStyle(1);&#13;
            saveBtn.graphics.beginFill(0xcccccc);&#13;
            saveBtn.graphics.drawRoundRect(0, 0, 30, 20, 5, 5);&#13;
            var saveLbl:TextField = new TextField();&#13;
            saveBtn.addChild(saveLbl);&#13;
            saveLbl.text = "Save";&#13;
            saveLbl.selectable = false;&#13;
            &#13;
            // Clear button&#13;
            clearBtn = new Sprite();&#13;
            addChild(clearBtn);&#13;
            clearBtn.x = 230;&#13;
            clearBtn.y = 10;&#13;
            clearBtn.useHandCursor = true;&#13;
            clearBtn.graphics.lineStyle(1);&#13;
            clearBtn.graphics.beginFill(0xcccccc);&#13;
            clearBtn.graphics.drawRoundRect(0, 0, 30, 20, 5, 5);&#13;
            var clearLbl:TextField = new TextField();&#13;
            clearBtn.addChild(clearLbl);&#13;
            clearLbl.text = "Clear";&#13;
            clearLbl.selectable = false;&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>