<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:9" /><meta name="runtime" content="lite" /><meta name="runtimever" content="lite:4" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:9" /><meta name="product" content="lite" /><meta name="productver" content="lite:4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="XMLSocket,flash.net.XMLSocket,connected,timeout,close,connect,send" /><title>XMLSocket - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.net</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  XMLSocket</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">XMLSocket  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
 &#13;
 XMLSocket &#12463;&#12521;&#12473;&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12477;&#12465;&#12483;&#12488;&#12434;&#23455;&#35013;&#12375;&#12390;&#12362;&#12426;&#12289;<span>Flash Player</span> &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12371;&#12398;&#12477;&#12465;&#12483;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;IP &#12450;&#12489;&#12524;&#12473;&#12414;&#12383;&#12399;&#12489;&#12513;&#12452;&#12531;&#21517;&#12391;&#35672;&#21029;&#12373;&#12428;&#12427;&#12469;&#12540;&#12496;&#12540;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12392;&#36890;&#20449;&#12391;&#12365;&#12414;&#12377;&#12290; XMLSocket &#12463;&#12521;&#12473;&#12399;&#12289;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12398;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;&#12394;&#12393;&#24453;&#12385;&#26178;&#38291;&#12434;&#30701;&#12367;&#12377;&#12427;&#12371;&#12392;&#12364;&#27714;&#12417;&#12425;&#12428;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;/&#12469;&#12540;&#12496;&#12540;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#36969;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#24467;&#26469;&#12398; HTTP &#12505;&#12540;&#12473;&#12481;&#12515;&#12483;&#12488;&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531;&#12399;&#38971;&#32321;&#12395;&#12469;&#12540;&#12496;&#12540;&#12434;&#12509;&#12540;&#12522;&#12531;&#12464;&#12375;&#12289;HTTP &#35201;&#27714;&#12434;&#20351;&#29992;&#12375;&#12390;&#26032;&#12375;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#12289;XMLSocket &#12481;&#12515;&#12483;&#12488;&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531;&#12399;&#12469;&#12540;&#12496;&#12540;&#12395;&#23550;&#12375;&#12390;&#38283;&#12356;&#12383;&#25509;&#32154;&#12434;&#32173;&#25345;&#12377;&#12427;&#12383;&#12417;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12363;&#12425;&#35201;&#27714;&#12434;&#21463;&#12369;&#12378;&#12395;&#12383;&#12384;&#12385;&#12395;&#30528;&#20449;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;XMLSocket &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12399; XMLSocket &#12463;&#12521;&#12473;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12503;&#12525;&#12488;&#12467;&#12523;&#12395;&#23550;&#24540;&#12375;&#12383;&#12487;&#12540;&#12514;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#35500;&#26126;&#12434;&#27425;&#12398;&#19968;&#35239;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290; &#13;
 <ul><li>XML &#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12289;&#20840;&#20108;&#37325; TCP/IP &#12473;&#12488;&#12522;&#12540;&#12512;&#12477;&#12465;&#12483;&#12488;&#25509;&#32154;&#12434;&#20171;&#12375;&#12390;&#36865;&#12425;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#20491;&#12293;&#12398; XML &#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#23436;&#20840;&#12394; XML &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#12354;&#12426;&#12289;&#12476;&#12525;&#65288;0&#65289;&#12496;&#12452;&#12488;&#12391;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                  <li>1 &#12388;&#12398; XMLSocket &#25509;&#32154;&#12434;&#20351;&#29992;&#12375;&#12390;&#36865;&#21463;&#20449;&#12391;&#12365;&#12427; XML &#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25968;&#12395;&#21046;&#38480;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</li>&#13;
               </ul><p>XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#36890;&#20449;&#12377;&#12427;&#12424;&#12358;&#12395;&#12469;&#12540;&#12496;&#12540;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#21839;&#38988;&#12364;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12398;&#12452;&#12531;&#12479;&#12521;&#12463;&#12486;&#12451;&#12502;&#27231;&#33021;&#12434;&#24517;&#35201;&#12392;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;XMLSocket &#12463;&#12521;&#12473;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;URLLoader &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; </p>&#13;
 &#13;
               <p>XMLSocket &#12463;&#12521;&#12473;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;&#12414;&#12378; <code>new XMLSocket</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12434;&#20351;&#29992;&#12375;&#12390; XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20869;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12399;&#12477;&#12465;&#12483;&#12488;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>&#13;
      &#13;
               <p> &#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#19978;&#12398;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12391;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12477;&#12465;&#12483;&#12488;&#25509;&#32154;&#12391;&#12365;&#12427;&#12507;&#12473;&#12488;&#12392;&#12289;&#12381;&#12398;&#25509;&#32154;&#12364;&#12391;&#12365;&#12427;&#12509;&#12540;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<i></i>Flash Player &#12398;&#26368;&#36817;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#12399;&#12289;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35201;&#20214;&#12364;&#20197;&#21069;&#12424;&#12426;&#21427;&#23494;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;Flash Player &#12398;&#12377;&#12409;&#12390;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12289;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;&#29872;&#22659;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12398;&#20351;&#29992;&#12364;&#24517;&#38920;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#12364;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>&#13;
 &#13;
               <p>&#27425;&#12398;&#19968;&#35239;&#12399;&#12289;Flash Player &#12398;&#21508;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12362;&#12369;&#12427;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12398;&#35201;&#20214;&#12434;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;</p>&#13;
 &#13;
               <ul><li> Flash Player 9.0.124.0 &#20197;&#38477;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;XMLSocket &#25509;&#32154;&#12395;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12509;&#12540;&#12488;&#12395;&#12399;&#38306;&#20418;&#12394;&#12367;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#19978;&#12395;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#12414;&#12383;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#21516;&#12376;&#12507;&#12473;&#12488;&#19978;&#12398;&#12509;&#12540;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12391;&#12418;&#21516;&#27096;&#12391;&#12377;&#12290; </li>&#13;
                  <li> Flash Player 9.0.115.0 &#20197;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;1024 &#26410;&#28288;&#12398;&#12509;&#12540;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12363;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12507;&#12473;&#12488;&#20197;&#22806;&#12398;&#12507;&#12473;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#19978;&#12395;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; </li>&#13;
                  <li> Flash Player 9.0.115.0 &#12391;&#12399;&#12289;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#19981;&#35201;&#12394;&#22580;&#21512;&#12391;&#12418;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#12364;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12365;&#12395; Flash Debug Player &#12434;&#20351;&#12358;&#12392;&#35686;&#21578;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290; </li>&#13;
               </ul><p>&#12383;&#12384;&#12375;&#12289;Adobe AIR &#12391;&#12399;&#12289;<code>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</code>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20869;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#20849;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#38480;&#12395;&#12424;&#12427;&#21046;&#38480;&#12434;&#21463;&#12369;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
            <p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><p id="moreExamples"><span class="classHeaderTableLabel">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7cfb.html" target="_blank">&#12496;&#12452;&#12490;&#12522;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12477;&#12465;&#12483;&#12488;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7c63.html" target="_blank">&#12477;&#12465;&#12483;&#12488;&#12408;&#12398;&#25509;&#32154;</a></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="URLLoader.html#load()" target="">flash.net.URLLoader.load()</a><br /><a href="URLLoader.html" target="">flash.net.URLLoader</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#connected" class="signatureLink">connected</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
     &#12371;&#12398; XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#29694;&#22312;&#12289;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">XMLSocket</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#timeout" class="signatureLink">timeout</a> : <a href="../../int.html">int</a><div class="summaryTableDescription">&#13;
     &#25509;&#32154;&#12414;&#12391;&#12398;&#24453;&#12385;&#26178;&#38291;&#65288;&#12511;&#12522;&#31186;&#25968;&#65289;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">XMLSocket</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#XMLSocket()" class="signatureLink">XMLSocket</a>(host:<a href="../../String.html">String</a> = null, port:<a href="../../int.html">int</a> = 0)</div><div class="summaryTableDescription">&#13;
    &#26032;&#12375;&#12356; XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">XMLSocket</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#close()" class="signatureLink">close</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#25509;&#32154;&#12434;&#38281;&#12376;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">XMLSocket</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#connect()" class="signatureLink">connect</a>(host:<a href="../../String.html">String</a>, port:<a href="../../int.html">int</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#25351;&#23450;&#12373;&#12428;&#12383; TCP &#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12507;&#12473;&#12488;&#12408;&#12398;&#25509;&#32154;&#12434;&#30906;&#31435;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">XMLSocket</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#send()" class="signatureLink">send</a>(object:<a href="../../specialTypes.html#*">*</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     object &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383; XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12414;&#12383;&#12399;&#12487;&#12540;&#12479;&#12434;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12375;&#12289;&#12381;&#12398;&#24460;&#12429;&#12395;&#12476;&#12525;&#65288;0&#65289;&#12496;&#12452;&#12488;&#12434;&#20184;&#21152;&#12375;&#12390;&#12469;&#12540;&#12496;&#12540;&#12395;&#36578;&#36865;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">XMLSocket</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:close" class="signatureLink">close</a></div></td><td class="summaryTableDescription summaryTableCol">&#12469;&#12540;&#12496;&#12540;&#12395;&#12424;&#12426;&#12477;&#12465;&#12483;&#12488;&#25509;&#32154;&#12364;&#38281;&#12376;&#12425;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">XMLSocket</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:connect" class="signatureLink">connect</a></div></td><td class="summaryTableDescription summaryTableCol">XMLSocket.connect() &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12364;&#25104;&#21151;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">XMLSocket</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:data" class="signatureLink">data</a></div></td><td class="summaryTableDescription summaryTableCol">&#26410;&#20966;&#29702;&#12398;&#12487;&#12540;&#12479;&#12364;&#36865;&#21463;&#20449;&#12373;&#12428;&#12383;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">XMLSocket</td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:ioError" class="signatureLink">ioError</a></div></td><td class="summaryTableDescription summaryTableCol">&#20837;&#20986;&#21147;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12390;&#36865;&#20449;&#12414;&#12383;&#12399;&#21463;&#20449;&#25805;&#20316;&#12364;&#22833;&#25943;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">XMLSocket</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#event:securityError" class="signatureLink">securityError</a></div></td><td class="summaryTableDescription summaryTableCol">XMLSocket.connect() &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12387;&#12390;&#12289;&#21628;&#12403;&#20986;&#12375;&#20803;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12398;&#22806;&#12395;&#12354;&#12427;&#12469;&#12540;&#12496;&#12540;&#12420; 1024 &#26410;&#28288;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12395;&#23550;&#12375;&#12390;&#25509;&#32154;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol">XMLSocket</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/connected" class="dashAnchor" id="//apple_ref/cpp/Property/connected"></a><a name="connected" id="connected"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>connected</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>connected:<a href="../../Boolean.html">Boolean</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#12371;&#12398; XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#29694;&#22312;&#12289;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;<code>connect</code> &#12452;&#12505;&#12531;&#12488;&#12392; <code>ioError</code> &#12452;&#12505;&#12531;&#12488;&#12395;&#23550;&#12375;&#12390;&#30331;&#37682;&#12434;&#34892;&#12356;&#12289;&#25509;&#32154;&#12364;&#25104;&#21151;&#12375;&#12383;&#12363;&#12393;&#12358;&#12363;&#12434;&#35519;&#12409;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get connected():<a href="../../Boolean.html">Boolean</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="XMLSocket.html#event:connect" target="">connect</a><br /><a href="XMLSocket.html#event:ioError" target="">ioError</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/timeout" class="dashAnchor" id="//apple_ref/cpp/Property/timeout"></a><a name="timeout" id="timeout"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>timeout</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>timeout:<a href="../../int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#25509;&#32154;&#12414;&#12391;&#12398;&#24453;&#12385;&#26178;&#38291;&#65288;&#12511;&#12522;&#31186;&#25968;&#65289;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>&#25351;&#23450;&#12375;&#12383;&#26178;&#38291;&#20869;&#12395;&#25509;&#32154;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12392;&#12365;&#12399;&#12289;&#25509;&#32154;&#12364;&#22833;&#25943;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; 20,000 (20 &#31186;) &#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get timeout():<a href="../../int.html">int</a></code><br /><code>&#160;&#160;&#160;&#160;public function set timeout(value:<a href="../../int.html">int</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Constructor/XMLSocket()" class="dashAnchor" id="//apple_ref/cpp/Constructor/XMLSocket()"></a><a name="XMLSocket()" id="XMLSocket()"></a><a name="XMLSocket(String,int)" id="XMLSocket(String,int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>XMLSocket</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function XMLSocket(host:<a href="../../String.html">String</a> = null, port:<a href="../../int.html">int</a> = 0)</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p>&#13;
    &#26032;&#12375;&#12356; XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#12392;&#12289;&#21021;&#26399;&#29366;&#24907;&#12391;&#12399;&#26410;&#25509;&#32154;&#12398;&#12477;&#12465;&#12483;&#12488;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12375;&#12383;&#12507;&#12473;&#12488;&#12362;&#12424;&#12403;&#12509;&#12540;&#12488;&#12408;&#12398;&#25509;&#32154;&#12364;&#35430;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
    &#13;
    </p><p><b>&#27880;&#24847;&#65306;</b><b>&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12379;&#12378;&#12395;</b>&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12501;&#12457;&#12540;&#12512;&#12434;&#20351;&#29992;&#12375;&#12289;&#12373;&#12425;&#12395;&#12356;&#12378;&#12428;&#12363;&#12398;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12434;&#36861;&#21152;&#12375;&#12289;<code>connect</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12434;&#24375;&#12367;&#25512;&#22888;&#12375;&#12414;&#12377;&#65288;<code>&#12507;&#12473;&#12488;</code>&#12362;&#12424;&#12403;<code>&#12509;&#12540;&#12488;</code>&#12434;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#25351;&#23450;&#12377;&#12427;&#65289;&#12290;&#12371;&#12398;&#12471;&#12540;&#12465;&#12531;&#12473;&#12395;&#12424;&#12387;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#27491;&#12375;&#12367;&#21205;&#20316;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
    &#13;
    <span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">host</span>:<a href="../../String.html">String</a></code> (default = <code>null</code>)<code></code> &#8212; FQDN&#65288;&#23436;&#20840;&#20462;&#39166;&#12489;&#12513;&#12452;&#12531;&#21517;&#65289;&#12289;&#12388;&#12414;&#12426; <i>111.222.333.444</i> &#12392;&#12356;&#12358;&#24418;&#24335;&#12398; IP &#12450;&#12489;&#12524;&#12473;&#12391;&#12377;&#12290;Flash Player 9.0.115.0 &#12362;&#12424;&#12403; AIR 1.0 &#20197;&#38477;&#12391;&#12399;&#12289;rtmp://[2001:db8:ccc3:ffff:0:444d:555e:666f] &#12394;&#12393;&#12398; IPv6 &#12450;&#12489;&#12524;&#12473;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;<code>null</code> &#12434;&#25351;&#23450;&#12375;&#12390;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12377;&#12427;&#12507;&#12473;&#12488;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#21628;&#12403;&#20986;&#12375;&#20803;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364; Web &#12502;&#12521;&#12454;&#12470;&#12540;&#20869;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;<code>host</code> &#12364; SWF &#12501;&#12449;&#12452;&#12523;&#12392;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
    &#13;
    </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">port</span>:<a href="../../int.html">int</a></code> (default = <code>0</code>)<code></code> &#8212; &#25509;&#32154;&#12398;&#30906;&#31435;&#12395;&#20351;&#29992;&#12377;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#19978;&#12398; TCP &#12509;&#12540;&#12488;&#30058;&#21495;&#12391;&#12377;&#12290;Flash Player 9.0.124.0 &#20197;&#38477;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#12399;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12377;&#12427;&#12507;&#12473;&#12488;&#12363;&#12425;&#25351;&#23450;&#12398;&#12509;&#12540;&#12488;&#12408;&#12398;&#12477;&#12465;&#12483;&#12488;&#25509;&#32154;&#12434;&#35377;&#21487;&#12377;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12383;&#12289;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20197;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; Flash Player &#12391;&#12399;&#12289;1024 &#30058;&#26410;&#28288;&#12398;&#12509;&#12540;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12363;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12507;&#12473;&#12488;&#20197;&#22806;&#12398;&#12507;&#12473;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12392;&#12365;&#12398;&#12415;&#12289;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#13;
    &#13;
    &#13;
    </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="XMLSocket.html#connect()" target="">connect()</a></div></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/close()" class="dashAnchor" id="//apple_ref/cpp/Method/close()"></a><a name="close()" id="close()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>close</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function close():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#25509;&#32154;&#12434;&#38281;&#12376;&#12414;&#12377;&#12290;<code>close</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#12424;&#12426;&#25509;&#32154;&#12364;&#38281;&#12376;&#12425;&#12428;&#12383;&#12392;&#12365;&#12398;&#12415;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>close()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12418;&#36865;&#20986;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
     </p><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7cfb.html" target="_blank">&#12496;&#12452;&#12490;&#12522;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12477;&#12465;&#12483;&#12488;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="XMLSocket.html#connect()" target="">connect()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/connect()" class="dashAnchor" id="//apple_ref/cpp/Method/connect()"></a><a name="connect()" id="connect()"></a><a name="connect(String,int)" id="connect(String,int)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>connect</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function connect(host:<a href="../../String.html">String</a>, port:<a href="../../int.html">int</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#25351;&#23450;&#12373;&#12428;&#12383; TCP &#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12507;&#12473;&#12488;&#12408;&#12398;&#25509;&#32154;&#12434;&#30906;&#31435;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><code>null</code> &#12434; <code>host</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#23550;&#12375;&#12390;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;<code>XMLSocket.connect()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12377;&#12427;&#12507;&#12473;&#12488;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;www.adobe.com &#12363;&#12425;&#21628;&#12403;&#20986;&#12375;&#20803;&#12501;&#12449;&#12452;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;host &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395; <code>null</code> &#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;www.adobe.com &#12395;&#25509;&#32154;&#12377;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     &#13;
     <p>&#12501;&#12449;&#12452;&#12523;&#12364;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;SWF &#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#21547;&#12416; HTML &#12506;&#12540;&#12472;&#12395; <code>allowNetworking</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65288;<code>object</code> &#12479;&#12464;&#12362;&#12424;&#12403; <code>embed</code> &#12479;&#12464;&#65289;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">host</span>:<a href="../../String.html">String</a></code> &#8212; FQDN&#65288;&#23436;&#20840;&#20462;&#39166;&#12489;&#12513;&#12452;&#12531;&#21517;&#65289;&#12289;&#12388;&#12414;&#12426; <i>111.222.333.444</i> &#12392;&#12356;&#12358;&#24418;&#24335;&#12398; IP &#12450;&#12489;&#12524;&#12473;&#12391;&#12377;&#12290;<code>null</code> &#12434;&#25351;&#23450;&#12375;&#12390;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12377;&#12427;&#12507;&#12473;&#12488;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#21628;&#12403;&#20986;&#12375;&#20803;&#12501;&#12449;&#12452;&#12523;&#12364; Web &#12502;&#12521;&#12454;&#12470;&#12540;&#20869;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;<code>host</code> &#12364;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12392;&#21516;&#12376;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">port</span>:<a href="../../int.html">int</a></code> &#8212; &#25509;&#32154;&#12398;&#30906;&#31435;&#12395;&#20351;&#29992;&#12377;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#19978;&#12398; TCP &#12509;&#12540;&#12488;&#30058;&#21495;&#12391;&#12377;&#12290;Flash Player 9.0.124.0 &#20197;&#38477;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#12399;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12377;&#12427;&#12507;&#12473;&#12488;&#12363;&#12425;&#25351;&#23450;&#12398;&#12509;&#12540;&#12488;&#12408;&#12398;&#12477;&#12465;&#12483;&#12488;&#25509;&#32154;&#12434;&#35377;&#21487;&#12377;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12383;&#12289;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20197;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; Flash Player &#12391;&#12399;&#12289;1024 &#30058;&#26410;&#28288;&#12398;&#12509;&#12540;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12363;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12507;&#12473;&#12488;&#20197;&#22806;&#12398;&#12507;&#12473;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12392;&#12365;&#12398;&#12415;&#12289;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#13;
     &#13;
     &#13;
     </td></tr></table><br /><span class="label">&#12452;&#12505;&#12531;&#12488;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><b>securityError</b>:<a href="../../flash/events/SecurityErrorEvent.html"><code>SecurityErrorEvent</code></a></code> &#8212; &#25509;&#32154;&#25805;&#20316;&#12391;&#12289;&#21628;&#12403;&#20986;&#12375;&#20596;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12398;&#22806;&#37096;&#12398;&#12507;&#12473;&#12488;&#12289;&#12414;&#12383;&#12399;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12394;&#12509;&#12540;&#12488;&#12395;&#25509;&#32154;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;&#12479;&#12540;&#12466;&#12483;&#12488;&#12507;&#12473;&#12488;&#19978;&#12391;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#20001;&#26041;&#12398;&#21839;&#38988;&#12434;&#22238;&#36991;&#12375;&#12414;&#12377;&#12290;&#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>data</b>:<a href="../../flash/events/DataEvent.html"><code>DataEvent</code></a></code> &#8212; &#26410;&#20966;&#29702;&#12398;&#12487;&#12540;&#12479;&#12434;&#21463;&#20449;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>connect</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#25509;&#32154;&#12364;&#30906;&#31435;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
      &#13;
      </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#20449;&#38972;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12399;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12408;&#12398;&#25509;&#32154;&#12434;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434; local-with-networking &#12414;&#12383;&#12399; trusted &#12392;&#12375;&#12390;&#20998;&#39006;&#12375;&#30452;&#12377;&#12371;&#12392;&#12391;&#12289;&#12371;&#12398;&#21046;&#38480;&#12434;&#22238;&#36991;&#12375;&#12414;&#12377;&#12290;&#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; 65535 &#12424;&#12426;&#22823;&#12365;&#12356;&#12477;&#12465;&#12483;&#12488;&#12509;&#12540;&#12488;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7cfb.html" target="_blank">&#12496;&#12452;&#12490;&#12522;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12477;&#12465;&#12483;&#12488;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7c63.html" target="_blank">&#12477;&#12465;&#12483;&#12488;&#12408;&#12398;&#25509;&#32154;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/events/Event.html#CONNECT" target="">flash.events.Event.CONNECT</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/send()" class="dashAnchor" id="//apple_ref/cpp/Method/send()"></a><a name="send()" id="send()"></a><a name="send(any)" id="send(any)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>send</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function send(object:<a href="../../specialTypes.html#*">*</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     <code>object</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383; XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12414;&#12383;&#12399;&#12487;&#12540;&#12479;&#12434;&#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22793;&#25563;&#12375;&#12289;&#12381;&#12398;&#24460;&#12429;&#12395;&#12476;&#12525;&#65288;0&#65289;&#12496;&#12452;&#12488;&#12434;&#20184;&#21152;&#12375;&#12390;&#12469;&#12540;&#12496;&#12540;&#12395;&#36578;&#36865;&#12375;&#12414;&#12377;&#12290;<code>object</code> &#12364; XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12399; XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; XML &#12486;&#12461;&#12473;&#12488;&#34920;&#29694;&#12391;&#12377;&#12290;&#36865;&#20449;&#25805;&#20316;&#12399;&#38750;&#21516;&#26399;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#36578;&#36865;&#20966;&#29702;&#12399;&#12383;&#12384;&#12385;&#12395;&#32066;&#20102;&#12375;&#12414;&#12377;&#12364;&#12289;&#12487;&#12540;&#12479;&#12364;&#36578;&#36865;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;&#12381;&#12398;&#24460;&#12391;&#12377;&#12290;<code>XMLSocket.send()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12487;&#12540;&#12479;&#12364;&#27491;&#24120;&#12395;&#36578;&#36865;&#12373;&#12428;&#12383;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#20516;&#12434;&#36820;&#12375;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
     </p><p><code>XMLSocket.connect()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;<code>XMLSocket.send()</code> &#25805;&#20316;&#12399;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">object</span>:<a href="../../specialTypes.html#*">*</a></code> &#8212; &#12469;&#12540;&#12496;&#12540;&#12395;&#36578;&#36865;&#12377;&#12427; XML &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12414;&#12383;&#12399;&#20182;&#12398;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/errors/IOError.html">IOError</a> </code> &#8212; XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7cfb.html" target="_blank">&#12496;&#12452;&#12490;&#12522;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12477;&#12465;&#12483;&#12488;</a></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="XMLSocket.html#connect()" target="">connect()</a></div></div></span><div class="detailSectionHeader"> &#12452;&#12505;&#12531;&#12488;&#12398;&#35443;&#32048; </div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:close" id="event:close"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>close</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/Event.html"><code>flash.events.Event</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; Event.type  =  </span><a href="../../flash/events/Event.html#CLOSE"><code>flash.events.Event.CLOSE</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 &#12469;&#12540;&#12496;&#12540;&#12395;&#12424;&#12426;&#12477;&#12465;&#12483;&#12488;&#25509;&#32154;&#12364;&#38281;&#12376;&#12425;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>close</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#12424;&#12426;&#25509;&#32154;&#12364;&#38281;&#12376;&#12425;&#12428;&#12383;&#12392;&#12365;&#12398;&#12415;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>XMLSocket.close()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12418;&#36865;&#20986;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
 </p>&#13;
	<code>Event.CLOSE</code> &#23450;&#25968;&#12399;&#12289;<code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>close</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#13;
	&#13;
	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#25509;&#32154;&#12364;&#38281;&#12376;&#12425;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:connect" id="event:connect"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>connect</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/Event.html"><code>flash.events.Event</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; Event.type  =  </span><a href="../../flash/events/Event.html#CONNECT"><code>flash.events.Event.CONNECT</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 <code>XMLSocket.connect()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12364;&#25104;&#21151;&#12375;&#12383;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
	<code>Event.CONNECT</code> &#23450;&#25968;&#12399;&#12289;<code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>connect</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#13;
	&#13;
	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#25509;&#32154;&#12434;&#30906;&#31435;&#12375;&#12383; Socket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12414;&#12383;&#12399; XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:data" id="event:data"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>data</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/DataEvent.html"><code>flash.events.DataEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; DataEvent.type  =  </span><a href="../../flash/events/DataEvent.html#DATA"><code>flash.events.DataEvent.DATA</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 &#26410;&#20966;&#29702;&#12398;&#12487;&#12540;&#12479;&#12364;&#36865;&#21463;&#20449;&#12373;&#12428;&#12383;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
	<code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>data</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;  &#13;
	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	&#13;
	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>data</code></td><td>Flash Player &#12414;&#12383;&#12399; Adobe AIR &#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#29983;&#12487;&#12540;&#12479;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12487;&#12540;&#12479;&#12434;&#21463;&#12369;&#21462;&#12427; XMLSocket &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:ioError" id="event:ioError"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>ioError</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/IOErrorEvent.html"><code>flash.events.IOErrorEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; IOErrorEvent.type  =  </span><a href="../../flash/events/IOErrorEvent.html#IO_ERROR"><code>flash.events.IOErrorEvent.IO_ERROR</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 &#20837;&#20986;&#21147;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12390;&#36865;&#20449;&#12414;&#12383;&#12399;&#21463;&#20449;&#25805;&#20316;&#12364;&#22833;&#25943;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
 </p>&#13;
	<code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>ioError</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#13;
	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>errorID</code></td><td>&#29305;&#23450;&#12398;&#12456;&#12521;&#12540;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#21442;&#29031;&#30058;&#21495;&#12391;&#12377;&#65288;AIR &#12398;&#12415;&#65289;&#12290;</td></tr><tr><td><code>target</code></td><td>&#20837;&#20986;&#21147;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12383;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>text</code></td><td>&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12427;&#12486;&#12461;&#12473;&#12488;&#12391;&#12377;&#12290;</td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="event:securityError" id="event:securityError"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>securityError</h3></td><td class="detailHeaderType"> &#12452;&#12505;&#12531;&#12488; </td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><span class="label">&#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22411;: </span><a href="../../flash/events/SecurityErrorEvent.html"><code>flash.events.SecurityErrorEvent</code></a><br /><span class="label">&#12503;&#12525;&#12497;&#12486;&#12451; SecurityErrorEvent.type  =  </span><a href="../../flash/events/SecurityErrorEvent.html#SECURITY_ERROR"><code>flash.events.SecurityErrorEvent.SECURITY_ERROR</code></a><br /><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
 <code>XMLSocket.connect()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12387;&#12390;&#12289;&#21628;&#12403;&#20986;&#12375;&#20803;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12398;&#22806;&#12395;&#12354;&#12427;&#12469;&#12540;&#12496;&#12540;&#12420; 1024 &#26410;&#28288;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12395;&#23550;&#12375;&#12390;&#25509;&#32154;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 </p>&#13;
	<code>SecurityErrorEvent.SECURITY_ERROR</code> &#23450;&#25968;&#12399;&#12289;<code>type</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>securityError</code> &#12452;&#12505;&#12531;&#12488;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12398;&#20516;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#13;
	&#13;
	<p>&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	<table class="innertable"><tr><th>&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#20516;</th></tr><tr><td><code>bubbles</code></td><td><code>false</code></td></tr><tr><td><code>cancelable</code></td><td><code>false</code> &#12399;&#12289;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</td></tr><tr><td><code>currentTarget</code></td><td>&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12391; Event &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>target</code></td><td>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12456;&#12521;&#12540;&#12434;&#22577;&#21578;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</td></tr><tr><td><code>text</code></td><td>&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12427;&#12486;&#12461;&#12473;&#12488;&#12391;&#12377;&#12290;</td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="XMLSocket.html#connect()" target="">XMLSocket.connect()</a></div></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">XMLSocketExample.as</div><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#12463;&#12521;&#12473; XMLSocketExample &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;XMLSocket &#12391;&#12487;&#12540;&#12479;&#12434;&#36865;&#20449;&#12375;&#12289;XMLSocket &#12452;&#12505;&#12531;&#12488;&#26178;&#12395;&#24773;&#22577;&#12434;&#12503;&#12522;&#12531;&#12488;&#12375;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#12399;&#20197;&#19979;&#12398;&#25163;&#38918;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#13;
 <ol><li>XMLSocketExample &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12364; <code>socket</code> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398; XMLSocket &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12289;<code>socket</code> &#12434;&#24460;&#36848;&#12398; <code>ConfigureListeners()</code> &#12395;&#28193;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395; XMLSocket &#12398; <code>connect()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12399;&#12289;&#12507;&#12473;&#12488;&#21517; "localhost" &#12392;&#12509;&#12540;&#12488;&#30058;&#21495; <code>8080</code> &#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</li><li><code>configureListeners()</code>&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#21508; XMLSocket &#12452;&#12505;&#12531;&#12488;&#12398;&#12522;&#12473;&#12490;&#12540;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#13;
  <ul><li><code>closeHandler()</code>&#65306;<code>close</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#25509;&#32154;&#12364;&#38281;&#12376;&#12425;&#12428;&#12383;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>connectHandler()</code>&#65306;<code>connect</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#25509;&#32154;&#12364;&#30906;&#31435;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>dataHandler()</code>&#65306;<code>data</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399; XMLSocket &#12364;&#26032;&#12375;&#12356;&#12487;&#12540;&#12479;&#12434;&#21463;&#12369;&#21462;&#12427;&#12383;&#12403;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>progressHandler()</code>&#65306;<code>progress</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399; <code>send()</code> &#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#12392;&#12365;&#12289;&#36865;&#20449;&#20013;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>securityErrorHandler()</code>&#65306;<code>securityError</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12391;&#12398;&#20877;&#29983;&#12395;&#38306;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#35492;&#12387;&#12390;&#35373;&#23450;&#12375;&#12390;&#12289;&#12414;&#12383;&#12399; 1024 &#12424;&#12426;&#23567;&#12373;&#12356;&#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;XMLSocket &#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>ioErrorHandler()</code>&#65306;<code>ioError</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12483;&#12473;&#12531;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12487;&#12540;&#12479;&#12398;&#36865;&#20449;&#12414;&#12383;&#12399;&#21463;&#20449;&#25805;&#20316;&#12395;&#22833;&#25943;&#12377;&#12427;&#12392;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</li></ul></li></ol><p><b>&#27880;&#24847;&#65306;</b>&#13;
 </p><ul><li>&#12300;&#12525;&#12540;&#12459;&#12523;&#12391;&#12398;&#20877;&#29983;&#12395;&#38306;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12434;&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12395;&#12398;&#12415;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12301;&#12395;&#35373;&#23450;&#12375;&#12390; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</li><li>&#12371;&#12398;&#12467;&#12540;&#12489;&#20363;&#12364;&#21205;&#20316;&#12377;&#12427;&#12395;&#12399;&#12289;&#12509;&#12540;&#12488; 8080 &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12489;&#12513;&#12452;&#12531;&#21517;&#19978;&#12391;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12469;&#12540;&#12496;&#12540;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;</li><li>Flash Player 9.0.124.0 &#20197;&#38477;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#12363;&#12425;&#12509;&#12540;&#12488; 8080 &#12408;&#12398;&#12477;&#12465;&#12483;&#12488;&#25509;&#32154;&#12434;&#35377;&#21487;&#12377;&#12427;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#12469;&#12540;&#12496;&#12540;&#19978;&#12395;&#32622;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12398;&#25552;&#20379;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;<a href="http://www.adobe.com/jp/devnet/flashplayer/articles/socket_policy_files.html" target="external">&#12477;&#12465;&#12483;&#12488;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12469;&#12540;&#12496;&#12540;&#12398;&#35373;&#23450;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</li></ul><div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
&#13;
package {&#13;
    import flash.display.Sprite;&#13;
    import flash.events.*;&#13;
    import flash.net.XMLSocket;&#13;
&#13;
    public class XMLSocketExample extends Sprite {&#13;
        private var hostName:String = "localhost";&#13;
        private var port:uint = 8080;&#13;
        private var socket:XMLSocket;&#13;
&#13;
        public function XMLSocketExample() {&#13;
            socket = new XMLSocket();&#13;
            configureListeners(socket);&#13;
            if (hostName &amp;&amp; port) {&#13;
                socket.connect(hostName, port);&#13;
            }&#13;
        }&#13;
&#13;
        public function send(data:Object):void {&#13;
            socket.send(data);&#13;
        }&#13;
&#13;
        private function configureListeners(dispatcher:IEventDispatcher):void {&#13;
            dispatcher.addEventListener(Event.CLOSE, closeHandler);&#13;
            dispatcher.addEventListener(Event.CONNECT, connectHandler);&#13;
            dispatcher.addEventListener(DataEvent.DATA, dataHandler);&#13;
            dispatcher.addEventListener(IOErrorEvent.IO_ERROR, ioErrorHandler);&#13;
            dispatcher.addEventListener(ProgressEvent.PROGRESS, progressHandler);&#13;
            dispatcher.addEventListener(SecurityErrorEvent.SECURITY_ERROR, securityErrorHandler);&#13;
        }&#13;
&#13;
        private function closeHandler(event:Event):void {&#13;
            trace("closeHandler: " + event);&#13;
        }&#13;
&#13;
        private function connectHandler(event:Event):void {&#13;
            trace("connectHandler: " + event);&#13;
        }&#13;
&#13;
        private function dataHandler(event:DataEvent):void {&#13;
            trace("dataHandler: " + event);&#13;
        }&#13;
&#13;
        private function ioErrorHandler(event:IOErrorEvent):void {&#13;
            trace("ioErrorHandler: " + event);&#13;
        }&#13;
&#13;
        private function progressHandler(event:ProgressEvent):void {&#13;
            trace("progressHandler loaded:" + event.bytesLoaded + " total: " + event.bytesTotal);&#13;
        }&#13;
&#13;
        private function securityErrorHandler(event:SecurityErrorEvent):void {&#13;
            trace("securityErrorHandler: " + event);&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>