<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:10" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:1.5" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:10" /><meta name="product" content="air" /><meta name="productver" content="air:1.5" /><meta name="product" content="flex" /><meta name="prodver" content="flex:4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="BasicLayout,spark.layouts.BasicLayout" /><title>BasicLayout - Adobe ActionScript&#174; 3&#65288;AS3  Flex&#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">spark.layouts</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  BasicLayout</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">BasicLayout  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../spark/layouts/supportClasses/LayoutBase.html">LayoutBase</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../mx/utils/OnDemandEventDispatcher.html">OnDemandEventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr><tr><td class="classHeaderTableLabel">&#12469;&#12502;&#12463;&#12521;&#12473;</td><td> <a href="../../com/adobe/mosaic/layouts/StackLayout.html">StackLayout</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
  BasicLayout &#12463;&#12521;&#12473;&#12399;&#12289;&#21508;&#12524;&#12452;&#12450;&#12454;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#35373;&#23450;&#12395;&#24467;&#12356;&#30456;&#20114;&#12395;&#29420;&#31435;&#12375;&#12390;&#37197;&#32622;&#12375;&#12414;&#12377;&#12290;BasicLayout&#65288;&#32118;&#23550;&#12524;&#12452;&#12450;&#12454;&#12488;&#65289;&#12391;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#12381;&#12428;&#12382;&#12428;&#12398;&#23376;&#12398;&#20301;&#32622;&#12434;&#26126;&#31034;&#30340;&#12395;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#20301;&#32622;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#23376;&#12398; <code>x</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392; <code>y</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12289;&#12414;&#12383;&#12399;&#21046;&#32004;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
  <p>&#13;
                  <b>&#12513;&#12514;&#65306;</b>Spark &#12398;&#12522;&#12473;&#12488;&#12505;&#12540;&#12473;&#12398;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#65288;Spark &#12398; List &#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12392;&#12289;&#12381;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12391;&#12354;&#12427; ButtonBar&#12289;ComboBox&#12289;DropDownList&#12289;TabBar&#65289;&#12391;&#12399;&#12289;BasicLayout &#12463;&#12521;&#12473;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;Spark &#12398;&#12522;&#12473;&#12488;&#12505;&#12540;&#12473;&#12398;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12391;&#12399;&#12289;BasicLayout &#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
               <p>&#12456;&#12524;&#12513;&#12531;&#12488;&#12372;&#12392;&#12395;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#21046;&#32004;&#12399;&#12289;<code>left</code>&#12289;<code>right</code>&#12289;<code>top</code>&#12289;<code>bottom</code>&#12289;<code>horizontalCenter</code>&#12289;<code>verticalCenter</code>&#12289;<code>baseline</code>&#12289;<code>percentWidth</code>&#12289;<code>percentHeight</code> &#12391;&#12377;&#12290;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;&#12392;&#26368;&#22823;&#12469;&#12452;&#12474;&#12399;&#12289;&#24517;&#12378;&#38918;&#23432;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12467;&#12531;&#12486;&#12490;&#12398;&#28204;&#23450;&#12469;&#12452;&#12474;&#12399;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12289;&#12381;&#12398;&#21046;&#32004;&#12362;&#12424;&#12403;&#25512;&#22888;&#12469;&#12452;&#12474;&#12363;&#12425;&#35336;&#31639;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12531;&#12486;&#12490;&#12398;&#28204;&#23450;&#12469;&#12452;&#12474;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12289;&#21046;&#32004;&#12434;&#28288;&#12383;&#12375;&#12394;&#12364;&#12425;&#25512;&#22888;&#12469;&#12452;&#12474;&#12391;&#21454;&#12417;&#12427;&#12398;&#12395;&#21313;&#20998;&#12394;&#22823;&#12365;&#12373;&#12391;&#12377;&#12290; </p>&#13;
 &#13;
               <p>&#28204;&#23450;&#12469;&#12452;&#12474;&#12398;&#35336;&#31639;&#26041;&#27861;&#12398;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
  </p><ul><li>&#12467;&#12531;&#12486;&#12490;&#12395; <code>left</code> &#21046;&#32004;&#12434;&#25351;&#23450;&#12373;&#12428;&#12383; 1 &#12388;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21547;&#12414;&#12428;&#12427;&#22580;&#21512;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#28204;&#23450;&#24133;&#12399;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#25512;&#22888;&#12373;&#12428;&#12427;&#24133;&#12395; <code>left</code> &#21046;&#32004;&#12398;&#20516;&#12434;&#21152;&#12360;&#12383;&#12418;&#12398;&#12392;&#31561;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#12467;&#12531;&#12486;&#12490;&#12395; <code>percentWidth</code> &#12434;&#25351;&#23450;&#12373;&#12428;&#12383; 1 &#12388;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21547;&#12414;&#12428;&#12427;&#22580;&#21512;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#28204;&#23450;&#24133;&#12399;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#25512;&#22888;&#12373;&#12428;&#12427;&#24133;&#12392;&#31561;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398; <code>percentWidth</code> &#12364;&#35336;&#31639;&#12395;&#30452;&#25509;&#21453;&#26144;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;<code>updateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12391;&#12399;&#32771;&#24942;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#12467;&#12531;&#12486;&#12490;&#12395; <code>baseline</code> &#21046;&#32004;&#12434;&#25351;&#23450;&#12373;&#12428;&#12383; 1 &#12388;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21547;&#12414;&#12428;&#12427;&#22580;&#21512;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#28204;&#23450;&#39640;&#12373;&#12399;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#25512;&#22888;&#12373;&#12428;&#12427;&#39640;&#12373;&#12395; <code>baseline</code> &#12434;&#21152;&#12360;&#12289;&#12381;&#12371;&#12363;&#12425;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398; <code>baselinePosition</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#24341;&#12356;&#12383;&#12418;&#12398;&#12392;&#31561;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</li>&#13;
                     <li>&#12467;&#12531;&#12486;&#12490;&#12395; <code>verticalCenter</code> &#21046;&#32004;&#12434;&#25351;&#23450;&#12373;&#12428;&#12383; 1 &#12388;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#21547;&#12414;&#12428;&#12427;&#22580;&#21512;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#28204;&#23450;&#39640;&#12373;&#12399;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#25512;&#22888;&#12373;&#12428;&#12427;&#39640;&#12373;&#12395;&#12289;<code>verticalCenter</code> &#21046;&#32004;&#12398;&#20516;&#12398; 2 &#20493;&#12434;&#21152;&#12360;&#12383;&#12418;&#12398;&#12392;&#31561;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</li>&#13;
                  </ul><p>&#13;
                  <code>updateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12391;&#12399;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12469;&#12452;&#12474;&#12399;&#12289;&#27425;&#12398;&#12523;&#12540;&#12523;&#65288;&#20778;&#20808;&#38918;&#12395;&#35352;&#36617;&#65289;&#12395;&#24467;&#12387;&#12390;&#27770;&#23450;&#12373;&#12428;&#12414;&#12377;&#65288;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;&#12392;&#26368;&#22823;&#12469;&#12452;&#12474;&#12399;&#12289;&#24517;&#12378;&#38918;&#23432;&#12373;&#12428;&#12414;&#12377;&#65289;&#12290;</p>&#13;
               <ul><li>&#12456;&#12524;&#12513;&#12531;&#12488;&#12395; <code>percentWidth</code> &#12414;&#12383;&#12399; <code>percentHeight</code> &#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398;&#12469;&#12452;&#12474;&#12399;&#12289;&#20351;&#29992;&#21487;&#33021;&#12394;&#12469;&#12452;&#12474;&#12398;&#21106;&#21512;&#12392;&#12375;&#12390;&#35336;&#31639;&#12373;&#12428;&#12414;&#12377;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#12469;&#12452;&#12474;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#12469;&#12452;&#12474;&#12363;&#12425; <code>left</code>&#12289;<code>right</code>&#12289;<code>top</code>&#12289;<code>bottom</code> &#12398;&#21508;&#21046;&#32004;&#12434;&#24341;&#12356;&#12383;&#20516;&#12391;&#12377;&#12290;</li>&#13;
                  <li>&#12456;&#12524;&#12513;&#12531;&#12488;&#12395; <code>left</code> &#12392; <code>right</code> &#12398;&#20001;&#26041;&#12398;&#21046;&#32004;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398;&#24133;&#12395;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#24133;&#12363;&#12425; left &#12392; right &#12398;&#21046;&#32004;&#12434;&#24341;&#12356;&#12383;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12456;&#12524;&#12513;&#12531;&#12488;&#12395; <code>top</code> &#12392; <code>bottom</code> &#12398;&#20001;&#26041;&#12398;&#21046;&#32004;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#12381;&#12398;&#39640;&#12373;&#12395;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#39640;&#12373;&#12363;&#12425; <code>top</code> &#12392; <code>bottom</code> &#12398;&#21046;&#32004;&#12434;&#24341;&#12356;&#12383;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;&#12399;&#12289;&#12381;&#12398;&#25512;&#22888;&#24133;&#12392;&#25512;&#22888;&#39640;&#12373;&#65288;&#12414;&#12383;&#12399;&#12381;&#12398;&#12356;&#12378;&#12428;&#12363;&#65289;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
               </ul><p>BasicLayout &#12463;&#12521;&#12473;&#12399;&#12289;&#26368;&#23567;&#12398;&#23376;&#12398;&#12469;&#12452;&#12474;&#12398;&#20013;&#12398;&#26368;&#22823;&#20516;&#12392;&#12375;&#12390;&#12289;&#26368;&#23567;&#12469;&#12452;&#12474;&#12434;&#35336;&#31639;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <ol><li>&#12467;&#12531;&#12486;&#12490;&#20869;&#12398;&#23376;&#12372;&#12392;&#12395;&#12289;&#23376;&#12434;&#32302;&#23567;&#12391;&#12365;&#12427;&#26368;&#23567;&#12469;&#12452;&#12474;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;&#13;
        <ul><li>&#23376;&#12364;&#35242;&#12398;&#24133;&#12414;&#12383;&#12399;&#39640;&#12373;&#12395;&#21046;&#38480;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#23376;&#12399;&#23376;&#12398;&#26368;&#23567;&#12398;&#24133;&#12414;&#12383;&#12399;&#39640;&#12373;&#12395;&#32302;&#23567;&#12391;&#12365;&#12414;&#12377;&#12290;&#23376;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                        <li>&#23376;&#12364;&#35242;&#12395;&#21046;&#38480;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#23376;&#12399;&#23376;&#12398;&#25512;&#22888;&#12469;&#12452;&#12474;&#12398;&#12414;&#12414;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#23376;&#12398;&#25512;&#22888;&#12469;&#12452;&#12474;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;  </li>&#13;
                     </ul></li>&#13;
                  <li>&#25163;&#38918; 1 &#12363;&#12425;&#12469;&#12452;&#12474;&#12398;&#26368;&#22823;&#20516;&#12434;&#35211;&#12388;&#12369;&#12414;&#12377;&#12290; </li>&#13;
               </ol><p>&#12381;&#12398;&#12383;&#12417;&#12289;&#23376;&#12364;&#35242;&#12395;&#21046;&#38480;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#23376;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;&#12364;&#12524;&#12452;&#12450;&#12454;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;&#12289;&#23376;&#12398;&#25512;&#22888;&#12469;&#12452;&#12474;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;&#12364;&#35336;&#31639;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#20301;&#32622;&#12399;&#12289;&#27425;&#12398;&#12523;&#12540;&#12523;&#65288;&#20778;&#20808;&#38918;&#12395;&#35352;&#36617;&#65289;&#12395;&#24467;&#12387;&#12390;&#27770;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
               <ul><li>&#13;
                     <code>horizontalCenter</code> &#12414;&#12383;&#12399; <code>verticalCenter</code> &#21046;&#32004;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#20013;&#24515;&#12392;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#20013;&#24515;&#12398;&#38291;&#12398;&#36317;&#38626;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12467;&#12531;&#12486;&#12490;&#20869;&#12391;&#27700;&#24179;&#26041;&#21521;&#12414;&#12383;&#12399;&#22402;&#30452;&#26041;&#21521;&#12398;&#20013;&#24515;&#12395;&#37197;&#32622;&#12377;&#12427;&#12395;&#12399;&#12289;<code>horizontalCenter</code> &#12414;&#12383;&#12399; <code>verticalCenter</code> &#21046;&#32004;&#12434;&#12476;&#12525;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12505;&#12540;&#12473;&#12521;&#12452;&#12531;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#12381;&#12398; <code>baselinePosition</code>&#65288;&#36890;&#24120;&#12399;&#12289;&#12486;&#12461;&#12473;&#12488;&#12398;&#20808;&#38957;&#34892;&#12398;&#12505;&#12540;&#12473;&#12521;&#12452;&#12531;&#65289;&#12364; <code>baseline</code> &#21046;&#32004;&#12395;&#25539;&#12360;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#22402;&#30452;&#26041;&#21521;&#12395;&#37197;&#32622;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12456;&#12524;&#12513;&#12531;&#12488;&#12398; <code>top</code> &#12414;&#12383;&#12399; <code>left</code> &#21046;&#32004;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#12381;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#22659;&#30028;&#12398;&#24038;&#19978;&#38533;&#12364;&#12467;&#12531;&#12486;&#12490;&#12398;&#24038;&#19978;&#38533;&#12363;&#12425;&#25351;&#23450;&#20516;&#12384;&#12369;&#12458;&#12501;&#12475;&#12483;&#12488;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#37197;&#32622;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12456;&#12524;&#12513;&#12531;&#12488;&#12398; <code>bottom</code> &#12414;&#12383;&#12399; <code>right</code> &#21046;&#32004;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#12381;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#22659;&#30028;&#12398;&#21491;&#19979;&#38533;&#12364;&#12467;&#12531;&#12486;&#12490;&#12398;&#21491;&#19979;&#38533;&#12363;&#12425;&#25351;&#23450;&#20516;&#12384;&#12369;&#12458;&#12501;&#12475;&#12483;&#12488;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#37197;&#32622;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#21046;&#32004;&#12395;&#12424;&#12387;&#12390;&#27700;&#24179;&#12414;&#12383;&#12399;&#22402;&#30452;&#26041;&#21521;&#12398;&#20301;&#32622;&#12364;&#27770;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12289;&#33258;&#36523;&#12398; x &#12362;&#12424;&#12403; y &#24231;&#27161;&#12395;&#24467;&#12387;&#12390;&#37197;&#32622;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
               </ul><p>&#12467;&#12531;&#12486;&#12490;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#12469;&#12452;&#12474;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#21491;&#19979;&#38533;&#12398;&#24231;&#27161;&#12398;&#26368;&#22823;&#20516;&#12392;&#12375;&#12390;&#35336;&#31639;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
            <p></p><a name="mxmlSyntaxSummary" id="mxmlSyntaxSummary"></a><span class="classHeaderTableLabel">MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;</span><span id="showMxmlLink" style="display:none"><a href="#mxmlSyntaxSummary" onclick="toggleMXMLOnly();"><img src="../../images/collapsed.gif" title="collapsed" alt="collapsed" class="collapsedImage" />MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#34920;&#31034;</a><br /></span><span id="hideMxmlLink"><a href="#mxmlSyntaxSummary" onclick="toggleMXMLOnly();"><img src="../../images/expanded.gif" title="expanded" alt="expanded" class="expandedImage" />MXML &#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#38560;&#12377;</a></span><div id="mxmlSyntax" class="mxmlSyntax">&#13;
  <p>The <code>&lt;s:BasicLayout&gt;</code> tag inherits all of the tag &#13;
  attributes of its superclass and adds no additional tag attributes:</p>&#13;
 &#13;
  <pre>&#13;
  &lt;s:BasicLayout/&gt;&#13;
  </pre>&#13;
 &#13;
  </div><p id="moreExamples"><span class="classHeaderTableLabel">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WS2E766701-05C7-44de-9621-75722301B94E.html" target="_blank">Set the layout of a Spark container</a><br /><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WS817a894fd7827b2a-209375481211babd9df-8000.html" target="_blank">Set the padding and gap of a layout</a><br /><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WSefe892102f30ec48-478c4fbc121211d5cf5-8000.html" target="_blank">Set the alignment of a layout</a><br /><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WS514ED026-76E0-46a6-A7DB-8824E6EDF846.html" target="_blank">Set the row height or column width&#13;
of a layout</a></div><p id="learnMore"><span class="classHeaderTableLabel">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://help.adobe.com/en_US/Flex/4.6/UsingSDK/WS0141D24B-6AEB-4721-BA04-9BF15F86350F.html" target="_blank">About Spark layouts</a><br /></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProperty" id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#BasicLayout()" class="signatureLink">BasicLayout</a>()</div><div class="summaryTableDescription">&#13;
      &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">BasicLayout</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="protectedMethodSummary" id="protectedMethodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12503;&#12525;&#12486;&#12463;&#12488;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedProtectedMethod" id="summaryTableProtectedMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10##AIR::1.5##" product="Flex::4##"><a name="//apple_ref/cpp/Constructor/BasicLayout()" class="dashAnchor" id="//apple_ref/cpp/Constructor/BasicLayout()"></a><a name="BasicLayout()" id="BasicLayout()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>BasicLayout</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function BasicLayout()</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 4</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5</td></tr></table><p></p><p>&#13;
      &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12377;&#12290;&#13;
      &#13;
      </p></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>