<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:9" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:1.1" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:9" /><meta name="product" content="air" /><meta name="productver" content="air:1.1" /><meta name="product" content="flex" /><meta name="prodver" content="flex:3" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="ILayoutManager,mx.managers.ILayoutManager,usePhasedInstantiation,invalidateDisplayList,invalidateProperties,invalidateSize,isInvalid,validateClient,validateNow" /><title>ILayoutManager - Adobe ActionScript&#174; 3&#65288;AS3  Flex&#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">mx.managers</a></td></tr><tr><td class="classHeaderTableLabel">&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;</td><td class="classSignature">public  interface  ILayoutManager extends  <a href="../../flash/events/IEventDispatcher.html">IEventDispatcher</a> </td></tr><tr><td class="classHeaderTableLabel">&#23455;&#35013;&#32773;</td><td> <a href="../../mx/managers/LayoutManager.html">LayoutManager</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 9, AIR 1.1</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
  LayoutManager &#12399;&#12289;Flex &#12398;&#28204;&#23450;&#12362;&#12424;&#12403;&#12524;&#12452;&#12450;&#12454;&#12488;&#25163;&#38918;&#12398;&#32972;&#24460;&#12395;&#12354;&#12427;&#12456;&#12531;&#12472;&#12531;&#12391;&#12377;&#12290; &#12524;&#12452;&#12450;&#12454;&#12488;&#12399;&#12289;&#20966;&#29702;&#12289;&#28204;&#23450;&#12289;&#12362;&#12424;&#12403;&#12524;&#12452;&#12450;&#12454;&#12488;&#12398; 3 &#27573;&#38542;&#12391;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
  <p>&#21508;&#27573;&#38542;&#12399;&#12381;&#12428;&#12382;&#12428;&#29420;&#31435;&#12375;&#12390;&#12362;&#12426;&#12289;1 &#12388;&#12398;&#27573;&#38542;&#12398; UIComponent &#12364;&#12377;&#12409;&#12390;&#20966;&#29702;&#12373;&#12428;&#12390;&#12363;&#12425;&#12289;&#27425;&#12398;&#27573;&#38542;&#12395;&#36914;&#12415;&#12414;&#12377;&#12290; &#12354;&#12427;&#27573;&#38542;&#12398; UIComponent &#12434;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#12289;UIComponent &#12434;&#20182;&#12398;&#27573;&#38542;&#12391;&#20877;&#20966;&#29702;&#12377;&#12427;&#35201;&#27714;&#12364;&#30330;&#29983;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#12424;&#12358;&#12394;&#35201;&#27714;&#12399;&#12461;&#12517;&#12540;&#12395;&#26684;&#32013;&#12373;&#12428;&#12289;&#20877;&#20966;&#29702;&#12364;&#24517;&#35201;&#12394;&#27573;&#38542;&#12364;&#27425;&#22238;&#23455;&#34892;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#20966;&#29702;</b>&#27573;&#38542;&#12399; <code>validateProperties()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#65288;&#12493;&#12473;&#12488;&#12524;&#12505;&#12523;&#12398;&#36870;&#38918;&#12391;&#20006;&#12409;&#26367;&#12360;&#12383;&#65289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12522;&#12473;&#12488;&#12391;&#12289;&#21508;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <a href="../core/UIComponent.html#validateProperties()"> &#13;
                     <code>validateProperties()</code>&#13;
                  </a> &#12513;&#12477;&#12483;&#12489;&#12434;&#38918;&#30058;&#12395;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12522;&#12473;&#12488;&#12395;&#12354;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12493;&#12473;&#12488;&#12524;&#12505;&#12523;&#12364;<b>&#26368;&#12418;&#27973;&#12356;</b>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12493;&#12473;&#12488;&#12398;&#38918;&#30058;&#12392;&#12399;&#36870;&#12398;&#38918;&#30058;&#12391;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#12488;&#12483;&#12503;&#12480;&#12454;&#12531;&#38918;&#12289;&#12414;&#12383;&#12399;&#27491;&#38918;&#12392;&#12418;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12398;&#27573;&#38542;&#12391;&#12399;&#12289;&#28204;&#23450;&#27573;&#38542;&#12362;&#12424;&#12403;&#12524;&#12452;&#12450;&#12454;&#12488;&#27573;&#38542;&#12395;&#20837;&#12427;&#21069;&#12395;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35373;&#23450;&#12395;&#20381;&#23384;&#12377;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#25345;&#12388;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#27083;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#35373;&#23450;&#12513;&#12477;&#12483;&#12489;&#12391;&#12399;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#35251;&#28857;&#12363;&#12425;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12395;&#26356;&#26032;&#12377;&#12427;&#20966;&#29702;&#12398;&#19968;&#37096;&#12434;&#23455;&#34892;&#12375;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#20195;&#12431;&#12426;&#12395;&#12289;<code>invalidateProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12371;&#12398;&#27573;&#38542;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12414;&#12391;&#20966;&#29702;&#12434;&#24310;&#26399;&#12375;&#12414;&#12377;&#12290; &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#20309;&#22238;&#12418;&#35373;&#23450;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#12289;&#19981;&#35201;&#12394;&#20316;&#26989;&#12398;&#30330;&#29983;&#12434;&#38450;&#27490;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#28204;&#23450;</b>&#27573;&#38542;&#12399; <code>validateSize()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#65288;&#12493;&#12473;&#12488;&#12524;&#12505;&#12523;&#12391;&#20006;&#12409;&#26367;&#12360;&#12383;&#65289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12522;&#12473;&#12488;&#12391;&#12289;&#21508;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <a href="../core/UIComponent.html#validateSize()">&#13;
                     <code>validateSize()</code>&#13;
                  </a> &#12513;&#12477;&#12483;&#12489;&#12434;&#38918;&#30058;&#12395;&#21628;&#12403;&#20986;&#12375;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12363;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <a href="../core/UIComponent.html#invalidateSize()"> &#13;
                     <code>invalidateSize()</code>&#13;
                  </a> &#12513;&#12477;&#12483;&#12489;&#12364;&#20197;&#21069;&#12395;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;<code>validateSize()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; <code>validateSize()</code> &#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#32080;&#26524;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12414;&#12383;&#12399;&#20301;&#32622;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <a href="../core/UIComponent.html#invalidateDisplayList()"> &#13;
                     <code>invalidateDisplayList()</code>&#13;
                  </a> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#20966;&#29702;&#24453;&#12385;&#12398;&#12461;&#12517;&#12540;&#12395;&#36861;&#21152;&#12373;&#12428;&#12289;&#27425;&#22238;&#12524;&#12452;&#12450;&#12454;&#12488;&#27573;&#38542;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290; &#12373;&#12425;&#12395;&#12289;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35242;&#12399;&#12289;<a href="../core/UIComponent.html#invalidateSize()"> &#13;
                     <code>invalidateSize()</code>&#13;
                  </a> &#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12387;&#12390;&#28204;&#23450;&#27573;&#38542;&#12395;&#12289;<a href="../core/UIComponent.html#invalidateDisplayList()"> &#13;
                     <code>invalidateDisplayList()</code>&#13;
                  </a> &#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12387;&#12390;&#12524;&#12452;&#12450;&#12454;&#12488;&#27573;&#38542;&#12398;&#20001;&#26041;&#12395;&#12510;&#12540;&#12463;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12522;&#12473;&#12488;&#20869;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12493;&#12473;&#12488;&#12524;&#12505;&#12523;&#12364;<b>&#26368;&#12418;&#28145;&#12356;</b>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12493;&#12473;&#12488;&#12398;&#38918;&#30058;&#12395;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#12508;&#12488;&#12512;&#12450;&#12483;&#12503;&#38918;&#12289;&#12414;&#12383;&#12399;&#36870;&#38918;&#12392;&#12418;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>&#12524;&#12452;&#12450;&#12454;&#12488;</b>&#27573;&#38542;&#12399; <code>validateDisplayList()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#65288;&#12493;&#12473;&#12488;&#12524;&#12505;&#12523;&#12398;&#36870;&#38918;&#12391;&#20006;&#12409;&#26367;&#12360;&#12383;&#65289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12522;&#12473;&#12488;&#12391;&#12289;&#21508;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <a href="../core/UIComponent.html#validateDisplayList()"> &#13;
                     <code>validateDisplayList()</code>&#13;
                  </a> &#12513;&#12477;&#12483;&#12489;&#12434;&#38918;&#30058;&#12395;&#21628;&#12403;&#20986;&#12375;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12289;&#12381;&#12371;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#65288;&#12388;&#12414;&#12426;&#12289;&#23376;&#65289;&#12398;&#12469;&#12452;&#12474;&#12392;&#20301;&#32622;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12434;&#35201;&#27714;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <a href="../core/UIComponent.html#invalidateDisplayList()"> &#13;
                     <code>invalidateDisplayList()</code>&#13;
                  </a> &#12513;&#12477;&#12483;&#12489;&#12364;&#20197;&#21069;&#12395;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390; <code>validateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12522;&#12473;&#12488;&#12395;&#12354;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12493;&#12473;&#12488;&#12524;&#12505;&#12523;&#12364;<b>&#26368;&#12418;&#27973;&#12356;</b>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12493;&#12473;&#12488;&#12398;&#38918;&#30058;&#12392;&#12399;&#36870;&#12398;&#38918;&#30058;&#12391;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#12488;&#12483;&#12503;&#12480;&#12454;&#12531;&#38918;&#12289;&#12414;&#12383;&#12399;&#27491;&#38918;&#12392;&#12418;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#36890;&#24120;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399; <code>validateProperties()</code>&#12289;<code>validateSize()</code>&#12289;<code>validateDisplayList()</code> &#12398;&#21508;&#12513;&#12477;&#12483;&#12489;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12379;&#12435;&#12290; UIComponents &#12398;&#22580;&#21512;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364; <code>commitProperties()</code>&#12289;<code>measure()</code> &#12414;&#12383;&#12399; <code>updateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12381;&#12428;&#12382;&#12428;&#12289;<code>validateProperties()</code>&#12289;<code>validateSize()</code>&#12289;<code>validateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#12424;&#12387;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36215;&#21205;&#26178;&#12395;&#12289;LayoutManager &#12398;&#21336;&#19968;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;<code>UIComponent.layoutManager</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290; &#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12289;&#12371;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; UIComponent &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#38745;&#30340; <code>LayoutManager.getInstance()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390; LayoutManager &#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
  &#13;
            <p></p><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#usePhasedInstantiation" class="signatureLink">usePhasedInstantiation</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
	  LayoutManager &#12391;&#27573;&#38542;&#12392;&#27573;&#38542;&#12398;&#38291;&#12391;&#12398;&#30011;&#38754;&#26356;&#26032;&#12364;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">ILayoutManager</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#invalidateDisplayList()" class="signatureLink">invalidateDisplayList</a>(obj:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	  &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#22793;&#26356;&#12373;&#12428;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#12420;&#12499;&#12472;&#12517;&#12450;&#12523;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22793;&#26356;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12395;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">ILayoutManager</td></tr><tr class="" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#invalidateProperties()" class="signatureLink">invalidateProperties</a>(obj:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	  validateProperties() &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12398;&#12434;&#24453;&#27231;&#12375;&#12390;&#12356;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12522;&#12473;&#12488;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">ILayoutManager</td></tr><tr class="" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#invalidateSize()" class="signatureLink">invalidateSize</a>(obj:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	  validateSize() &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12398;&#12434;&#24453;&#27231;&#12375;&#12390;&#12356;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12522;&#12473;&#12488;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">ILayoutManager</td></tr><tr class="" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#isInvalid()" class="signatureLink">isInvalid</a>():<a href="../../Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
	  &#26908;&#35388;&#12364;&#24517;&#35201;&#12394;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399; true &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#26908;&#35388;&#12364;&#23436;&#20102;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399; false &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">ILayoutManager</td></tr><tr class="" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#validateClient()" class="signatureLink">validateClient</a>(target:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>, skipDisplayList:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	  &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12418;&#12289;&#19968;&#33324;&#30340;&#12395;&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12381;&#12398;&#22793;&#26356;&#12434;&#12377;&#12368;&#12395;&#36969;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</div></td><td class="summaryTableOwnerCol">ILayoutManager</td></tr><tr class="" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#validateNow()" class="signatureLink">validateNow</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	  &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12418;&#12289;&#19968;&#33324;&#30340;&#12395;&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12381;&#12398;&#22793;&#26356;&#12434;&#12377;&#12368;&#12395;&#36969;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</div></td><td class="summaryTableOwnerCol">ILayoutManager</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/usePhasedInstantiation" class="dashAnchor" id="//apple_ref/cpp/Property/usePhasedInstantiation"></a><a name="usePhasedInstantiation" id="usePhasedInstantiation"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>usePhasedInstantiation</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>usePhasedInstantiation:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 9, AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
	  LayoutManager &#12391;&#27573;&#38542;&#12392;&#27573;&#38542;&#12398;&#38291;&#12391;&#12398;&#30011;&#38754;&#26356;&#26032;&#12364;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12501;&#12521;&#12464;&#12391;&#12377;&#12290; <code>true</code> &#12398;&#22580;&#21512;&#12289;&#28204;&#23450;&#12362;&#12424;&#12403;&#12524;&#12452;&#12450;&#12454;&#12488;&#12398;&#27573;&#38542;&#12372;&#12392;&#12395;&#30011;&#38754;&#26356;&#26032;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12377;&#12409;&#12390;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#26908;&#35388;&#12373;&#12428;&#12427;&#12414;&#12391;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398; <code>validateProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12362;&#12424;&#12403; <code>commitProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#26908;&#35388;&#12364;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;&#30011;&#38754;&#12364;&#26356;&#26032;&#12373;&#12428;&#12414;&#12377;&#12290;  &#13;
	 &#13;
	  </p><p>&#27425;&#12395;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#28204;&#23450;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398; <code>validateSize()</code> &#12513;&#12477;&#12483;&#12489;&#12362;&#12424;&#12403; <code>measure()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#28204;&#23450;&#12364;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;&#30011;&#38754;&#12364;&#20877;&#12403;&#26356;&#26032;&#12373;&#12428;&#12414;&#12377;&#12290;  </p>&#13;
	 &#13;
	  <p>&#26368;&#24460;&#12395;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#26908;&#35388;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398; <code>validateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12362;&#12424;&#12403; <code>updateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#26908;&#35388;&#12364;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;&#30011;&#38754;&#12364;&#20877;&#12403;&#26356;&#26032;&#12373;&#12428;&#12414;&#12377;&#12290; 1 &#12388;&#12398;&#27573;&#38542;&#12398;&#26908;&#35388;&#12391;&#12289;&#21069;&#12398;&#27573;&#38542;&#12364;&#28961;&#21177;&#21270;&#12373;&#12428;&#12427;&#12392;&#12289;LayoutManager &#12364;&#22987;&#12417;&#12363;&#12425;&#12420;&#12426;&#30452;&#12375;&#12414;&#12377;&#12290; &#22810;&#25968;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#20316;&#25104;&#12375;&#12390;&#21021;&#26399;&#21270;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#12424;&#12426;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290; &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12364;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	  <p><code>false</code> &#12398;&#22580;&#21512;&#12289;3 &#12388;&#12398;&#27573;&#38542;&#12377;&#12409;&#12390;&#12364;&#23436;&#20102;&#12375;&#12390;&#12363;&#12425;&#30011;&#38754;&#12364;&#26356;&#26032;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
	  &#13;
	  <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get usePhasedInstantiation():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set usePhasedInstantiation(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/invalidateDisplayList()" class="dashAnchor" id="//apple_ref/cpp/Method/invalidateDisplayList()"></a><a name="invalidateDisplayList()" id="invalidateDisplayList()"></a><a name="invalidateDisplayList(mx.managers.ILayoutManagerClient)" id="invalidateDisplayList(mx.managers.ILayoutManagerClient)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>invalidateDisplayList</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function invalidateDisplayList(obj:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 9, AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
	  &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#22793;&#26356;&#12373;&#12428;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#12420;&#12499;&#12472;&#12517;&#12450;&#12523;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22793;&#26356;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12395;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#22580;&#21512;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12469;&#12452;&#12474;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12356;&#12394;&#12367;&#12390;&#12418;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12434;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;&#26032;&#12375;&#12356;&#23376;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#36861;&#21152;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12473;&#12479;&#12452;&#12523;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35242;&#12395;&#12424;&#12387;&#12390;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#26032;&#12375;&#12356;&#12469;&#12452;&#12474;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12394;&#12393;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
	 &#13;
	  </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">obj</span>:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a></code> &#8212; &#22793;&#26356;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
	  &#13;
	  </td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/invalidateProperties()" class="dashAnchor" id="//apple_ref/cpp/Method/invalidateProperties()"></a><a name="invalidateProperties()" id="invalidateProperties()"></a><a name="invalidateProperties(mx.managers.ILayoutManagerClient)" id="invalidateProperties(mx.managers.ILayoutManagerClient)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>invalidateProperties</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function invalidateProperties(obj:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 9, AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
	  <code>validateProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12398;&#12434;&#24453;&#27231;&#12375;&#12390;&#12356;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12522;&#12473;&#12488;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#36890;&#24120;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#35373;&#23450;&#12513;&#12477;&#12483;&#12489;&#12391;&#12399;&#12289;&#26032;&#35215;&#12398;&#20516;&#12434;&#19968;&#26178;&#22793;&#25968;&#12395;&#26684;&#32013;&#12375;&#12289;<code>invalidateProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#24460;&#12391;&#12371;&#12398;&#26032;&#35215;&#12398;&#20516;&#12364;&#23455;&#38555;&#12395;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12420;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#23376;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395; <code>validateProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12362;&#12424;&#12403; <code>commitProperties()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#25163;&#38918;&#12398;&#21033;&#28857;&#12399;&#12289;&#35079;&#25968;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#19968;&#24230;&#12395;&#22793;&#26356;&#12375;&#12390;&#12289;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#30456;&#20114;&#12395;&#12420;&#12426;&#21462;&#12426;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12426;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#29305;&#23450;&#12398;&#38918;&#24207;&#12391;&#36969;&#29992;&#12377;&#12427;&#65288;&#24517;&#35201;&#12364;&#12354;&#12427;&#65289;&#12392;&#12365;&#12395;&#12467;&#12540;&#12489;&#12434;&#32368;&#12426;&#36820;&#12375;&#12383;&#12426;&#12391;&#12365;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290; &#12371;&#12398;&#25163;&#38918;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#26368;&#12418;&#21177;&#29575;&#30340;&#12395;&#26032;&#35215;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
	 &#13;
	  </p><p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">obj</span>:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a></code> &#8212; &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290;&#13;
	  &#13;
	  </td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/invalidateSize()" class="dashAnchor" id="//apple_ref/cpp/Method/invalidateSize()"></a><a name="invalidateSize()" id="invalidateSize()"></a><a name="invalidateSize(mx.managers.ILayoutManagerClient)" id="invalidateSize(mx.managers.ILayoutManagerClient)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>invalidateSize</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function invalidateSize(obj:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 9, AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
	  <code>validateSize()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12398;&#12434;&#24453;&#27231;&#12375;&#12390;&#12356;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12522;&#12473;&#12488;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12364;&#22793;&#21270;&#12375;&#12383;&#12392;&#12365;&#12395;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 &#13;
	  </p><p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12399;&#12289;&#27425;&#12398; 2 &#12388;&#12398;&#29702;&#30001;&#12395;&#12424;&#12426;&#22793;&#21270;&#12377;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	  <ol><li>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20869;&#23481;&#12364;&#22793;&#21270;&#12375;&#12383;&#22580;&#21512;&#12290; &#20363;&#12360;&#12400;&#12289;&#12521;&#12505;&#12523;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392;&#12508;&#12479;&#12531;&#12398; <code>label</code> &#12364;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>minWidth</code>&#12289;<code>minHeight</code>&#12289;<code>explicitWidth</code>&#12289;<code>explicitHeight</code>&#12289;<code>maxWidth</code> &#12414;&#12383;&#12399; <code>maxHeight</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12356;&#12378;&#12428;&#12363;&#12364;&#12289;&#12473;&#12463;&#12522;&#12503;&#12488;&#12395;&#12424;&#12387;&#12390;&#26126;&#31034;&#30340;&#12395;&#22793;&#26356;&#12373;&#12428;&#12383;&#22580;&#21512;&#12290;</li></ol><p>&#21069;&#32773;&#12398;&#22580;&#21512;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23544;&#27861;&#12434;&#20877;&#35336;&#31639;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#24460;&#32773;&#12398;&#22580;&#21512;&#12399;&#12289;&#26032;&#12375;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12474;&#12364;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#23544;&#27861;&#12434;&#20877;&#35336;&#31639;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12383;&#12384;&#12375;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35242;&#12434;&#20877;&#28204;&#23450;&#12375;&#12390;&#20877;&#12524;&#12452;&#12450;&#12454;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	  <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">obj</span>:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a></code> &#8212; &#12469;&#12452;&#12474;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290;&#13;
	  &#13;
	  </td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/isInvalid()" class="dashAnchor" id="//apple_ref/cpp/Method/isInvalid()"></a><a name="isInvalid()" id="isInvalid()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>isInvalid</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function isInvalid():<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 9, AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
	  &#26908;&#35388;&#12364;&#24517;&#35201;&#12394;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399; <code>true</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#26908;&#35388;&#12364;&#23436;&#20102;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399; <code>false</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
          &#13;
         </p><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Boolean.html">Boolean</a></code> &#8212; &#26908;&#35388;&#12364;&#24517;&#35201;&#12394;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399; <code>true</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#26908;&#35388;&#12364;&#23436;&#20102;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399; <code>false</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#13;
	  &#13;
	  </td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/validateClient()" class="dashAnchor" id="//apple_ref/cpp/Method/validateClient()"></a><a name="validateClient()" id="validateClient()"></a><a name="validateClient(mx.managers.ILayoutManagerClient,Boolean)" id="validateClient(mx.managers.ILayoutManagerClient,Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>validateClient</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function validateClient(target:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a>, skipDisplayList:<a href="../../Boolean.html">Boolean</a> = false):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 9, AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
	  &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12418;&#12289;&#19968;&#33324;&#30340;&#12395;&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12381;&#12398;&#22793;&#26356;&#12434;&#12377;&#12368;&#12395;&#36969;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290; &#36890;&#24120;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399; LayoutManager &#12398;&#28961;&#21177;&#21270;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#24460;&#12391;&#36969;&#29992;&#12375;&#12414;&#12377;&#12290; &#35373;&#23450;&#12375;&#12383;&#23455;&#38555;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12377;&#12368;&#12395;&#35501;&#12415;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#20869;&#12398;&#20182;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12289;&#12354;&#12427;&#12356;&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#23376;&#12420;&#35242;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12418;&#12398;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#12371;&#12428;&#12425;&#12398;&#20182;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12377;&#12368;&#12395;&#12399;&#26356;&#26032;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;  &#13;
	 &#13;
	  </p><p>&#20516;&#12364;&#24517;&#12378;&#26356;&#26032;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;<code>validateClient()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12493;&#12473;&#12488;&#12524;&#12505;&#12523;&#12364;&#12479;&#12540;&#12466;&#12483;&#12488;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#20197;&#19978;&#12391;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12377;&#12409;&#12390;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#26356;&#26032;&#12375;&#12390;&#12363;&#12425;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#35336;&#31639;&#12398;&#36000;&#33655;&#12364;&#22823;&#12365;&#12356;&#12383;&#12417;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#24517;&#35201;&#12394;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
	 &#13;
	  <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">target</span>:<a href="../../mx/managers/ILayoutManagerClient.html">ILayoutManagerClient</a></code> &#8212; &#12371;&#12371;&#12395;&#28193;&#12373;&#12428;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12289;&#12393;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#26908;&#35388;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#21547;&#12414;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#23550;&#12375;&#12390;&#12289;<code>validateProperties()</code>&#12289;<code>commitProperties()</code>&#12289;<code>validateSize()</code>&#12289;<code>measure()</code>&#12289;<code>validateDisplayList()</code> &#12362;&#12424;&#12403; <code>updateDisplayList()</code> &#12398;&#21508;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
	 &#13;
	 </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">skipDisplayList</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>false</code>)<code></code> &#8212; <code>true</code> &#12398;&#22580;&#21512;&#12289;<code>validateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12362;&#12424;&#12403; <code>updateDisplayList()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12379;&#12435;&#12290;&#13;
	  &#13;
	  </td></tr></table></div></span><span id="pageFilter" runtime="Flash::9##AIR::1.1##" product="Flex::3##"><a name="//apple_ref/cpp/Method/validateNow()" class="dashAnchor" id="//apple_ref/cpp/Method/validateNow()"></a><a name="validateNow()" id="validateNow()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>validateNow</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function validateNow():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flex 3</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 9, AIR 1.1</td></tr></table><p></p><p></p><p>&#13;
	  &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12390;&#12418;&#12289;&#19968;&#33324;&#30340;&#12395;&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12381;&#12398;&#22793;&#26356;&#12434;&#12377;&#12368;&#12395;&#36969;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290; &#36890;&#24120;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399; LayoutManager &#12398;&#28961;&#21177;&#21270;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#24460;&#12391;&#36969;&#29992;&#12375;&#12414;&#12377;&#12290; &#35373;&#23450;&#12375;&#12383;&#23455;&#38555;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12377;&#12368;&#12395;&#35501;&#12415;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#20869;&#12398;&#20182;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12289;&#12354;&#12427;&#12356;&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#23376;&#12420;&#35242;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12418;&#12398;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#12371;&#12428;&#12425;&#12398;&#20182;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12377;&#12368;&#12395;&#12399;&#26356;&#26032;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#20516;&#12364;&#24517;&#12378;&#26356;&#26032;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;<code>validateNow()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12377;&#12409;&#12390;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#26356;&#26032;&#12375;&#12390;&#12363;&#12425;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#35336;&#31639;&#12398;&#36000;&#33655;&#12364;&#22823;&#12365;&#12356;&#12383;&#12417;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#24517;&#35201;&#12394;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
	  &#13;
	  </p></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>