<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:10.1" /><meta name="runtime" content="air" /><meta name="runtimever" content="air:2" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:10.1" /><meta name="product" content="air" /><meta name="productver" content="air:2" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="Collator,flash.globalization.Collator,actualLocaleIDName,ignoreCase,ignoreCharacterWidth,ignoreDiacritics,ignoreKanaType,ignoreSymbols,lastOperationStatus,numericComparison,requestedLocaleIDName,compare,equals,getAvailableLocaleIDNames" /><title>Collator - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.globalization</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public final   class  Collator</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">Collator  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
     Collator &#12463;&#12521;&#12473;&#12399;&#12289;&#12525;&#12465;&#12540;&#12523;&#12395;&#20381;&#23384;&#12375;&#12383;&#25991;&#23383;&#21015;&#12398;&#27604;&#36611;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290; &#13;
     &#13;
     <p>&#12371;&#12398;&#12463;&#12521;&#12473;&#12399;&#12289;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12427;&#25991;&#23383;&#21015;&#27604;&#36611;&#12469;&#12540;&#12499;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; &#27604;&#36611;&#12399;&#12289;&#12463;&#12521;&#12473;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20316;&#25104;&#26178;&#12395;&#25552;&#20379;&#12373;&#12428;&#12427;&#12525;&#12465;&#12540;&#12523; ID &#12395;&#22522;&#12389;&#12356;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;ActionScript &#12399; Unicode &#25991;&#23383;&#12475;&#12483;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#25991;&#23383;&#21015;&#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;&#12502;&#12540;&#12523;&#20516;&#12398;&#25991;&#23383;&#21015;&#27604;&#36611;&#28436;&#31639;&#23376;&#65288;==&#12289; !=&#12289;&lt;&#12289;&lt;=&#12289;&gt;&#12289;&gt;=&#65289;&#12399;&#12289;&#27604;&#36611;&#12395; Unicode &#12467;&#12540;&#12489;&#12509;&#12452;&#12531;&#12488;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12289;&#32080;&#26524;&#12398;&#12477;&#12540;&#12488;&#38918;&#12399;&#29305;&#23450;&#12398;&#35328;&#35486;&#12420;&#12525;&#12465;&#12540;&#12523;&#12398;&#35215;&#21063;&#12392;&#19968;&#33268;&#12375;&#12394;&#12356;&#12398;&#12391;&#12289;&#12518;&#12540;&#12470;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#25991;&#23383;&#21015;&#12398;&#12477;&#12540;&#12488;&#12395;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#19968;&#26041;&#12391;&#12289;&#12371;&#12398;&#12463;&#12521;&#12473;&#12398; comparison &#12513;&#12477;&#12483;&#12489;&#12364;&#12371;&#12428;&#12425;&#12398;&#35215;&#21063;&#12395;&#24467;&#12358;&#38918;&#24207;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
               <p>&#35328;&#35486;&#12395;&#12424;&#12387;&#12390;&#12477;&#12540;&#12488;&#38918;&#12364;&#30064;&#12394;&#12427;&#20363;&#12434;&#27425;&#12395;&#12356;&#12367;&#12388;&#12363;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
               <ul><li> &#33521;&#35486;&#12391;&#12399;&#22823;&#25991;&#23383;&#12398; A &#12398;&#21069;&#12395;&#23567;&#25991;&#23383;&#12398; a&#12289;&#23567;&#25991;&#23383;&#12398; b &#12398;&#21069;&#12395;&#22823;&#25991;&#23383;&#12398; A &#12398;&#38918;&#12395;&#20006;&#12403;&#12414;&#12377;&#12290;</li>&#13;
                  <li> &#12473;&#12454;&#12455;&#12540;&#12487;&#12531;&#35486;&#12391;&#12399; &#246; &#12399; z &#12398;&#24460;&#12391;&#12377;&#12364;&#12289;&#12489;&#12452;&#12484;&#35486;&#12391;&#12399; &#246; &#12399; o &#12398;&#24460;&#12391;&#12377;&#12290;</li>&#13;
                  <li> &#12473;&#12506;&#12452;&#12531;&#35486;&#65288;&#12488;&#12521;&#12487;&#12451;&#12471;&#12519;&#12490;&#12523;&#65289;&#12391;&#12399;&#12289;ch &#12399; 1 &#25991;&#23383;&#12392;&#12375;&#12390;&#12289;c &#12392; d &#12398;&#38291;&#12395;&#12477;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;</li>&#13;
               </ul><p>&#13;
     &#12477;&#12540;&#12488;&#38918;&#12399;&#12289;&#21516;&#12376;&#35328;&#35486;&#12362;&#12424;&#12403;&#12525;&#12465;&#12540;&#12523;&#20869;&#12391;&#12418;&#20351;&#12356;&#26041;&#12395;&#12424;&#12387;&#12390;&#22793;&#12431;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12489;&#12452;&#12484;&#35486;&#12391;&#12399;&#12289;&#38651;&#35441;&#24115;&#12398;&#21517;&#21069;&#12398;&#12477;&#12540;&#12488;&#38918;&#12392;&#36766;&#26360;&#12398;&#21336;&#35486;&#12398;&#12477;&#12540;&#12488;&#38918;&#12399;&#36949;&#12356;&#12414;&#12377;&#12290;&#28450;&#23383;&#65288;&#26085;&#26412;&#35486;&#12392;&#20013;&#22269;&#35486;&#12391;&#20351;&#29992;&#65289;&#12395;&#12399;&#12289;&#30330;&#38899;&#12420;&#37096;&#39318;&#12362;&#12424;&#12403;&#30011;&#25968;&#12395;&#12424;&#12427;&#12477;&#12540;&#12488;&#12394;&#12393;&#12289;&#27096;&#12293;&#12394;&#12477;&#12540;&#12488;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12473;&#12506;&#12452;&#12531;&#35486;&#12392;&#12464;&#12523;&#12472;&#12450;&#35486;&#12391;&#12399;&#12289;&#12514;&#12480;&#12531;&#12477;&#12540;&#12488;&#12392;&#12488;&#12521;&#12487;&#12451;&#12471;&#12519;&#12490;&#12523;&#12477;&#12540;&#12488;&#12398;&#36949;&#12356;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
               <p>&#13;
     &#12371;&#12398;&#12463;&#12521;&#12473;&#12398;&#27604;&#36611;&#12513;&#12477;&#12483;&#12489;&#12395;&#12399;&#12289;&#20027;&#12395; 2 &#12388;&#12398;&#20351;&#29992;&#12514;&#12540;&#12489;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12399;&#12289;<code>Collator()</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398; <code>initialMode</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#12424;&#12387;&#12390;&#21046;&#24481;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12300;&#12477;&#12540;&#12488;&#12301;&#12514;&#12540;&#12489;&#12399;&#12289;&#12456;&#12531;&#12489;&#12518;&#12540;&#12470;&#12540;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#38917;&#30446;&#12434;&#12477;&#12540;&#12488;&#12377;&#12427;&#12383;&#12417;&#12398;&#12514;&#12540;&#12489;&#12391;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#12424;&#12426;&#21427;&#23494;&#12394;&#27604;&#36611;&#12434;&#34892;&#12356;&#12289;&#20182;&#12398;&#28857;&#12391;&#12399;&#21516;&#12376;&#38917;&#30446;&#12364;&#19968;&#36011;&#12375;&#12383;&#22522;&#28310;&#12391;&#12477;&#12540;&#12488;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12399;&#21516;&#12376;&#12418;&#12398;&#12392;&#12399;&#35211;&#12394;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12300;&#29031;&#21512;&#12301;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#27604;&#36611;&#22522;&#28310;&#12399;&#12418;&#12387;&#12392;&#12422;&#12427;&#12420;&#12363;&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12399;&#21516;&#12376;&#12418;&#12398;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425; 2 &#12388;&#12398;&#12514;&#12540;&#12489;&#12434;&#31034;&#12377;&#20363;&#12434;&#27425;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
               <div class="listing" version="3.0"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre> &#13;
     var sortingCollator:Collator = new Collator("en-US", CollatorMode.SORTING);&#13;
     var words:Array = new  Array("Airplane" , "airplane", "boat", "Boat");&#13;
     words.sort(sortingCollator.compare);&#13;
     trace(words);&#13;
              &#13;
     var matchingCollator:Collator = new Collator("en-US", CollatorMode.MATCHING);&#13;
     if (matchingCollator.equals("Car", "car")) {&#13;
       trace("The words match!");&#13;
     }&#13;
     </pre></div>&#13;
               <p>&#13;
     &#19978;&#35352;&#12398;&#12424;&#12358;&#12395;&#12525;&#12465;&#12540;&#12523; ID &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12395;&#25552;&#20379;&#12375;&#12383;&#22580;&#21512;&#12391;&#12418;&#12289;&#29031;&#21512;&#21205;&#20316;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#35373;&#23450;&#12420;&#12289;&#35201;&#27714;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12365;&#12395;&#20195;&#26367;&#12398;&#12525;&#12465;&#12540;&#12523;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12424;&#12387;&#12390;&#12289;&#12518;&#12540;&#12470;&#12540;&#12372;&#12392;&#12395;&#30064;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     </p>&#13;
     &#13;
            <p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#actualLocaleIDName" class="signatureLink">actualLocaleIDName</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
         &#12371;&#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#23455;&#38555;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#12398;&#21517;&#21069;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#ignoreCase" class="signatureLink">ignoreCase</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#21516;&#19968;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12362;&#12424;&#12403;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12398;&#21306;&#21029;&#12384;&#12369;&#12364;&#36949;&#12358;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364;&#12289;&#31561;&#12375;&#12356;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#12375;&#12390;&#35413;&#20385;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#ignoreCharacterWidth" class="signatureLink">ignoreCharacterWidth</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#19968;&#37096;&#12398;&#20013;&#22269;&#35486;&#12362;&#12424;&#12403;&#26085;&#26412;&#35486;&#12398;&#25991;&#23383;&#12398;&#20840;&#35282;&#12392;&#21322;&#35282;&#12398;&#24418;&#12364;&#12289;&#31561;&#12375;&#12356;&#24418;&#12392;&#12375;&#12390;&#35413;&#20385;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#ignoreDiacritics" class="signatureLink">ignoreDiacritics</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#22522;&#26412;&#25991;&#23383;&#12364;&#21516;&#12376;&#12391;&#12354;&#12428;&#12400;&#12289;&#12450;&#12463;&#12475;&#12531;&#12488;&#12420;&#12381;&#12398;&#20182;&#12398;&#35672;&#21029;&#35352;&#21495;&#12398;&#36949;&#12356;&#12364;&#12354;&#12387;&#12390;&#12418;&#12289;&#21516;&#12376;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#35413;&#20385;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#ignoreKanaType" class="signatureLink">ignoreKanaType</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12459;&#12490;&#25991;&#23383;&#12398;&#31278;&#39006;&#12398;&#12415;&#12364;&#30064;&#12394;&#12427;&#25991;&#23383;&#21015;&#12399;&#12289;&#31561;&#12375;&#12356;&#25991;&#23383;&#21015;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#ignoreSymbols" class="signatureLink">ignoreSymbols</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12473;&#12506;&#12540;&#12473;&#12289;&#36890;&#36008;&#35352;&#21495;&#12289;&#25968;&#23398;&#35352;&#21495;&#12362;&#12424;&#12403;&#12381;&#12398;&#20182;&#12398;&#31278;&#39006;&#12398;&#35352;&#21495;&#12394;&#12393;&#12398;&#35352;&#21495;&#25991;&#23383;&#12399;&#12477;&#12540;&#12488;&#26178;&#12414;&#12383;&#12399;&#29031;&#21512;&#26178;&#12395;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#lastOperationStatus" class="signatureLink">lastOperationStatus</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
         &#12371;&#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#23455;&#34892;&#12375;&#12383;&#26368;&#26032;&#12398;&#25805;&#20316;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#numericComparison" class="signatureLink">numericComparison</a> : <a href="../../Boolean.html">Boolean</a><div class="summaryTableDescription">&#13;
         &#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22475;&#12417;&#36796;&#12414;&#12428;&#12383;&#25968;&#20516;&#12398;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#27604;&#36611;&#26178;&#12398;&#21462;&#25201;&#26041;&#27861;&#12434;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#requestedLocaleIDName" class="signatureLink">requestedLocaleIDName</a> : <a href="../../String.html">String</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
         &#12371;&#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12395;&#28193;&#12373;&#12428;&#12383;&#12289;&#35201;&#27714;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523; ID &#12398;&#21517;&#21069;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#Collator()" class="signatureLink">Collator</a>(requestedLocaleIDName:<a href="../../String.html">String</a>, initialMode:<a href="../../String.html">String</a> = "sorting")</div><div class="summaryTableDescription">&#13;
         &#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523;&#12398;&#35215;&#21063;&#12395;&#24467;&#12387;&#12383;&#25991;&#23383;&#21015;&#12398;&#27604;&#36611;&#12434;&#34892;&#12358;&#12383;&#12417;&#12395;&#12289;&#26032;&#12375;&#12356; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27083;&#31689;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#compare()" class="signatureLink">compare</a>(string1:<a href="../../String.html">String</a>, string2:<a href="../../String.html">String</a>):<a href="../../int.html">int</a></div><div class="summaryTableDescription"> &#13;
         2 &#12388;&#12398;&#25991;&#23383;&#21015;&#12434;&#27604;&#36611;&#12375;&#12390;&#12289;1 &#30058;&#30446;&#12398;&#25991;&#23383;&#21015;&#12364; 2 &#30058;&#30446;&#12398;&#25991;&#23383;&#21015;&#12392;&#27604;&#12409;&#12390;&#23567;&#12373;&#12356;&#12363;&#12289;&#31561;&#12375;&#12356;&#12363;&#12289;&#22823;&#12365;&#12356;&#12363;&#12434;&#31034;&#12377;&#25972;&#25968;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#equals()" class="signatureLink">equals</a>(string1:<a href="../../String.html">String</a>, string2:<a href="../../String.html">String</a>):<a href="../../Boolean.html">Boolean</a></div><div class="summaryTableDescription">&#13;
         2 &#12388;&#12398;&#25991;&#23383;&#21015;&#12434;&#27604;&#36611;&#12375;&#12390;&#12289;&#25991;&#23383;&#21015;&#12364;&#31561;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12502;&#12540;&#12523;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#getAvailableLocaleIDNames()" class="signatureLink">getAvailableLocaleIDNames</a>():<a href="../../Vector.html">Vector</a>.&lt;<a href="../../String.html">String</a>&gt;</div><div class="summaryTableDescription">[&#38745;&#30340;] &#13;
         &#12371;&#12398;&#12463;&#12521;&#12473;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#21517;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Collator</td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/actualLocaleIDName" class="dashAnchor" id="//apple_ref/cpp/Property/actualLocaleIDName"></a><a name="actualLocaleIDName" id="actualLocaleIDName"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>actualLocaleIDName</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>actualLocaleIDName:<a href="../../String.html">String</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#23455;&#38555;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#12398;&#21517;&#21069;&#12290;&#13;
         &#13;
         </p><p>&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12362;&#12424;&#12403; <code>Collator()</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12395;&#28193;&#12373;&#12428;&#12427; <code>requestedLocaleIDName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12395;&#24540;&#12376;&#12390;&#12289;&#12371;&#12398;&#21517;&#21069;&#12398;&#20516;&#12395;&#12399; 3 &#12388;&#12398;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
         <ol><li>&#35201;&#27714;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523;&#12364; <code>LocaleID.DEFAULT</code> &#12391;&#12399;&#12394;&#12367;&#12289;&#35201;&#27714;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523;&#12434;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12364;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#22580;&#21512;&#12289;&#36820;&#12373;&#12428;&#12427;&#21517;&#21069;&#12399; <code>requestedLocaleIDName</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;&#13;
                 </li><li><code>LocaleID.DEFAULT</code> &#12364;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12395;&#23550;&#12377;&#12427; <code>requestedLocaleIDName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#29694;&#22312;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#21517;&#21069;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;<code>LocaleID.DEFAULT</code> &#20516;&#12395;&#12424;&#12426;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12375;&#12383;&#35373;&#23450;&#12364; OS &#12395;&#20445;&#25345;&#12373;&#12428;&#12414;&#12377;&#12290;<code>requestedLocaleIDName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390;&#26126;&#31034;&#30340;&#12394;&#20516;&#12434;&#28193;&#12375;&#12383;&#22580;&#21512;&#12395;&#12289;2 &#12388;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#21517;&#12364;&#21516;&#12376;&#12391;&#12418; <code>LocaleID.DEFAULT</code> &#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12392;&#21516;&#12376;&#32080;&#26524;&#12395;&#12394;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;&#12518;&#12540;&#12470;&#12540;&#12364;&#12510;&#12471;&#12531;&#12398;&#12525;&#12465;&#12540;&#12523;&#35373;&#23450;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12375;&#12289;<code>LocaleID.DEFAULT</code> &#12434;&#20351;&#29992;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#26126;&#31034;&#30340;&#12394;&#12525;&#12465;&#12540;&#12523; ID &#21517;&#12434;&#35201;&#27714;&#12375;&#12383;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12381;&#12428;&#12425;&#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12373;&#12428;&#12383;&#35373;&#23450;&#12434;&#21462;&#24471;&#12375;&#12394;&#12356;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#13;
                 </li><li>&#12471;&#12473;&#12486;&#12512;&#12364;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383; <code>requestedLocaleIDName</code> &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#20195;&#26367;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#21517;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
                 </li></ol><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get actualLocaleIDName():<a href="../../String.html">String</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocaleID.html" target="">LocaleID</a><br /><a href="Collator.html#requestedLocaleIDName" target="">requestedLocaleIDName</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/ignoreCase" class="dashAnchor" id="//apple_ref/cpp/Property/ignoreCase"></a><a name="ignoreCase" id="ignoreCase"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>ignoreCase</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>ignoreCase:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#21516;&#19968;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12362;&#12424;&#12403;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12398;&#21306;&#21029;&#12384;&#12369;&#12364;&#36949;&#12358;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364;&#12289;&#31561;&#12375;&#12356;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#12375;&#12390;&#35413;&#20385;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>ignoreCase</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>compare("ABC", "abc")</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; <code>true</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;  &#13;
         </p><p>&#13;
         &#25991;&#23383;&#21015;&#12398;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12398;&#22793;&#25563;&#12399;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523;&#12398;&#12523;&#12540;&#12523;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290; &#13;
         </p><p>&#13;
         <code>ignoreCase</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; false &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12398;&#25991;&#23383;&#12399;&#20114;&#12356;&#12395;&#31561;&#12375;&#12367;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#13;
         </p><p>&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#20516;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12289;&#12456;&#12521;&#12540;&#12420;&#35686;&#21578;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li> <code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#13;
         &#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;LastOperationStatus &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p><code>Collator()</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398; <code>initialMode</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; <code>Collator.MATCHING</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12427;&#12392;&#12365;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; <code>true</code> &#12391;&#12377;&#12290;<code>Collator()</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398; <code>initialMode</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; <code>Collator.SORTING</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12427;&#12392;&#12365;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; <code>false</code> &#12391;&#12377;&#12290;</p>&#13;
         &#13;
         <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get ignoreCase():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set ignoreCase(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="Collator.html#compare()" target="">compare()</a><br /><a href="Collator.html#equals()" target="">equals()</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/ignoreCharacterWidth" class="dashAnchor" id="//apple_ref/cpp/Property/ignoreCharacterWidth"></a><a name="ignoreCharacterWidth" id="ignoreCharacterWidth"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>ignoreCharacterWidth</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>ignoreCharacterWidth:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#19968;&#37096;&#12398;&#20013;&#22269;&#35486;&#12362;&#12424;&#12403;&#26085;&#26412;&#35486;&#12398;&#25991;&#23383;&#12398;&#20840;&#35282;&#12392;&#21322;&#35282;&#12398;&#24418;&#12364;&#12289;&#31561;&#12375;&#12356;&#24418;&#12392;&#12375;&#12390;&#35413;&#20385;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
         &#13;
         </p><p>&#20013;&#22269;&#35486;&#12392;&#26085;&#26412;&#35486;&#12398;&#25991;&#23383;&#12475;&#12483;&#12488;&#12398;&#26082;&#23384;&#12398;&#27161;&#28310;&#12392;&#12398;&#20114;&#25563;&#24615;&#12434;&#20445;&#12388;&#12383;&#12417;&#12395;&#12289;Unicode &#12391;&#12399;&#12289;&#19968;&#37096;&#12398;&#25991;&#23383;&#12398;&#20840;&#35282;&#12392;&#21322;&#35282;&#12398;&#20001;&#26041;&#12395;&#23550;&#24540;&#12377;&#12427;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>ignoreCharacterWidth</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>compare("&#65313;&#65393;", "A&#12450;")</code> &#12399; <code>true</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
         <p>&#13;
         <code>ignoreCharacterWidth</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>false</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#20840;&#35282;&#25991;&#23383;&#12392;&#21322;&#35282;&#25991;&#23383;&#12399;&#12381;&#12428;&#12382;&#12428;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290; &#13;
         </p>&#13;
         &#13;
         <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#20516;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12289;&#12456;&#12521;&#12540;&#12420;&#35686;&#21578;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li> <code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#13;
         &#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; LastOperationStatus &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>false&#12290;</code></p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get ignoreCharacterWidth():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set ignoreCharacterWidth(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="Collator.html#compare()" target="">compare()</a><br /><a href="Collator.html#equals()" target="">equals()</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/ignoreDiacritics" class="dashAnchor" id="//apple_ref/cpp/Property/ignoreDiacritics"></a><a name="ignoreDiacritics" id="ignoreDiacritics"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>ignoreDiacritics</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>ignoreDiacritics:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12391;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#22522;&#26412;&#25991;&#23383;&#12364;&#21516;&#12376;&#12391;&#12354;&#12428;&#12400;&#12289;&#12450;&#12463;&#12475;&#12531;&#12488;&#12420;&#12381;&#12398;&#20182;&#12398;&#35672;&#21029;&#35352;&#21495;&#12398;&#36949;&#12356;&#12364;&#12354;&#12387;&#12390;&#12418;&#12289;&#21516;&#12376;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#35413;&#20385;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>ignoreDiacritics</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>compare("cot&#233;", "c&#244;te")</code> &#12399; <code>true</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290; &#13;
         &#13;
         </p><p><code>ignoreDiacritics</code> &#12364; <code>false</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12450;&#12463;&#12475;&#12531;&#12488;&#12420;&#12381;&#12398;&#20182;&#12398;&#35672;&#21029;&#35352;&#21495;&#12398;&#36949;&#12356;&#12364;&#12354;&#12427;&#22522;&#26412;&#25991;&#23383;&#12399;&#21516;&#12376;&#12392;&#12399;&#35211;&#12394;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
         &#13;
         <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#20516;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12289;&#12456;&#12521;&#12540;&#12420;&#35686;&#21578;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li> <code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; LastOperationStatus &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>false&#12290;</code></p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get ignoreDiacritics():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set ignoreDiacritics(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="Collator.html#compare()" target="">compare()</a><br /><a href="Collator.html#equals()" target="">equals()</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/ignoreKanaType" class="dashAnchor" id="//apple_ref/cpp/Property/ignoreKanaType"></a><a name="ignoreKanaType" id="ignoreKanaType"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>ignoreKanaType</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>ignoreKanaType:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12459;&#12490;&#25991;&#23383;&#12398;&#31278;&#39006;&#12398;&#12415;&#12364;&#30064;&#12394;&#12427;&#25991;&#23383;&#21015;&#12399;&#12289;&#31561;&#12375;&#12356;&#25991;&#23383;&#21015;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code>ignoreKanaType</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>compare("&#12459;&#12490;", "&#12363;&#12394;")</code> &#12399; <code>true</code> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290; &#13;
         </p><p>&#13;
         <code>ignoreKanaType</code> &#12364; <code>false</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#21516;&#12376;&#38899;&#31680;&#12398;&#12402;&#12425;&#12364;&#12394;&#25991;&#23383;&#12392;&#12459;&#12479;&#12459;&#12490;&#25991;&#23383;&#12392;&#12399;&#21516;&#12376;&#12418;&#12398;&#12395;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#13;
         </p>&#13;
         &#13;
         <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#20516;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12289;&#12456;&#12521;&#12540;&#12420;&#35686;&#21578;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li> <code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; LastOperationStatus &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>false&#12290;</code></p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get ignoreKanaType():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set ignoreKanaType(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="Collator.html#compare()" target="">compare()</a><br /><a href="Collator.html#equals()" target="">equals()</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/ignoreSymbols" class="dashAnchor" id="//apple_ref/cpp/Property/ignoreSymbols"></a><a name="ignoreSymbols" id="ignoreSymbols"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>ignoreSymbols</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>ignoreSymbols:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12473;&#12506;&#12540;&#12473;&#12289;&#36890;&#36008;&#35352;&#21495;&#12289;&#25968;&#23398;&#35352;&#21495;&#12362;&#12424;&#12403;&#12381;&#12398;&#20182;&#12398;&#31278;&#39006;&#12398;&#35352;&#21495;&#12394;&#12393;&#12398;&#35352;&#21495;&#25991;&#23383;&#12399;&#12477;&#12540;&#12488;&#26178;&#12414;&#12383;&#12399;&#29031;&#21512;&#26178;&#12395;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12300;OBrian&#12301;&#12289;&#12300;O'Brian&#12301;&#12362;&#12424;&#12403;&#12300;O Brian&#12301;&#12394;&#12393;&#12398;&#25991;&#23383;&#21015;&#12399;&#12289;<code>ignoreSymbols</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#21516;&#12376;&#25991;&#23383;&#21015;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290; &#13;
         </p><p>&#13;
         <code>ignoreSymbols</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; false &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#35352;&#21495;&#12399;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#27604;&#36611;&#12391;&#32771;&#24942;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
         </p>&#13;
         &#13;
         <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#20516;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12289;&#12456;&#12521;&#12540;&#12420;&#35686;&#21578;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li> <code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#13;
         &#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; LastOperationStatus &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>false&#12290;</code></p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get ignoreSymbols():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set ignoreSymbols(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="Collator.html#compare()" target="">compare()</a><br /><a href="Collator.html#equals()" target="">equals()</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/lastOperationStatus" class="dashAnchor" id="//apple_ref/cpp/Property/lastOperationStatus"></a><a name="lastOperationStatus" id="lastOperationStatus"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>lastOperationStatus</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>lastOperationStatus:<a href="../../String.html">String</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#23455;&#34892;&#12375;&#12383;&#26368;&#26032;&#12398;&#25805;&#20316;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12290;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12414;&#12383;&#12399;&#12371;&#12398;&#12463;&#12521;&#12473;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#12426;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#35373;&#23450;&#12373;&#12428;&#12383;&#12426;&#12377;&#12427;&#12392;&#12289;&#24517;&#12378; <code>lastOperationStatus</code> &#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#26377;&#21177;&#12394;&#20516;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#21508;&#12513;&#12477;&#12483;&#12489;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
         &#13;
         </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get lastOperationStatus():<a href="../../String.html">String</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/numericComparison" class="dashAnchor" id="//apple_ref/cpp/Property/numericComparison"></a><a name="numericComparison" id="numericComparison"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>numericComparison</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>numericComparison:<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12473;&#12488;&#12522;&#12531;&#12464;&#12395;&#22475;&#12417;&#36796;&#12414;&#12428;&#12383;&#25968;&#20516;&#12398;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#27604;&#36611;&#26178;&#12398;&#21462;&#25201;&#26041;&#27861;&#12434;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;&#13;
         &#13;
         </p><p><code>numericComparison</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>true</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;compare &#12513;&#12477;&#12483;&#12489;&#12399;&#12473;&#12488;&#12522;&#12531;&#12464;&#20013;&#12398;&#25968;&#23383;&#12434;&#27604;&#36611;&#29992;&#12398;&#25968;&#20516;&#12395;&#22793;&#25563;&#12375;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>false</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#27604;&#36611;&#12399;&#25968;&#23383;&#12434;&#25991;&#23383;&#12467;&#12540;&#12489;&#12392;&#12375;&#12390;&#25201;&#12356;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523;&#12398;&#25991;&#23383;&#12477;&#12540;&#12488;&#12398;&#12523;&#12540;&#12523;&#12395;&#24467;&#12387;&#12390;&#12477;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p>&#20363;&#12360;&#12400;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12525;&#12465;&#12540;&#12523; ID&#12300;en-US&#12301;&#12395;&#23550;&#12375;&#12390; true &#12398;&#22580;&#21512;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12300;version1&#12301;&#12289;&#12300;version10&#12301;&#12362;&#12424;&#12403;&#12300;version2&#12301;&#12399; version1 &lt; version2 &lt; version10 &#12398;&#38918;&#12391;&#12477;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12300;en-US&#12301;&#12395;&#23550;&#12375;&#12390; false &#12398;&#22580;&#21512;&#12289;&#21516;&#12376;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364; version1 &lt; version10 &lt; version2 &#12398;&#38918;&#12391;&#12477;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#20516;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12289;&#12456;&#12521;&#12540;&#12420;&#35686;&#21578;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li> <code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#13;
         &#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; LastOperationStatus &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p> &#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65306; <code>false&#12290;</code></p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get numericComparison():<a href="../../Boolean.html">Boolean</a></code><br /><code>&#160;&#160;&#160;&#160;public function set numericComparison(value:<a href="../../Boolean.html">Boolean</a>):<a href="../../specialTypes.html#void">void</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="Collator.html#compare()" target="">compare()</a><br /><a href="Collator.html#equals()" target="">equals()</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/requestedLocaleIDName" class="dashAnchor" id="//apple_ref/cpp/Property/requestedLocaleIDName"></a><a name="requestedLocaleIDName" id="requestedLocaleIDName"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>requestedLocaleIDName</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>requestedLocaleIDName:<a href="../../String.html">String</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12395;&#28193;&#12373;&#12428;&#12383;&#12289;&#35201;&#27714;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523; ID &#12398;&#21517;&#21069;&#12290;&#13;
         &#13;
         </p><p><code>LocaleID.DEFAULT</code> &#20516;&#12364;&#20351;&#29992;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#36820;&#12373;&#12428;&#12427;&#21517;&#21069;&#12399;&#12300;i-default&#12301;&#12391;&#12377;&#12290;&#20195;&#26367;&#12398;&#12525;&#12465;&#12540;&#12523;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#22580;&#21512;&#12289;&#23455;&#38555;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12525;&#12465;&#12540;&#12523;&#12399;&#35201;&#27714;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523;&#12392;&#30064;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;  &#23455;&#38555;&#12398;&#12525;&#12465;&#12540;&#12523;&#21517;&#12399; <code>actualLocaleIDName</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
         &#13;
         <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get requestedLocaleIDName():<a href="../../String.html">String</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LocaleID.html" target="">LocaleID</a><br /><a href="Collator.html#actualLocaleIDName" target="">actualLocaleIDName</a></div></div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="//apple_ref/cpp/Constructor/Collator()" class="dashAnchor" id="//apple_ref/cpp/Constructor/Collator()"></a><a name="Collator()" id="Collator()"></a><a name="Collator(String,String)" id="Collator(String,String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>Collator</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function Collator(requestedLocaleIDName:<a href="../../String.html">String</a>, initialMode:<a href="../../String.html">String</a> = "sorting")</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p>&#13;
         &#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523;&#12398;&#35215;&#21063;&#12395;&#24467;&#12387;&#12383;&#25991;&#23383;&#21015;&#12398;&#27604;&#36611;&#12434;&#34892;&#12358;&#12383;&#12417;&#12395;&#12289;&#26032;&#12375;&#12356; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27083;&#31689;&#12375;&#12414;&#12377;&#12290;&#13;
         </p><p>&#13;
         &#29694;&#22312;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12364; <code>requestedLocaleIDName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#28193;&#12373;&#12428;&#12427;&#12525;&#12465;&#12540;&#12523; ID &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#20195;&#26367;&#12398;&#12525;&#12465;&#12540;&#12523;&#12364;&#27770;&#12417;&#12425;&#12428;&#12414;&#12377;&#12290;&#20195;&#26367;&#12398;&#12525;&#12465;&#12540;&#12523;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12392;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#35373;&#23450;&#12373;&#12428;&#12289;&#20195;&#26367;&#12398;&#31278;&#39006;&#12364;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
         <p>&#13;
         <code>initialMode</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#35373;&#23450;&#12395;&#12399;&#12289;&#27726;&#29992;&#12398;&#27096;&#12293;&#12394;&#29031;&#21512;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12289;&#20197;&#19979;&#12398;&#20516;&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
         <ul><li><code>CollatorMode.SORTING</code>&#65306;&#12456;&#12531;&#12489;&#12518;&#12540;&#12470;&#12540;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12486;&#12461;&#12473;&#12488;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#12522;&#12473;&#12488;&#12434;&#12477;&#12540;&#12488;&#12377;&#12427;&#12394;&#12393;&#12398;&#27726;&#29992;&#12398;&#35328;&#35486;&#30340;&#12394;&#12477;&#12540;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12383;&#12417;&#12398;&#29031;&#21512;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#27604;&#36611;&#12434;&#34892;&#12358;&#12392;&#12365;&#12395;&#12289;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12398;&#36949;&#12356;&#12420;&#12450;&#12463;&#12475;&#12531;&#12488;&#20184;&#12365;&#25991;&#23383;&#12394;&#12393;&#12289;&#12525;&#12465;&#12540;&#12523;&#22266;&#26377;&#12398;&#36949;&#12356;&#12364;&#32771;&#24942;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>CollatorMode.MATCHING</code>&#65306;2 &#12388;&#12398;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364;&#31561;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#12398;&#21028;&#26029;&#12394;&#12393;&#12398;&#27726;&#29992;&#12398;&#29031;&#21512;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#27604;&#36611;&#12434;&#34892;&#12358;&#12392;&#12365;&#12395;&#12289;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12398;&#36949;&#12356;&#12289;&#12450;&#12463;&#12475;&#12531;&#12488;&#20184;&#12365;&#25991;&#23383;&#12394;&#12393;&#12364;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</li></ul><p>&#13;
         &#12525;&#12465;&#12540;&#12523; ID &#12300;en-US&#12301;&#65288;&#31859;&#22269;&#12398;&#33521;&#35486;&#65289;&#12391; <code>CollatorMode.SORTING</code> &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12375;&#12390;&#12289;Collator &#12434;&#20351;&#29992;&#12375;&#12390;&#20316;&#25104;&#12375;&#12383;&#12477;&#12540;&#12488;&#28168;&#12415;&#12398;&#12522;&#12473;&#12488;&#12398;&#20363;&#12434;&#27425;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
          <table class="innertable">Aa&#196;&#228;&#65313;&#65345;AEae&#198;&#230;Bb&#65314;&#65346;Cc&#231;&#65315;&#65347;</table><p>&#13;
         &#19978;&#12395;&#31034;&#12375;&#12383;&#12424;&#12358;&#12395;&#12289;&#12377;&#12409;&#12390;&#12398;&#25991;&#23383;&#12364;&#21029;&#12293;&#12398;&#20516;&#12434;&#25345;&#12388;&#12363;&#12398;&#12424;&#12358;&#12395;&#25201;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#35328;&#35486;&#38918;&#12395;&#12477;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#13;
         </p><p>&#13;
         &#12525;&#12465;&#12540;&#12523; ID &#12300;en-US&#12301;&#65288;&#31859;&#22269;&#12398;&#33521;&#35486;&#65289;&#12391; <code>CollatorMode.MATCHING</code> &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12375;&#12390;&#12289;Collator &#12434;&#20351;&#29992;&#12375;&#12390;&#20316;&#25104;&#12375;&#12383;&#12477;&#12540;&#12488;&#28168;&#12415;&#12398;&#12522;&#12473;&#12488;&#12398;&#20363;&#12434;&#27425;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
          <table class="innertable">A a &#196; &#228; &#65313; &#65345;AE ae &#198; &#230;B b &#65314; &#65346;C c &#231; &#65315; &#65347;</table><p>&#13;
         </p><p>&#13;
         &#19978;&#12395;&#31034;&#12375;&#12383;&#12424;&#12358;&#12395;&#12289;&#19968;&#37096;&#12398;&#25991;&#23383;&#12399;&#35328;&#35486;&#38918;&#12395;&#12477;&#12540;&#12488;&#12373;&#12428;&#12289;&#21516;&#12376;&#25991;&#23383;&#20516;&#12434;&#25345;&#12388;&#12418;&#12398;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; &#13;
         </p><p>&#13;
         &#12477;&#12540;&#12488;&#38918;&#12434;&#12373;&#12425;&#12395;&#24494;&#35519;&#25972;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;<code>Collator.ignoreCase</code> &#12420; <code>Collator.ignoreDiacritics</code> &#12394;&#12393;&#12398; collator &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
         </p><p>&#13;
         &#21442;&#32771;&#12398;&#12383;&#12417;&#12395;&#12289;&#12525;&#12465;&#12540;&#12523;&#12395;&#20381;&#23384;&#12375;&#12394;&#12356;&#27161;&#28310;&#12398; <code>Array.sort()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#34892;&#12387;&#12383;&#23550;&#24540;&#12377;&#12427;&#12477;&#12540;&#12488;&#12398;&#20363;&#12434;&#27425;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
          <table class="innertable">AAEBCaaebc&#196;&#198;&#228;&#230;&#231;&#65313;&#65314;&#65345;&#65346;</table><p>  &#13;
         &#19978;&#35352;&#12398;&#12392;&#12362;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#25991;&#23383;&#12364;&#21336;&#32020;&#12395; Unicode &#12398;&#25968;&#20516;&#38918;&#12395;&#12477;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#35328;&#35486;&#30340;&#12395;&#12399;&#12354;&#12414;&#12426;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#13;
         </p><p>  &#13;
         &#12518;&#12540;&#12470;&#12540;&#12398;&#29694;&#22312;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#29872;&#22659;&#35373;&#23450;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;<code>requestedLocaleIDName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#20516; <code>LocaleID.DEFAULT</code> &#12434;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12395;&#28193;&#12375;&#12414;&#12377;&#12290;&#13;
         </p><p>  &#13;
         &#12525;&#12465;&#12540;&#12523;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12477;&#12540;&#12488;&#38918;&#12398;&#12496;&#12522;&#12450;&#12531;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12489;&#12452;&#12484;&#35486;&#12391;&#12399;&#12289;&#38651;&#35441;&#24115;&#12392;&#36766;&#26360;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12477;&#12540;&#12488;&#38918;&#12364;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#20013;&#22269;&#35486;&#12391;&#12399;&#12289;&#21336;&#35486;&#12399;&#36890;&#24120;&#12289;&#25991;&#23383;&#12434;&#12404;&#12435;&#38899;&#12395;&#38899;&#35379;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;<code>requestedLocaleIDName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12395;&#28193;&#12373;&#12428;&#12427;&#25991;&#23383;&#21015;&#12395;&#12300;collation&#12301;&#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#27096;&#12293;&#12394;&#12477;&#12540;&#12488;&#38918;&#12434;&#36984;&#25246;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
         &#13;
         <div class="listing" version="3.0">&#12467;&#12500;&#12540;<pre>&#13;
         var germanPhonebook:LocaleID = new LocaleID("de-DE@collation=phonebook");&#13;
         var chinesePinyin:LocaleID = new LocaleID("zh-Hant@collation=pinyin");&#13;
         </pre></div>&#13;
         &#13;
         <p>&#13;
         &#29031;&#21512;&#25991;&#23383;&#21015;&#12398;&#26377;&#21177;&#12394;&#20516;&#12434;&#27425;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;&#24433;&#38911;&#12434;&#21463;&#12369;&#12427;&#35328;&#35486;&#12434;&#25324;&#24359;&#20869;&#12395;&#31034;&#12375;&#12390;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
         &#13;
         <table class="innertable">&#29031;&#21512;&#25991;&#23383;&#21015;&#35500;&#26126;<code>standard</code>&#21508;&#35328;&#35486;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#38918;&#24207;&#12290; <code>phonebook</code>&#38651;&#35441;&#24115;&#12473;&#12479;&#12452;&#12523;&#12398;&#38918;&#24207;&#65288;&#12489;&#12452;&#12484;&#35486;&#12391;&#20351;&#29992;&#65289;&#12290;<code>pinyin</code>&#12521;&#12486;&#12531;&#25991;&#23383;&#12362;&#12424;&#12403; CJK &#25991;&#23383;&#29992;&#12398;&#12404;&#12435;&#38899;&#38918;&#65288;&#25991;&#23383;&#21336;&#20301;&#12391;&#12398;&#12404;&#12435;&#38899;&#12408;&#12398;&#38899;&#35379;&#12395;&#22522;&#12389;&#12367; CJK &#25991;&#23383;&#12398;&#38918;&#24207;&#65289;&#12290;&#65288;&#20013;&#22269;&#35486;&#12391;&#20351;&#29992;&#65289;<code>traditional</code>&#12488;&#12521;&#12487;&#12451;&#12471;&#12519;&#12490;&#12523;&#12473;&#12479;&#12452;&#12523;&#12398;&#12477;&#12540;&#12488;&#29992;&#65288;&#12473;&#12506;&#12452;&#12531;&#35486;&#12391;&#20351;&#29992;&#65289; <code>stroke</code>&#12521;&#12486;&#12531;&#25991;&#23383;&#12398;&#12404;&#12435;&#38899;&#38918;&#12289;CJK &#25991;&#23383;&#12398;&#30011;&#25968;&#38918;&#65288;&#20013;&#22269;&#35486;&#12391;&#20351;&#29992;&#65289;<code>direct</code>&#65288;&#12498;&#12531;&#12487;&#12451;&#12540;&#35486;&#12391;&#20351;&#29992;&#65289; <code>big5han</code>&#12521;&#12486;&#12531;&#25991;&#23383;&#12398;&#12404;&#12435;&#38899;&#38918;&#12289;CJK &#25991;&#23383;&#12398; big5 &#25991;&#23383;&#12475;&#12483;&#12488;&#38918;&#12290;&#65288;&#20013;&#22269;&#35486;&#12391;&#20351;&#29992;&#65289; <code>gb2312han</code> &#12521;&#12486;&#12531;&#25991;&#23383;&#12398;&#12404;&#12435;&#38899;&#38918;&#12289;CJK &#25991;&#23383;&#12398; gb2312han &#25991;&#23383;&#12475;&#12483;&#12488;&#38918;&#12290; &#65288;&#20013;&#22269;&#35486;&#12391;&#20351;&#29992;&#65289; <code>unihan</code>&#12521;&#12486;&#12531;&#25991;&#23383;&#12398;&#12404;&#12435;&#38899;&#38918;&#12289;CJK &#25991;&#23383;&#12398; Unihan &#37096;&#39318;&#38918;&#12290; &#65288;&#20013;&#22269;&#35486;&#12391;&#20351;&#29992;&#65289; </table><p>&#13;
         &#35201;&#27714;&#12373;&#12428;&#12383;&#29031;&#21512;&#12479;&#12452;&#12503;&#12364;&#12507;&#12473;&#12488;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#20195;&#26367;&#12398;&#29031;&#21512;&#12479;&#12452;&#12503;&#12364;&#20351;&#29992;&#12373;&#12428;&#12289;&#20195;&#26367;&#12364;&#36984;&#25246;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#31034;&#12377;&#12424;&#12358;&#12395; <code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#27425;&#12398;&#20363;&#12395;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289;<code>actualLocaleIDName</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20195;&#26367;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12383;&#20516;&#12434;&#29305;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
         </p>&#13;
         <div class="listing" version="3.0">&#12467;&#12500;&#12540;<pre>&#13;
         var collator:Collator = new Collator("fr-FR");&#13;
         if (collator.lastOperationStatus == LastOperationStatus.USING_FALLBACK_WARNING)&#13;
         {&#13;
           trace ("Using fallback locale: " + collator.actualLocaleIDName);&#13;
         }&#13;
         </pre></div>&#13;
               &#13;
         <p>&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12364;&#27491;&#12375;&#12367;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li> <code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#35201;&#27714;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523; ID &#12434;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#20197;&#19979;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         <ul><li><code>LastOperationStatus.USING_FALLBACK_WARNING</code></li><li><code>LastOperationStatus.USING_DEFAULT_WARNING</code></li></ul><p>&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; LastOperationStatus &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>  &#13;
         &#13;
         <p>&#19978;&#35352;&#12398;&#35686;&#21578;&#12362;&#12424;&#12403; <code>lastOperationStatus</code> &#12398;&#26377;&#21177;&#12394;&#20516;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;<code>LastOperationStatus</code> &#12463;&#12521;&#12473;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
         &#13;
         <span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">requestedLocaleIDName</span>:<a href="../../String.html">String</a></code> &#8212; &#12371;&#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427; <code>String</code>&#12290;&#13;
         </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">initialMode</span>:<a href="../../String.html">String</a></code> (default = "<code>sorting</code>")<code></code> &#8212; &#21021;&#26399;&#29031;&#21512;&#12514;&#12540;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#12473;&#12488;&#12522;&#12531;&#12464;&#20516;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; <code>CollatorMode.SORTING</code> &#12391;&#12377;&#12290; &#21033;&#29992;&#21487;&#33021;&#12394;&#12514;&#12540;&#12489;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;CollatorMode &#12463;&#12521;&#12473;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
         &#13;
         </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; <code>requestedLocaleIDName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; <code>null</code> &#12398;&#22580;&#21512;&#12290;&#13;
         </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; <code>requestedLocaleIDName</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28961;&#21177;&#12394;&#20516;&#12364;&#21547;&#12414;&#12428;&#12427;&#22580;&#21512;&#12290;        &#13;
         &#13;
         </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="CollatorMode.html" target="">CollatorMode</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a><br /><a href="LocaleID.html" target="">LocaleID</a><br /><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="Collator.html#requestedLocaleIDName" target="">requestedLocaleIDName</a><br /><a href="Collator.html#actualLocaleIDName" target="">actualLocaleIDName</a></div></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="//apple_ref/cpp/Method/compare()" class="dashAnchor" id="//apple_ref/cpp/Method/compare()"></a><a name="compare()" id="compare()"></a><a name="compare(String,String)" id="compare(String,String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>compare</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function compare(string1:<a href="../../String.html">String</a>, string2:<a href="../../String.html">String</a>):<a href="../../int.html">int</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p> &#13;
         2 &#12388;&#12398;&#25991;&#23383;&#21015;&#12434;&#27604;&#36611;&#12375;&#12390;&#12289;1 &#30058;&#30446;&#12398;&#25991;&#23383;&#21015;&#12364; 2 &#30058;&#30446;&#12398;&#25991;&#23383;&#21015;&#12392;&#27604;&#12409;&#12390;&#23567;&#12373;&#12356;&#12363;&#12289;&#31561;&#12375;&#12356;&#12363;&#12289;&#22823;&#12365;&#12356;&#12363;&#12434;&#31034;&#12377;&#25972;&#25968;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#27604;&#36611;&#12391;&#12399;&#12289;<code>Collator()</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523; ID &#12398;&#12477;&#12540;&#12488;&#38918;&#12523;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; &#13;
         &#13;
         </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#27491;&#12375;&#12367;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li><code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; <code>LastOperationStatus</code> &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">string1</span>:<a href="../../String.html">String</a></code> &#8212; &#26368;&#21021;&#12398;&#27604;&#36611;&#12473;&#12488;&#12522;&#12531;&#12464;&#12290;&#13;
         </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">string2</span>:<a href="../../String.html">String</a></code> &#8212; 2 &#30058;&#30446;&#12398;&#27604;&#36611;&#12473;&#12488;&#12522;&#12531;&#12464;&#12290;&#13;
         </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../int.html">int</a></code> &#8212; 1 &#30058;&#30446;&#12398;&#25991;&#23383;&#21015;&#12364; 2 &#30058;&#30446;&#12398;&#25991;&#23383;&#21015;&#12392;&#27604;&#12409;&#12390;&#23567;&#12373;&#12356;&#12363;&#12289;&#31561;&#12375;&#12356;&#12363;&#12289;&#22823;&#12365;&#12356;&#12363;&#12434;&#31034;&#12377;&#25972;&#25968;&#20516;&#12290;&#13;
                 <ul><li>&#25147;&#12426;&#20516;&#12364;&#36000;&#12398;&#22580;&#21512;&#12289;<code>string1</code> &#12399; <code>string2</code> &#12424;&#12426;&#12418;&#23567;&#12373;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</li><li>&#25147;&#12426;&#20516;&#12364; 0 &#12398;&#22580;&#21512;&#12289;<code>string1</code> &#12399; <code>string2</code> &#12392;&#31561;&#12375;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290; </li><li>&#25147;&#12426;&#20516;&#12364;&#27491;&#12398;&#22580;&#21512;&#12289;<code>string1</code> &#12399; <code>string2</code> &#12424;&#12426;&#12418;&#22823;&#12365;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290; </li></ul></td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; &#35201;&#27714;&#12373;&#12428;&#12383;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; null &#12398;&#22580;&#21512;&#12290;&#13;
         </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28961;&#21177;&#12394;&#20516;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12290;&#13;
         &#13;
         </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Collator.html#equals()" target="">equals()</a><br /><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="//apple_ref/cpp/Method/equals()" class="dashAnchor" id="//apple_ref/cpp/Method/equals()"></a><a name="equals()" id="equals()"></a><a name="equals(String,String)" id="equals(String,String)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>equals</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function equals(string1:<a href="../../String.html">String</a>, string2:<a href="../../String.html">String</a>):<a href="../../Boolean.html">Boolean</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         2 &#12388;&#12398;&#25991;&#23383;&#21015;&#12434;&#27604;&#36611;&#12375;&#12390;&#12289;&#25991;&#23383;&#21015;&#12364;&#31561;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#31034;&#12377;&#12502;&#12540;&#12523;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#27604;&#36611;&#12391;&#12399;&#12289;<code>Collator()</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12465;&#12540;&#12523; ID &#12398;&#12477;&#12540;&#12488;&#38918;&#12523;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;  &#13;
         &#13;
         </p><p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12403;&#20986;&#12373;&#12428;&#12390;&#27491;&#12375;&#12367;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#27425;&#12398;&#12424;&#12358;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290; </p>&#13;
         <ul><li><code>LastOperationStatus.NO_ERROR</code> </li></ul><p>&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;<code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399; <code>LastOperationStatus</code> &#12463;&#12521;&#12473;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23450;&#25968;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">string1</span>:<a href="../../String.html">String</a></code> &#8212; &#26368;&#21021;&#12398;&#27604;&#36611;&#12473;&#12488;&#12522;&#12531;&#12464;&#12290;&#13;
         </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">string2</span>:<a href="../../String.html">String</a></code> &#8212; 2 &#30058;&#30446;&#12398;&#27604;&#36611;&#12473;&#12488;&#12522;&#12531;&#12464;&#12290;&#13;
         </td></tr></table><p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Boolean.html">Boolean</a></code> &#8212; &#25991;&#23383;&#21015;&#12364;&#31561;&#12375;&#12356;&#65288;<code>true</code>&#65289;&#12363;&#31561;&#12375;&#12367;&#12394;&#12356;&#65288;<code>false</code>&#65289;&#12363;&#12434;&#31034;&#12377;&#12502;&#12540;&#12523;&#20516;&#12290; &#13;
         &#13;
         </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../TypeError.html">TypeError</a> </code> &#8212; &#35201;&#27714;&#12373;&#12428;&#12383;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; null &#12398;&#22580;&#21512;&#12290;&#13;
         </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12395;&#28961;&#21177;&#12394;&#20516;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12290;&#13;
         &#13;
         </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Collator.html#compare()" target="">compare()</a><br /><a href="Collator.html#lastOperationStatus" target="">lastOperationStatus</a><br /><a href="LastOperationStatus.html" target="">LastOperationStatus</a></div></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="//apple_ref/cpp/Method/getAvailableLocaleIDNames()" class="dashAnchor" id="//apple_ref/cpp/Method/getAvailableLocaleIDNames()"></a><a name="getAvailableLocaleIDNames()" id="getAvailableLocaleIDNames()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>getAvailableLocaleIDNames</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public static function getAvailableLocaleIDNames():<a href="../../Vector.html">Vector</a>.&lt;<a href="../../String.html">String</a>&gt;</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
         &#12371;&#12398;&#12463;&#12521;&#12473;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#21517;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
          &#13;
         </p><p>&#12371;&#12398;&#12463;&#12521;&#12473;&#12364;&#29694;&#22312;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399; null &#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
         &#13;
         <p></p><span class="label">&#25147;&#12426;&#20516;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../Vector.html">Vector</a>.&lt;<a href="../../String.html">String</a>&gt;</code> &#8212; &#12371;&#12398;&#12463;&#12521;&#12473;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#21517;&#12434;&#21547;&#12416;&#25991;&#23383;&#21015;&#12398;&#12505;&#12463;&#12488;&#12523;&#12290;&#13;
         &#13;
         </td></tr></table></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">CollatorExample1.as</div><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12399;&#12289;&#12477;&#12540;&#12488;&#32080;&#26524;&#12364;&#12525;&#12465;&#12540;&#12523;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;&#27425;&#12398;&#25163;&#38918;&#12364;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 <ol><li>&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12465;&#12540;&#12523; ID&#65288;<code>LocaleID.DEFAULT</code>&#12391;&#25351;&#23450;&#65289;&#12394;&#12393;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#21517;&#12398;&#37197;&#21015;&#20869;&#12434;&#21453;&#24489;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;</li><li>"sorting" &#12514;&#12540;&#12489;&#65288;&#12487;&#12501;&#12457;&#12523;&#12488;&#65289;&#12434;&#20351;&#29992;&#12375;&#12390;&#21508;&#12525;&#12465;&#12540;&#12523; ID &#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; </li><li>&#35201;&#27714;&#12373;&#12428;&#12383;&#23455;&#38555;&#12398;&#12525;&#12465;&#12540;&#12523; ID &#21517;&#12362;&#12424;&#12403; <code>lastOperationStatus</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;&#20195;&#26367;&#12525;&#12465;&#12540;&#12523;&#12364;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12391;&#12365;&#12414;&#12377;&#12290;</li><li>&#21508; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12487;&#12540;&#12479;&#37197;&#21015;&#12434;&#12477;&#12540;&#12488;&#12375;&#12289;&#12477;&#12540;&#12488;&#32080;&#26524;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12477;&#12540;&#12488;&#32080;&#26524;&#12398;&#20006;&#12403;&#38918;&#12399;&#12525;&#12465;&#12540;&#12523;&#12372;&#12392;&#12395;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;</li></ol><div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
&#13;
package {&#13;
    import flash.globalization.Collator;&#13;
    import flash.globalization.LocaleID;&#13;
&#13;
    public class CollatorExample1&#13;
    {&#13;
        public var col:Collator;&#13;
        &#13;
        public function CollatorExample1():void&#13;
        {        &#13;
            var localeNames:Array = [LocaleID.DEFAULT,&#13;
                                     "de-DE", "sv-SE",&#13;
                                     "fr-FR", "lt-LT",&#13;
                                     "es-ES"];&#13;
            &#13;
            var testSortData:Array = [&#13;
                "y ", "i ", "k ", // Latvian&#13;
                "acxa ", "acha ", "adxa ", // es_traditional&#13;
                "n ", "&#246; ", "o ", "z ", "vu ", "wo ", // sw&#13;
                "d&#228;d ", "daed ", // de&#13;
                "&#246;f ", "of ", // de_dictionary&#13;
                "c&#244;te ", "cot&#233; " // fr&#13;
            ];&#13;
            &#13;
            for each (var localeName:String in localeNames) {&#13;
            &#13;
                col = new Collator(localeName);&#13;
                &#13;
                trace("LocaleID requested: " + col.requestedLocaleIDName &#13;
                       + "; actual: " + col.actualLocaleIDName);&#13;
                       &#13;
                trace("Last Operation Status: " + col.lastOperationStatus );&#13;
                &#13;
                var result:Array = testSortData.sort(col.compare);&#13;
                        &#13;
                trace ("sorted data: " + result); &#13;
            }&#13;
        }      &#13;
    }&#13;
}&#13;
</pre></div></div></span><span id="pageFilter"><div class="exampleHeader">CollatorExample2.as</div><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12399;&#12289;Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#25991;&#23383;&#21015;&#12398;&#27604;&#36611;&#21205;&#20316;&#12434;&#21046;&#24481;&#12377;&#12427;&#26041;&#27861;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;&#27425;&#12398;&#25163;&#38918;&#12364;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 <ol><li>"matching" &#12514;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12525;&#12465;&#12540;&#12523;&#12398; Collator &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; </li><li>&#12414;&#12383;&#12399;&#12289;<code>Collator.ignoreDiacritics</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code>false</code> &#12362;&#12424;&#12403; <code>true</code> &#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290; </li><li>&#35672;&#21029;&#35352;&#21495;&#12420;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12434;&#21547;&#12416;&#25991;&#23383;&#21015;&#12398;&#12475;&#12483;&#12488;&#12434;&#27604;&#36611;&#12375;&#12414;&#12377;&#12290; </li><li><code>Collator.ignoreDiacritics</code> &#12362;&#12424;&#12403; <code>Collator.ignoreCase</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12398;&#27604;&#36611;&#12398;&#22793;&#21270;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</li></ol><div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
&#13;
package {&#13;
    import flash.display.Sprite;&#13;
    import flash.globalization.Collator;&#13;
    import flash.globalization.CollatorMode;&#13;
    import flash.globalization.LocaleID;&#13;
    &#13;
    public class CollatorExample2 extends Sprite&#13;
    {&#13;
        public var col:Collator;&#13;
        public var testMatchData:Array = ["cote", "Cote", "c&#195;&#180;te", "cot&#195;&#169;"];&#13;
        public var wordToMatch:String = "Cote";&#13;
        &#13;
        public function CollatorExample2()&#13;
        {&#13;
            col = new Collator( LocaleID.DEFAULT, CollatorMode.MATCHING );&#13;
&#13;
            trace("LocaleID requested: " + col.requestedLocaleIDName &#13;
                    + "; actual: " + col.actualLocaleIDName);&#13;
                    &#13;
            trace("Last Operation Status: " + col.lastOperationStatus );&#13;
&#13;
            trace('\n' + "ignoreCase = " + col.ignoreCase);&#13;
            trace("ignoreDiacritics = " + col.ignoreDiacritics);&#13;
&#13;
            compareString(testMatchData, wordToMatch) // All variations of the word cote match&#13;
&#13;
            col.ignoreDiacritics = false;&#13;
            trace('\n' + "ignoreDiacritics = false");&#13;
&#13;
            compareString(testMatchData, wordToMatch) // Variations with different diacritics will not match&#13;
&#13;
            col.ignoreCase = false;&#13;
            trace('\n' + "ignoreCase = false");&#13;
&#13;
            compareString(testMatchData, wordToMatch) // Variations with different case will not match&#13;
        }&#13;
    &#13;
        private function compareString(stringArray:Array, keyword:String):void&#13;
        {&#13;
            for each(var s:String in stringArray)&#13;
            {&#13;
                if(col.equals(s, keyword))    &#13;
                {&#13;
                    trace(keyword + " = " + s);&#13;
                }&#13;
            }&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>