<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8" /><meta http-equiv="X-UA-Compatible" content="IE=9" /><meta name="book" content="Adobe&#174; Flash&#174; Platform &#29992; ActionScript&#174; 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;" /><meta name="lang" content="ja-jp" /><meta name="runtime" content="flash player" /><meta name="runtimever" content="flash player:9" /><meta name="runtime" content="lite" /><meta name="runtimever" content="lite:4" /><meta name="product" content="flash player" /><meta name="productver" content="flash player:9" /><meta name="product" content="lite" /><meta name="productver" content="lite:4" /><link rel="stylesheet" href="../../style.css" type="text/css" media="screen" /><link rel="stylesheet" href="../../print.css" type="text/css" media="print" /><link rel="stylesheet" href="../../override.css" type="text/css" /><link rel="stylesheet" href="../../asfilter.css" type="text/css" /><link rel="stylesheet" href="../../ion.css" type="text/css" /><meta name="keywords" content="Loader,flash.display.Loader,content,contentLoaderInfo,uncaughtErrorEvents,close,load,loadBytes,loadFilePromise,unload,unloadAndStop" /><title>Loader - Adobe ActionScript&#174; 3&#65288;AS3  &#65289;API &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;</title><link rel="stylesheet" href="../../filter-style.css" type="text/css" /><link href="http://community.adobe.com/help/badge/v3/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link href="http://community.adobe.com/help/badge/ionBadge.css" rel="stylesheet" type="text/css" media="screen" /><link rel="stylesheet" href="../../filter_new.css" type="text/css" /><!--oss:off--><!-- ********************************** --><!-- START: ForeSee survey code in: /ssi/globalheader.ssi --><!-- END: ForeSee survey code --><!-- ******************************** --></head><body>&#13;
		<a name="top" id="top"></a>&#13;
		&#13;
		<div class="maincontainer" id="maincontainer" style="display: block; top: 0px">&#13;
			 &#13;
			 &#13;
			<!--oss:on--><div class="mainright" id="content">&#13;
				<div class="content"><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><table class="classHeaderTable" cellpadding="0" cellspacing="0"><tr><td class="classHeaderTableLabel">&#12497;&#12483;&#12465;&#12540;&#12472;</td><td><a href="package-detail.html" onclick="javascript:loadClassListFrame('class-list.html')">flash.display</a></td></tr><tr><td class="classHeaderTableLabel">&#12463;&#12521;&#12473;</td><td class="classSignature">public  class  Loader</td></tr><tr><td class="classHeaderTableLabel">&#32153;&#25215;</td><td class="inheritanceList">Loader  <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/display/DisplayObjectContainer.html">DisplayObjectContainer</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/display/DisplayObject.html">DisplayObject</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a> <img src="../../images/inherit-arrow.gif" title="Inheritance" alt="Inheritance" class="inheritArrow" /><a href="../../Object.html">Object</a></td></tr><tr><td class="classHeaderTableLabel">&#12469;&#12502;&#12463;&#12521;&#12473;</td><td> <a href="../../mx/core/FlexLoader.html">FlexLoader</a></td></tr></table><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><div id="badgeAnchorSupport" class="ionBadgeWrapper"></div><p></p><p></p>&#13;
 Loader &#12463;&#12521;&#12473;&#12399;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12452;&#12513;&#12540;&#12472;&#65288;JPG&#12289;PNG&#12289;&#12414;&#12383;&#12399; GIF&#65289;&#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12416;&#12383;&#12417;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#35501;&#12415;&#36796;&#12415;&#12434;&#38283;&#22987;&#12377;&#12427;&#12395;&#12399; <code>load()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#12392;&#12375;&#12390;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>&#12486;&#12461;&#12473;&#12488;&#12414;&#12383;&#12399;&#12496;&#12452;&#12490;&#12522;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#36796;&#12416;&#12395;&#12399; URLLoader &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>Loader &#12463;&#12521;&#12473;&#12399;&#12289;&#32153;&#25215;&#12377;&#12427;&#27425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399; 1 &#12388;&#12398;&#23376;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12289;&#12388;&#12414;&#12426;&#12525;&#12540;&#12489;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#38480;&#12425;&#12428;&#12390;&#12356;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;&#27425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;<code>addChild()</code>&#12289;<code>addChildAt()</code>&#12289;<code>removeChild()</code>&#12289;<code>removeChildAt()</code>&#12289;&#12362;&#12424;&#12403; <code>setChildIndex()</code> &#12391;&#12377;&#12290;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#35242;&#12398; DisplayObjectContainer &#23376;&#37197;&#21015;&#12363;&#12425; <i>Loader</i> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; </p>&#13;
 &#13;
               <p>&#13;
                  <b>iOS &#12398;&#22580;&#21512;&#12398;&#27880;&#24847;&#28857;</b>&#13;
               </p>&#13;
               <p>iOS &#12391;&#12398; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12363;&#12425;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;ActionScript &#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#21046;&#32004;&#12391;&#12399;&#12289;ActionScript &#21521;&#12369;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12383;&#12463;&#12521;&#12473;&#21517;&#12434;&#21547;&#12416;&#12450;&#12475;&#12483;&#12488;&#12394;&#12393;&#12398;&#12289;&#12354;&#12425;&#12422;&#12427; ActionScript &#12364;&#23550;&#35937;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12354;&#12425;&#12422;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#20197;&#19979;&#12398;&#20363;&#12398;&#12424;&#12358;&#12395;&#12289;&#35242; SWF &#12392;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390; SWF &#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
 var loader:Loader = new Loader();&#13;
 var url:URLRequest = new URLRequest("swfs/SecondarySwf.swf");&#13;
 var loaderContext:LoaderContext = new LoaderContext(false, ApplicationDomain.currentDomain, null);&#13;
 loader.load(url, loaderContext);</pre></div>&#13;
 &#13;
               <p>&#12414;&#12383;&#12289;iOS &#12391;&#12399;&#12289;ActionScript &#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#65288;ABC&#65289;&#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12390;&#12363;&#12425;&#12450;&#12531;&#12525;&#12540;&#12489;&#12375;&#12289;&#20877;&#24230;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12434;&#34892;&#12362;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12456;&#12521;&#12540; 3764 &#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <p>AIR 3.6 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12363;&#12425;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#32076;&#30001;&#12391;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12525;&#12540;&#12489;&#12391;&#12365;&#12427;&#12398;&#12399; ActionScript &#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12434;&#21547;&#12414;&#12394;&#12356; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12415;&#12391;&#12377;&#12290;ActionScript &#12434;&#21547;&#12416;&#22806;&#37096; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#20195;&#12431;&#12426;&#12395;&#12289;SWC &#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#20316;&#25104;&#12375;&#12289;&#12381;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#12513;&#12452;&#12531; SWF &#12395;&#12522;&#12531;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
               <p>&#12371;&#12428;&#12425;&#12398; iOS &#12398;&#21046;&#32004;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434; iOS &#12471;&#12511;&#12517;&#12524;&#12540;&#12479;&#12540;&#65288;ipa-test-interpreter-simulator &#12418;&#12375;&#12367;&#12399; ipa-debug-interpreter-simulator&#65289;&#12414;&#12383;&#12399;&#12452;&#12531;&#12479;&#12540;&#12503;&#12522;&#12479;&#12540;&#12514;&#12540;&#12489;&#65288;ipa-test-interpreter &#12418;&#12375;&#12367;&#12399; ipa-debug-interpreter&#65289;&#12391;&#23455;&#34892;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#13;
                  <b>Loader &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</b>&#13;
               </p>&#13;
 &#13;
               <p>Loader &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;Flash Player &#12362;&#12424;&#12403; Adobe AIR &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12514;&#12487;&#12523;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>&#13;
 &#13;
               <ul><li>&#12467;&#12531;&#12486;&#12531;&#12484;&#12399;&#12289;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12477;&#12540;&#12473;&#12391;&#12354;&#12428;&#12400;&#12393;&#12398;&#12477;&#12540;&#12473;&#12363;&#12425;&#12391;&#12418;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290; </li>&#13;
                  <li>&#21628;&#12403;&#20986;&#12375;&#20803; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#19978;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12395;&#12354;&#12426;&#12289;&#35501;&#12415;&#36796;&#12416;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12459;&#12523;&#12395;&#12354;&#12427;&#22580;&#21512;&#12399;&#35501;&#12415;&#36796;&#12417;&#12414;&#12379;&#12435;&#12290; </li>&#13;
                  <li>&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364; ActionScript 3.0 &#12391;&#20316;&#25104;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#21512;&#12289;&#21029;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451; Sandbox &#12395;&#12354;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12381;&#12428;&#12434;&#12463;&#12525;&#12473;&#12473;&#12463;&#12522;&#12503;&#12488;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#12501;&#12449;&#12452;&#12523;&#12391;&#12289;<code>System.allowDomain()</code> &#12414;&#12383;&#12399; <code>System.allowInsecureDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#21628;&#12403;&#20986;&#12375;&#12395;&#12424;&#12387;&#12390;&#12463;&#12525;&#12473;&#12473;&#12463;&#12522;&#12503;&#12488;&#12395;&#38306;&#12377;&#12427;&#21462;&#12426;&#27770;&#12417;&#12364;&#25215;&#35469;&#12373;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290;</li>&#13;
                  <li>&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364; AVM1 SWF &#12501;&#12449;&#12452;&#12523;&#65288;ActionScript 1.0 &#12414;&#12383;&#12399; 2.0 &#12391;&#20316;&#25104;&#12373;&#12428;&#12383;&#12418;&#12398;&#65289;&#12398;&#22580;&#21512;&#12289;AVM2 SWF &#12501;&#12449;&#12452;&#12523;&#65288;ActionScript 3.0 &#12391;&#20316;&#25104;&#12373;&#12428;&#12383;&#12418;&#12398;&#65289;&#12391;&#12381;&#12428;&#12434;&#12463;&#12525;&#12473;&#12473;&#12463;&#12522;&#12503;&#12488;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;LocalConnection &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;2 &#12388;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#38291;&#12391;&#36890;&#20449;&#12434;&#34892;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12290;</li>&#13;
                  <li>&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#12452;&#12513;&#12540;&#12472;&#12398;&#22580;&#21512;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12398;&#22806;&#12395;&#12354;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12381;&#12398;&#12487;&#12540;&#12479;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#12381;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12489;&#12513;&#12452;&#12531;&#12364;&#12452;&#12513;&#12540;&#12472;&#12398;&#20803;&#12398;&#12489;&#12513;&#12452;&#12531;&#12395;&#12354;&#12427; URL &#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290;</li>&#13;
                  <li>&#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12395;&#12354;&#12427;&#12512;&#12540;&#12499;&#12540;&#12463;&#12522;&#12483;&#12503;&#12391;&#12399;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#25509;&#32154;&#12375;&#12383;&#12525;&#12540;&#12459;&#12523;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12395;&#12354;&#12427;&#12512;&#12540;&#12499;&#12540;&#12463;&#12522;&#12483;&#12503;&#12434;&#12473;&#12463;&#12522;&#12503;&#12488;&#20966;&#29702;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12381;&#12398;&#36870;&#12418;&#21516;&#27096;&#12391;&#12377;&#12290; </li>&#13;
                  <li>&#19968;&#33324;&#30340;&#12394;&#20104;&#32004;&#12509;&#12540;&#12488;&#12395;&#12399;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#36974;&#26029;&#12373;&#12428;&#12383;&#12509;&#12540;&#12488;&#12398;&#35443;&#12375;&#12356;&#12522;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12302;ActionScript 3.0 &#38283;&#30330;&#12460;&#12452;&#12489;<i></i>&#12303;&#12398;&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463; API &#12398;&#21046;&#38480;&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </li>&#13;
               </ul><p>&#12383;&#12384;&#12375;&#12289; AIR &#12391;&#12399;&#12289;<code>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</code>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20869;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#20849;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#38480;&#12395;&#12424;&#12427;&#21046;&#38480;&#12434;&#21463;&#12369;&#12414;&#12379;&#12435;&#12290;</p>&#13;
 &#13;
               <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
               <p>&#20449;&#38972;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12477;&#12540;&#12473;&#65288;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12523;&#12540;&#12488; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12489;&#12513;&#12452;&#12531;&#20197;&#22806;&#12398;&#12489;&#12513;&#12452;&#12531;&#12394;&#12393;&#65289;&#12363;&#12425; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12416;&#22580;&#21512;&#12399;&#12289;&#27425;&#12398;&#12467;&#12540;&#12489;&#12395;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12510;&#12473;&#12463;&#12434;&#23450;&#32681;&#12375;&#12390;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#65288;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#65289;&#12364;&#12381;&#12398;&#12510;&#12473;&#12463;&#12398;&#22806;&#37096;&#12395;&#12354;&#12427;&#12473;&#12486;&#12540;&#12472;&#12398;&#19968;&#37096;&#20998;&#12395;&#25551;&#30011;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
 &#13;
               <div class="listing"><pre>&#13;
 import flash.display.*;&#13;
 import flash.net.URLRequest;&#13;
 var rect:Shape = new Shape();&#13;
 rect.graphics.beginFill(0xFFFFFF);&#13;
 rect.graphics.drawRect(0, 0, 100, 100);&#13;
 rect.graphics.endFill();&#13;
 addChild(rect);&#13;
 var ldr:Loader = new Loader();&#13;
 ldr.mask = rect;&#13;
 var url:String = "http://www.unknown.example.com/content.swf";&#13;
 var urlReq:URLRequest = new URLRequest(url);&#13;
 ldr.load(urlReq);&#13;
 addChild(ldr);&#13;
 </pre><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div></div>&#13;
 &#13;
            <p></p><p><a href="#includeExamplesSummary">&#20363;&#12434;&#34920;&#31034;</a></p><p id="moreExamples"><span class="classHeaderTableLabel">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d9e.html" target="_blank">&#22806;&#37096;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12489;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS1EFE2EDA-026D-4d14-864E-79DFD56F87C6.html" target="_blank">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463; API &#12398;&#21046;&#38480;</a></div><p id="learnMore"><span class="classHeaderTableLabel">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e58.html" target="_blank">&#34920;&#31034;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e3e.html" target="_blank">&#34920;&#31034;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12398;&#22522;&#26412;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e3c.html" target="_blank">&#12467;&#12450;&#34920;&#31034;&#12463;&#12521;&#12473;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e13.html" target="_blank">&#34920;&#31034;&#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#21205;&#30340;&#12525;&#12540;&#12489;</a><br /><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7d5b.html" target="_blank">&#12511;&#12483;&#12503;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#21033;&#29992;</a><br /></div><p><span class="classHeaderTableLabel">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LoaderInfo.html" target="">flash.display.LoaderInfo</a><br /><a href="../../flash/net/URLLoader.html" target="">flash.net.URLLoader</a><br /><a href="DisplayObject.html" target="">flash.display.DisplayObject</a></div><br /><hr /></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="propertySummary" id="propertySummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12503;&#12525;&#12497;&#12486;&#12451;</div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableProperty"><tr><th>&#160;</th><th colspan="2">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#content" class="signatureLink">content</a> : <a href="../../flash/display/DisplayObject.html">DisplayObject</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
     load() &#12414;&#12383;&#12399; loadBytes() &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12452;&#12513;&#12540;&#12472;&#65288;JPG&#12289;PNG&#12289;&#12414;&#12383;&#12399; GIF&#65289;&#12501;&#12449;&#12452;&#12523;&#12398;&#12523;&#12540;&#12488;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#contentLoaderInfo" class="signatureLink">contentLoaderInfo</a> : <a href="../../flash/display/LoaderInfo.html">LoaderInfo</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
     &#35501;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#24540;&#12377;&#12427; LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr><tr class="" runtime="Flash::10.1##AIR::2##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><a href="#uncaughtErrorEvents" class="signatureLink">uncaughtErrorEvents</a> : <a href="../../flash/events/UncaughtErrorEvents.html">UncaughtErrorEvents</a><div class="summaryTableDescription">[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] &#13;
	 &#12371;&#12398; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#35501;&#12415;&#36796;&#12435;&#12384; SWF &#12391;&#19981;&#26126;&#12394;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;uncaughtError &#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="methodSummary" id="methodSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12497;&#12502;&#12522;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489; </div><table cellspacing="0" cellpadding="3" class="summaryTable " id="summaryTableMethod"><tr><th>&#160;</th><th colspan="2">&#12513;&#12477;&#12483;&#12489;</th><th>&#23450;&#32681;&#20803;</th></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#Loader()" class="signatureLink">Loader</a>()</div><div class="summaryTableDescription">&#13;
     SWF&#12289;JPEG&#12289;GIF&#12289;&#12414;&#12383;&#12399; PNG &#12394;&#12393;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#35501;&#12415;&#36796;&#12415;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#close()" class="signatureLink">close</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     Loader &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#29694;&#22312;&#36914;&#34892;&#20013;&#12398; load() &#12513;&#12477;&#12483;&#12489;&#12398;&#20966;&#29702;&#12434;&#12461;&#12515;&#12531;&#12475;&#12523;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#load()" class="signatureLink">load</a>(request:<a href="../../flash/net/URLRequest.html">URLRequest</a>, context:<a href="../../flash/system/LoaderContext.html">LoaderContext</a> = null):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     SWF&#12289;JPEG&#12289;&#12503;&#12525;&#12464;&#12524;&#12483;&#12471;&#12502; JPEG&#12289;&#38750;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531; GIF&#12289;&#12414;&#12383;&#12399; PNG &#12501;&#12449;&#12452;&#12523;&#12434;&#12289;&#12371;&#12398; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#12391;&#12354;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#loadBytes()" class="signatureLink">loadBytes</a>(bytes:<a href="../../flash/utils/ByteArray.html">ByteArray</a>, context:<a href="../../flash/system/LoaderContext.html">LoaderContext</a> = null):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     ByteArray &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#20445;&#31649;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12452;&#12490;&#12522;&#12487;&#12540;&#12479;&#12363;&#12425;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr><tr class="" runtime="AIR::2.5##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="#loadFilePromise()" class="signatureLink">loadFilePromise</a>(promise:<a href="../../flash/desktop/IFilePromise.html">IFilePromise</a>, context:<a href="../../flash/system/LoaderContext.html">LoaderContext</a> = null):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
	 IFilePromise &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr><tr class="" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#unload()" class="signatureLink">unload</a>():<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     load() &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12289;&#12371;&#12398; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr><tr class="" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol">&#160;</td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="#unloadAndStop()" class="signatureLink">unloadAndStop</a>(gc:<a href="../../Boolean.html">Boolean</a> = true):<a href="../../specialTypes.html#void">void</a></div><div class="summaryTableDescription">&#13;
     &#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12398;&#12450;&#12531;&#12525;&#12540;&#12489;&#12434;&#35430;&#12415;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12467;&#12510;&#12531;&#12489;&#12398;&#23455;&#34892;&#12434;&#20013;&#27490;&#12375;&#12414;&#12377;&#12290;</div></td><td class="summaryTableOwnerCol">Loader</td></tr></table></div><a xmlns:xd="http://www.pnp-software.com/XSLTdoc" name="eventSummary" id="eventSummary"></a><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="summarySection"><div class="summaryTableTitle">&#12452;&#12505;&#12531;&#12488;</div><table cellspacing="0" cellpadding="3" class="summaryTable hideInheritedEvent" id="summaryTableEvent"><tr><th>&#160;</th><th colspan="2">&#12452;&#12505;&#12531;&#12488;</th><th> &#27010;&#35201; </th><th>&#23450;&#32681;&#20803;</th></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:activate" class="signatureLink">activate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12390;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:added" class="signatureLink">added</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#34920;&#31034;&#12522;&#12473;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9.0.28.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:addedToStage" class="signatureLink">addedToStage</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12289;&#30452;&#25509;&#12289;&#12414;&#12383;&#12399;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12469;&#12502;&#12484;&#12522;&#12540;&#12398;&#36861;&#21152;&#12395;&#12424;&#12426;&#12289;&#12473;&#12486;&#12540;&#12472;&#19978;&#12398;&#34920;&#31034;&#12522;&#12473;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:clear" class="signatureLink">clear</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12300;&#21066;&#38500;&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#36865;&#20449;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:click" class="signatureLink">click</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#21516;&#12376; InteractiveObject &#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#12513;&#12452;&#12531;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12390;&#38626;&#12377;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="../../flash/display/InteractiveObject.html#event:contextMenu" class="signatureLink">contextMenu</a></div></td><td class="summaryTableDescription summaryTableCol">AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12371;&#12398;&#12452;&#12531;&#12479;&#12521;&#12463;&#12486;&#12451;&#12502;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12434;&#12518;&#12540;&#12470;&#12540;&#12472;&#12455;&#12473;&#12481;&#12515;&#12364;&#12488;&#12522;&#12460;&#12540;&#12377;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:copy" class="signatureLink">copy</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12467;&#12500;&#12540;&#25805;&#20316;&#12398;&#12383;&#12417;&#12395;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#22266;&#26377;&#12398;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12479;&#12540;&#12461;&#12540;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12375;&#12383;&#12392;&#12365;&#12289;&#12414;&#12383;&#12399;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12300;&#12467;&#12500;&#12540;&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:cut" class="signatureLink">cut</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12459;&#12483;&#12488;&#25805;&#20316;&#12398;&#12383;&#12417;&#12395;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#22266;&#26377;&#12398;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12479;&#12540;&#12461;&#12540;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12375;&#12383;&#12392;&#12365;&#12289;&#12414;&#12383;&#12399;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12300;&#12459;&#12483;&#12488;&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/events/EventDispatcher.html#event:deactivate" class="signatureLink">deactivate</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] Flash Player &#12414;&#12383;&#12399; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12390;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/events/EventDispatcher.html">EventDispatcher</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:doubleClick" class="signatureLink">doubleClick</a></div></td><td class="summaryTableDescription summaryTableCol">&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; doubleClickEnabled &#12501;&#12521;&#12464;&#12364; true &#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12434;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#12513;&#12452;&#12531;&#12508;&#12479;&#12531;&#12391; 2 &#22238;&#32154;&#12369;&#12390;&#12377;&#12400;&#12420;&#12367;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:enterFrame" class="signatureLink">enterFrame</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] &#20877;&#29983;&#12504;&#12483;&#12489;&#12364;&#26032;&#12375;&#12356;&#12501;&#12524;&#12540;&#12512;&#12395;&#20837;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:exitFrame" class="signatureLink">exitFrame</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] &#20877;&#29983;&#12504;&#12483;&#12489;&#12364;&#29694;&#22312;&#12398;&#12501;&#12524;&#12540;&#12512;&#12434;&#32066;&#20102;&#12377;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:focusIn" class="signatureLink">focusIn</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#21462;&#24471;&#12375;&#12383;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:focusOut" class="signatureLink">focusOut</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22833;&#12387;&#12383;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:frameConstructed" class="signatureLink">frameConstructed</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] &#12501;&#12524;&#12540;&#12512;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12364;&#23455;&#34892;&#12375;&#12383;&#24460;&#12391;&#12289;&#12363;&#12388;&#12501;&#12524;&#12540;&#12512;&#12473;&#12463;&#12522;&#12503;&#12488;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:gestureLongPress" class="signatureLink">gestureLongPress</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#21516;&#12376; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12398; 2 &#12388;&#12398;&#25509;&#35302;&#20301;&#32622;&#12434;&#25276;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12434;&#12289;2 &#26412;&#12398;&#25351;&#12391;&#25276;&#12375;&#12383;&#12426;&#38626;&#12375;&#12383;&#12426;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:gesturePan" class="signatureLink">gesturePan</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12398;&#25509;&#35302;&#20301;&#32622;&#12391;&#12479;&#12483;&#12481;&#12509;&#12452;&#12531;&#12488;&#12434;&#31227;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12420;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12391;&#12289;&#25351;&#12434;&#24038;&#12363;&#12425;&#21491;&#12395;&#21205;&#12363;&#12377;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:gestureRotate" class="signatureLink">gestureRotate</a></div></td><td class="summaryTableDescription summaryTableCol">InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#25509;&#35302;&#20301;&#32622;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#22238;&#36578;&#12472;&#12455;&#12473;&#12481;&#12515;&#12434;&#23455;&#34892;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#30011;&#38754;&#12395; 2 &#26412;&#25351;&#12391;&#35302;&#12428;&#12289;&#12381;&#12398;&#25351;&#12434;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12391;&#22238;&#36578;&#12373;&#12379;&#12427;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:gestureSwipe" class="signatureLink">gestureSwipe</a></div></td><td class="summaryTableDescription summaryTableCol">InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#25509;&#35302;&#20301;&#32622;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12473;&#12527;&#12452;&#12503;&#12472;&#12455;&#12473;&#12481;&#12515;&#12434;&#23455;&#34892;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#30011;&#38754;&#12395; 3 &#26412;&#25351;&#12391;&#35302;&#12428;&#12390;&#12363;&#12425;&#12289;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12391;&#12381;&#12398; 3 &#26412;&#12398;&#25351;&#12434;&#12381;&#12429;&#12360;&#12390;&#21205;&#12363;&#12375;&#12383;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:gestureTap" class="signatureLink">gestureTap</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#19978;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#25509;&#35302;&#20301;&#32622;&#12434;&#24418;&#25104;&#12375;&#12390;&#12363;&#12425;&#12479;&#12483;&#12503;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#30011;&#38754;&#12391;&#12289;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12395;&#35079;&#25968;&#12398;&#25351;&#12434;&#32622;&#12356;&#12390;&#12513;&#12491;&#12517;&#12540;&#12434;&#38283;&#12356;&#12390;&#12363;&#12425;&#12289;1 &#26412;&#12398;&#25351;&#12391;&#12479;&#12483;&#12503;&#12375;&#12390;&#12513;&#12491;&#12517;&#12540;&#12450;&#12452;&#12486;&#12512;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:gestureZoom" class="signatureLink">gestureZoom</a></div></td><td class="summaryTableDescription summaryTableCol">InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12398;&#25509;&#35302;&#20301;&#32622;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12474;&#12540;&#12512;&#12472;&#12455;&#12473;&#12481;&#12515;&#12434;&#23455;&#34892;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#30011;&#38754;&#12395; 2 &#26412;&#25351;&#12391;&#35302;&#12428;&#12390;&#12363;&#12425;&#12289;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12391;&#12381;&#12398; 2 &#26412;&#12398;&#25351;&#12434;&#12377;&#12400;&#12420;&#12367;&#24195;&#12370;&#12383;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:imeStartComposition" class="signatureLink">imeStartComposition</a></div></td><td class="summaryTableDescription summaryTableCol">&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12289;IME &#12391;&#12452;&#12531;&#12521;&#12452;&#12531;&#20837;&#21147;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:keyDown" class="signatureLink">keyDown</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12461;&#12540;&#12434;&#25276;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:keyFocusChange" class="signatureLink">keyFocusChange</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12461;&#12540;&#12508;&#12540;&#12489;&#25805;&#20316;&#12395;&#12424;&#12387;&#12390;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22793;&#26356;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:keyUp" class="signatureLink">keyUp</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12461;&#12540;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:middleClick" class="signatureLink">middleClick</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#21516;&#12376; InteractiveObject &#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#20013;&#22830;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12390;&#38626;&#12377;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:middleMouseDown" class="signatureLink">middleMouseDown</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#20013;&#22830;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:middleMouseUp" class="signatureLink">middleMouseUp</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#12508;&#12479;&#12531;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:mouseDown" class="signatureLink">mouseDown</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:mouseFocusChange" class="signatureLink">mouseFocusChange</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12391;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#22793;&#26356;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:mouseMove" class="signatureLink">mouseMove</a></div></td><td class="summaryTableDescription summaryTableCol">InteractiveObject &#12398;&#19978;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12434;&#31227;&#21205;&#12373;&#12379;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:mouseOut" class="signatureLink">mouseOut</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:mouseOver" class="signatureLink">mouseOver</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12434;&#21512;&#12431;&#12379;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:mouseUp" class="signatureLink">mouseUp</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#12508;&#12479;&#12531;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:mouseWheel" class="signatureLink">mouseWheel</a></div></td><td class="summaryTableDescription summaryTableCol">&#12510;&#12454;&#12473;&#12507;&#12452;&#12540;&#12523;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12434;&#22238;&#36578;&#12377;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:nativeDragComplete" class="signatureLink">nativeDragComplete</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12489;&#12521;&#12483;&#12464;&#12472;&#12455;&#12473;&#12481;&#12515;&#12434;&#27490;&#12417;&#12427;&#12392;&#12289;&#12489;&#12521;&#12483;&#12464;&#12452;&#12491;&#12471;&#12456;&#12540;&#12479; InteractiveObject &#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:nativeDragDrop" class="signatureLink">nativeDragDrop</a></div></td><td class="summaryTableDescription summaryTableCol">&#12489;&#12521;&#12483;&#12464;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12489;&#12525;&#12483;&#12503;&#12373;&#12428;&#12289;&#12381;&#12398;&#12489;&#12525;&#12483;&#12503;&#25805;&#20316;&#12364; DragManager.acceptDragDrop() &#12398;&#21628;&#12403;&#20986;&#12375;&#12391;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12383;&#22580;&#21512;&#12395;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398; InteractiveObject &#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:nativeDragEnter" class="signatureLink">nativeDragEnter</a></div></td><td class="summaryTableDescription summaryTableCol">&#12489;&#12521;&#12483;&#12464;&#12472;&#12455;&#12473;&#12481;&#12515;&#12364;&#22659;&#30028;&#12395;&#20837;&#12427;&#12392;&#12289;InteractiveObject &#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:nativeDragExit" class="signatureLink">nativeDragExit</a></div></td><td class="summaryTableDescription summaryTableCol">&#12489;&#12521;&#12483;&#12464;&#12472;&#12455;&#12473;&#12481;&#12515;&#12364;&#22659;&#30028;&#12434;&#20986;&#12427;&#12392;&#12289;InteractiveObject &#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:nativeDragOver" class="signatureLink">nativeDragOver</a></div></td><td class="summaryTableDescription summaryTableCol">&#12489;&#12521;&#12483;&#12464;&#12472;&#12455;&#12473;&#12481;&#12515;&#12364;&#22659;&#30028;&#12398;&#31684;&#22258;&#20869;&#12391;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#38291;&#12289;InteractiveObject &#12363;&#12425;&#32153;&#32154;&#30340;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:nativeDragStart" class="signatureLink">nativeDragStart</a></div></td><td class="summaryTableDescription summaryTableCol">&#12489;&#12521;&#12483;&#12464;&#25805;&#20316;&#12398;&#38283;&#22987;&#26178;&#12395;&#12289;DragManager.doDrag() &#21628;&#12403;&#20986;&#12375;&#12398;&#12489;&#12521;&#12483;&#12464;&#12452;&#12491;&#12471;&#12456;&#12540;&#12479;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427; InteractiveObject &#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:nativeDragUpdate" class="signatureLink">nativeDragUpdate</a></div></td><td class="summaryTableDescription summaryTableCol">&#12489;&#12521;&#12483;&#12464;&#25805;&#20316;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#38291;&#12395;&#12289;DragManager.doDrag() &#21628;&#12403;&#20986;&#12375;&#12398;&#12489;&#12521;&#12483;&#12464;&#12452;&#12491;&#12471;&#12456;&#12540;&#12479;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427; InteractiveObject &#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:paste" class="signatureLink">paste</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12506;&#12540;&#12473;&#12488;&#25805;&#20316;&#12398;&#12383;&#12417;&#12395;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#22266;&#26377;&#12398;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12479;&#12540;&#12461;&#12540;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12375;&#12383;&#12392;&#12365;&#12289;&#12414;&#12383;&#12399;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12300;&#12506;&#12540;&#12473;&#12488;&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="../../flash/display/InteractiveObject.html#event:proximityBegin" class="signatureLink">proximityBegin</a></div></td><td class="summaryTableDescription summaryTableCol">&#30011;&#38754;&#12398;&#39006;&#20284;&#24615;&#26908;&#20986;&#12375;&#12365;&#12356;&#20516;&#12434;&#36229;&#12360;&#12390;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12473;&#12479;&#12452;&#12521;&#12473;&#12434;&#38477;&#12429;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="../../flash/display/InteractiveObject.html#event:proximityEnd" class="signatureLink">proximityEnd</a></div></td><td class="summaryTableDescription summaryTableCol">&#30011;&#38754;&#12398;&#39006;&#20284;&#24615;&#26908;&#20986;&#12375;&#12365;&#12356;&#20516;&#12434;&#36229;&#12360;&#12390;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12473;&#12479;&#12452;&#12521;&#12473;&#12434;&#25345;&#12385;&#19978;&#12370;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="../../flash/display/InteractiveObject.html#event:proximityMove" class="signatureLink">proximityMove</a></div></td><td class="summaryTableDescription summaryTableCol">&#39006;&#20284;&#24615;&#26908;&#20986;&#12375;&#12365;&#12356;&#20516;&#12398;&#31684;&#22258;&#20869;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12473;&#12479;&#12452;&#12521;&#12473;&#12434;&#30011;&#38754;&#19978;&#12395;&#31227;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="../../flash/display/InteractiveObject.html#event:proximityOut" class="signatureLink">proximityOut</a></div></td><td class="summaryTableDescription summaryTableCol">&#30011;&#38754;&#12398;&#39006;&#20284;&#24615;&#26908;&#20986;&#12375;&#12365;&#12356;&#20516;&#12398;&#31684;&#22258;&#20869;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12371;&#12398; InteractiveObject &#12363;&#12425;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12473;&#12479;&#12452;&#12521;&#12473;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="../../flash/display/InteractiveObject.html#event:proximityOver" class="signatureLink">proximityOver</a></div></td><td class="summaryTableDescription summaryTableCol">&#30011;&#38754;&#12398;&#39006;&#20284;&#24615;&#26908;&#20986;&#12375;&#12365;&#12356;&#20516;&#12398;&#31684;&#22258;&#20869;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12371;&#12398; InteractiveObject &#12398;&#30495;&#19978;&#12395;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12473;&#12479;&#12452;&#12521;&#12473;&#12434;&#31227;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="../../flash/display/InteractiveObject.html#event:proximityRollOut" class="signatureLink">proximityRollOut</a></div></td><td class="summaryTableDescription summaryTableCol">&#30011;&#38754;&#12398;&#39006;&#20284;&#24615;&#26908;&#20986;&#12375;&#12365;&#12356;&#20516;&#12398;&#31684;&#22258;&#20869;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12371;&#12398; InteractiveObject &#12420;&#12381;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#23376;&#12363;&#12425;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12473;&#12479;&#12452;&#12521;&#12473;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;<a href="../../flash/display/InteractiveObject.html#event:proximityRollOver" class="signatureLink">proximityRollOver</a></div></td><td class="summaryTableDescription summaryTableCol">&#65288;&#30011;&#38754;&#12398;&#39006;&#20284;&#24615;&#26908;&#20986;&#12375;&#12365;&#12356;&#20516;&#12398;&#31684;&#22258;&#20869;&#12391;&#65289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12473;&#12479;&#12452;&#12521;&#12473;&#12434;&#34920;&#31034;&#12522;&#12473;&#12488;&#20869;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#23403;&#12484;&#12522;&#12540;&#12398;&#22806;&#20596;&#12363;&#12425; InteractiveObject &#19978;&#12395;&#31227;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::3.3##Flash::11.3##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:releaseOutside" class="signatureLink">releaseOutside</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#26368;&#21021;&#12395; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12289;&#27425;&#12395;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12434;&#12381;&#12398; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#20197;&#22806;&#12398;&#22580;&#25152;&#12395;&#31227;&#21205;&#12375;&#12383;&#24460;&#12289;&#12508;&#12479;&#12531;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:removed" class="signatureLink">removed</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#34920;&#31034;&#12522;&#12473;&#12488;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9.0.28.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:removedFromStage" class="signatureLink">removedFromStage</a></div></td><td class="summaryTableDescription summaryTableCol">&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12289;&#30452;&#25509;&#12289;&#12414;&#12383;&#12399;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12416;&#12469;&#12502;&#12484;&#12522;&#12540;&#12398;&#21066;&#38500;&#12395;&#12424;&#12426;&#12289;&#34920;&#31034;&#12522;&#12473;&#12488;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/DisplayObject.html#event:render" class="signatureLink">render</a></div></td><td class="summaryTableDescription summaryTableCol">[&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12452;&#12505;&#12531;&#12488;] &#34920;&#31034;&#12522;&#12473;&#12488;&#12364;&#26356;&#26032;&#12362;&#12424;&#12403;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/DisplayObject.html">DisplayObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:rightClick" class="signatureLink">rightClick</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#21516;&#12376; InteractiveObject &#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#21491;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12390;&#38626;&#12377;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:rightMouseDown" class="signatureLink">rightMouseDown</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="AIR::1.0##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:rightMouseUp" class="signatureLink">rightMouseUp</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12398;&#12508;&#12479;&#12531;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:rollOut" class="signatureLink">rollOut</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:rollOver" class="signatureLink">rollOver</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12509;&#12452;&#12531;&#12486;&#12451;&#12531;&#12464;&#12487;&#12496;&#12452;&#12473;&#12434;&#21512;&#12431;&#12379;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10##AIR::1.5##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:selectAll" class="signatureLink">selectAll</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12377;&#12409;&#12390;&#36984;&#25246;&#25805;&#20316;&#12398;&#12383;&#12417;&#12395;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#22266;&#26377;&#12398;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12479;&#12540;&#12461;&#12540;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12375;&#12383;&#12392;&#12365;&#12289;&#12414;&#12383;&#12399;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12300;&#12377;&#12409;&#12390;&#36984;&#25246;&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.2##AIR::2.6##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:softKeyboardActivate" class="signatureLink">softKeyboardActivate</a></div></td><td class="summaryTableDescription summaryTableCol">&#12477;&#12501;&#12488;&#12461;&#12540;&#12508;&#12540;&#12489;&#12364;&#21069;&#38754;&#12395;&#34920;&#31034;&#12373;&#12428;&#12383;&#30452;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.2##AIR::2.6##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:softKeyboardActivating" class="signatureLink">softKeyboardActivating</a></div></td><td class="summaryTableDescription summaryTableCol">&#12477;&#12501;&#12488;&#12461;&#12540;&#12508;&#12540;&#12489;&#12364;&#21069;&#38754;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#30452;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.2##AIR::2.6##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:softKeyboardDeactivate" class="signatureLink">softKeyboardDeactivate</a></div></td><td class="summaryTableDescription summaryTableCol">&#12477;&#12501;&#12488;&#12461;&#12540;&#12508;&#12540;&#12489;&#12364;&#32972;&#24460;&#12395;&#31227;&#21205;&#12375;&#12390;&#38750;&#34920;&#31034;&#12395;&#12394;&#12387;&#12383;&#30452;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:tabChildrenChange" class="signatureLink">tabChildrenChange</a></div></td><td class="summaryTableDescription summaryTableCol">&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; tabChildren &#12501;&#12521;&#12464;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:tabEnabledChange" class="signatureLink">tabEnabledChange</a></div></td><td class="summaryTableDescription summaryTableCol">&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; tabEnabled &#12501;&#12521;&#12464;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:tabIndexChange" class="signatureLink">tabIndexChange</a></div></td><td class="summaryTableDescription summaryTableCol">&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; tabIndex &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::9##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:textInput" class="signatureLink">textInput</a></div></td><td class="summaryTableDescription summaryTableCol">&#12486;&#12461;&#12473;&#12488;&#12398;&#25991;&#23383;&#12434;&#20837;&#21147;&#12377;&#12427;&#12392;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:touchBegin" class="signatureLink">touchBegin</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12395;&#12518;&#12540;&#12470;&#12540;&#12364;&#21021;&#12417;&#12390;&#25509;&#35302;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#30011;&#38754;&#12395;&#25351;&#12391;&#35302;&#12428;&#12427;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:touchEnd" class="signatureLink">touchEnd</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#25509;&#35302;&#12434;&#35299;&#38500;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#30011;&#38754;&#12363;&#12425;&#25351;&#12434;&#38626;&#12377;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:touchMove" class="signatureLink">touchMove</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12487;&#12496;&#12452;&#12473;&#12395;&#12479;&#12483;&#12481;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12289;&#25509;&#35302;&#12509;&#12452;&#12531;&#12488;&#12364;&#12394;&#12367;&#12394;&#12427;&#12414;&#12391;&#32153;&#32154;&#30340;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:touchOut" class="signatureLink">touchOut</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#25509;&#35302;&#20301;&#32622;&#12434; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#22806;&#12395;&#31227;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12391;&#12289;1 &#12388;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#21029;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#25351;&#12434;&#12489;&#12521;&#12483;&#12464;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:touchOver" class="signatureLink">touchOver</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#25509;&#35302;&#20301;&#32622;&#12434;&#31227;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12391;&#12289;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22806;&#12395;&#12354;&#12427;&#20301;&#32622;&#12363;&#12425;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12395;&#25351;&#12434;&#12489;&#12521;&#12483;&#12464;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:touchRollOut" class="signatureLink">touchRollOut</a></div></td><td class="summaryTableDescription summaryTableCol">&#12518;&#12540;&#12470;&#12540;&#12364;&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12398; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22806;&#12395;&#25509;&#35302;&#28857;&#12434;&#21205;&#12363;&#12375;&#12383;&#12392;&#12365;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#12434;&#20633;&#12360;&#12383;&#25658;&#24111;&#38651;&#35441;&#12420;&#12479;&#12502;&#12524;&#12483;&#12488;&#12391;&#12289;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#22806;&#12395;&#25351;&#12434;&#12489;&#12521;&#12483;&#12464;&#12375;&#12383;&#12392;&#12365;&#65289;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:touchRollOver" class="signatureLink">touchRollOver</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#25509;&#35302;&#20301;&#32622;&#12434;&#31227;&#21205;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12391;&#12289;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#22806;&#12395;&#12354;&#12427;&#20301;&#32622;&#12363;&#12425;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12395;&#25351;&#12434;&#12489;&#12521;&#12483;&#12464;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr><tr class="hideInheritedEvent" runtime="Flash::10.1##AIR::2##Lite::4##"><td class="summaryTablePaddingCol">&#160;</td><td class="summaryTableInheritanceCol"><img src="../../images/inheritedSummary.gif" alt="Inherited" title="Inherited" class="inheritedSummaryImage" /></td><td class="summaryTableSignatureCol"><div class="summarySignature"><a href="../../flash/display/InteractiveObject.html#event:touchTap" class="signatureLink">touchTap</a></div></td><td class="summaryTableDescription summaryTableCol">&#12479;&#12483;&#12481;&#23550;&#24540;&#12487;&#12496;&#12452;&#12473;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#25509;&#35302;&#12434;&#38283;&#22987;&#12375;&#12383; InteractiveObject &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21516;&#12376;&#20301;&#32622;&#12363;&#12425;&#25351;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400;&#12289;&#12479;&#12483;&#12481;&#12473;&#12463;&#12522;&#12540;&#12531;&#25645;&#36617;&#12398;&#25658;&#24111;&#38651;&#35441;&#12414;&#12383;&#12399;&#12479;&#12502;&#12524;&#12483;&#12488;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#19978;&#12398; 1 &#28857;&#12434;&#12289;&#25351;&#12391;&#25276;&#12375;&#12383;&#12426;&#38626;&#12375;&#12383;&#12426;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#65289;&#12290;</td><td class="summaryTableOwnerCol"><a href="../../flash/display/InteractiveObject.html">InteractiveObject</a></td></tr></table></div><div xmlns:xd="http://www.pnp-software.com/XSLTdoc" class="MainContent"><div class="detailSectionHeader">&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/content" class="dashAnchor" id="//apple_ref/cpp/Property/content"></a><a name="content" id="content"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>content</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td></tr></table><div class="detailBody"><code>content:<a href="../../flash/display/DisplayObject.html">DisplayObject</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     <code>load()</code> &#12513;&#12477;&#12483;&#12489;&#12414;&#12383;&#12399; <code>loadBytes()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12452;&#12513;&#12540;&#12472;&#65288;JPG&#12289;PNG&#12289;&#12414;&#12383;&#12399; GIF&#65289;&#12501;&#12449;&#12452;&#12523;&#12398;&#12523;&#12540;&#12488;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get content():<a href="../../flash/display/DisplayObject.html">DisplayObject</a></code><br /><br /><span class="label"> &#20363;&#22806; </span><br /><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#35501;&#12415;&#36796;&#12414;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12452;&#12513;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12450;&#12463;&#12475;&#12473;&#27177;&#38480;&#12364;&#19982;&#12360;&#12425;&#12428;&#12390;&#12356;&#12394;&#12356;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451; Sandbox &#12395;&#23646;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#21512;&#12289;&#12501;&#12449;&#12452;&#12523;&#12391; <code>Security.allowDomain()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12371;&#12398;&#29366;&#27841;&#12434;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12399;&#12289;<code>loaderContext</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65288;<code>securityDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65289;&#12434; <code>SecurityDomain.currentDomain</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#65288;&#12383;&#12384;&#12375;&#12289;&#35501;&#12415;&#36796;&#12416;&#20596;&#12398;&#12501;&#12449;&#12452;&#12523;&#12391; <code>load()</code> &#12414;&#12383;&#12399; <code>loadBytes()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12365;&#65289;&#12289;&#12371;&#12398;&#29366;&#27841;&#12434;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="DisplayObject.html" target="">flash.display.DisplayObject</a><br /><a href="Loader.html#load()" target="">flash.display.Loader.load()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/contentLoaderInfo" class="dashAnchor" id="//apple_ref/cpp/Property/contentLoaderInfo"></a><a name="contentLoaderInfo" id="contentLoaderInfo"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>contentLoaderInfo</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>contentLoaderInfo:<a href="../../flash/display/LoaderInfo.html">LoaderInfo</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#35501;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#24540;&#12377;&#12427; LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#38291;&#12391;&#20849;&#26377;&#12373;&#12428;&#12414;&#12377;&#12290;LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#35501;&#12415;&#36796;&#12415;&#12398;&#36914;&#34892;&#29366;&#27841;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12392;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#12377;&#12427;&#32113;&#35336;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#13;
     &#13;
     </p><p>&#35501;&#12415;&#36796;&#12415;&#12395;&#38306;&#36899;&#12377;&#12427;&#12452;&#12505;&#12531;&#12488;&#12399;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>contentLoaderInfo</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#21442;&#29031;&#12373;&#12428;&#12427; LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>contentLoaderInfo</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#35501;&#12415;&#36796;&#12415;&#12398;&#21069;&#12418;&#12289;&#26377;&#21177;&#12394; valid LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#35501;&#12415;&#36796;&#12415;&#12398;&#21069;&#12395;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12434;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	 <p>&#35501;&#12415;&#36796;&#12414;&#12428;&#12383; SWF &#12391;&#30330;&#29983;&#12377;&#12427;&#19981;&#26126;&#12394;&#12456;&#12521;&#12540;&#12434;&#26908;&#20986;&#12377;&#12427;&#12395;&#12399;&#12289;<code>Loader.contentLoaderInfo.uncaughtErrorEvents</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12399;&#12394;&#12367;&#12289;<code>Loader.uncaughtErrorEvents</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; </p>&#13;
     &#13;
     <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get contentLoaderInfo():<a href="../../flash/display/LoaderInfo.html">LoaderInfo</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="LoaderInfo.html" target="">flash.display.LoaderInfo</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;Loader &#12463;&#12521;&#12473;&#12362;&#12424;&#12403; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; contentLoaderInfo &#12503;&#12525;&#12497;&#12486;&#12451;&#12398; complete &#12452;&#12505;&#12531;&#12488; &#12434;&#20351;&#29992;&#12375;&#12289;ActionScript 3.0 &#12391;&#12452;&#12513;&#12540;&#12472;&#12434;&#12525;&#12540;&#12489;&#12375;&#12390;&#37197;&#32622;&#12377;&#12427;&#26041;&#27861;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;<a href="http://actionscriptexamples.com/2008/03/03/positioning-a-dynamically-loaded-image-in-actionscript-20-and-actionscript-30-using-the-moviecliploader-class-and-loader-class/" target="_mmexternal">ActionScriptExamples.com</a> &#12391;&#20316;&#25104;&#12373;&#12428;&#12383;&#20363;&#12290; &#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
var url:String = "http://www.helpexamples.com/flash/images/image2.jpg";&#13;
var urlRequest:URLRequest = new URLRequest(url);&#13;
var loader:Loader = new Loader();&#13;
loader.contentLoaderInfo.addEventListener(Event.COMPLETE, loader_complete);&#13;
loader.load(urlRequest);&#13;
addChild(loader);&#13;
 &#13;
function loader_complete(evt:Event):void {&#13;
    var target_mc:Loader = evt.currentTarget.loader as Loader;&#13;
    target_mc.x = (stage.stageWidth - target_mc.width) / 2;&#13;
    target_mc.y = (stage.stageHeight - target_mc.height) / 2;&#13;
}&#13;
&#13;
</pre></div></div></span></div></span><span id="pageFilter" runtime="Flash::10.1##AIR::2##"><a name="propertyDetail" id="propertyDetail"></a><a name="//apple_ref/cpp/Property/uncaughtErrorEvents" class="dashAnchor" id="//apple_ref/cpp/Property/uncaughtErrorEvents"></a><a name="uncaughtErrorEvents" id="uncaughtErrorEvents"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>uncaughtErrorEvents</h3></td><td class="detailHeaderType">&#12503;&#12525;&#12497;&#12486;&#12451;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code>uncaughtErrorEvents:<a href="../../flash/events/UncaughtErrorEvents.html">UncaughtErrorEvents</a></code>&#160;&#160;[&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;] <p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10.1, AIR 2</td></tr></table><p></p><p></p><p>&#13;
	 &#12371;&#12398; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#35501;&#12415;&#36796;&#12435;&#12384; SWF &#12391;&#19981;&#26126;&#12394;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;<code>uncaughtError</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#36865;&#20986;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#19981;&#26126;&#12394;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12377;&#12427;&#12398;&#12399;&#12289;&#12356;&#12378;&#12428;&#12363;&#12398; <code>try..catch</code> &#12502;&#12525;&#12483;&#12463;&#12398;&#22806;&#20596;&#12391;&#12456;&#12521;&#12540;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12383;&#12426;&#12289;&#30331;&#37682;&#12373;&#12428;&#12383;&#12522;&#12473;&#12490;&#12540;&#12434;&#25345;&#12383;&#12394;&#12356; ErrorEvent &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#36865;&#20986;&#12373;&#12428;&#12427;&#22580;&#21512;&#12391;&#12377;&#12290;&#13;
	 &#13;
	 </p><p>Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>uncaughtErrorEvents</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12427;&#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12363;&#12425;&#30452;&#25509;&#36865;&#20986;&#12373;&#12428;&#12427;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12496;&#12502;&#12523;&#12373;&#12428;&#12383;&#12452;&#12505;&#12531;&#12488;&#12391;&#12377;&#12290;&#12479;&#12540;&#12466;&#12483;&#12488;&#27573;&#38542;&#12391; <code>uncaughtErrorEvent</code> &#12434;&#36865;&#20986;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12461;&#12515;&#12503;&#12481;&#12515;&#12362;&#12424;&#12403;&#12496;&#12502;&#12522;&#12531;&#12464;&#27573;&#38542;&#20197;&#22806;&#12391;&#12399;&#12289;&#12452;&#12505;&#12531;&#12488;&#12399;&#36865;&#20986;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#29694;&#22312;&#12398; SWF&#65288;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427; SWF&#65289;&#20869;&#12398;&#19981;&#26126;&#12394;&#12456;&#12521;&#12540;&#12434;&#26908;&#20986;&#12377;&#12427;&#12395;&#12399;&#12289;&#20195;&#12431;&#12426;&#12395; <code>LoaderInfo.uncaughtErrorEvents</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	 <p>Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364; AVM1&#65288;ActionScript 2&#65289;SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;AVM1 SWF &#12501;&#12449;&#12452;&#12523;&#20869;&#12398;&#12461;&#12515;&#12483;&#12481;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#12456;&#12521;&#12540;&#12391; <code>uncaughtError</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#30330;&#29983;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
	 &#13;
	 <br /><br /><span class="label"> &#23455;&#35013; </span><br /><code>&#160;&#160;&#160;&#160;public function get uncaughtErrorEvents():<a href="../../flash/events/UncaughtErrorEvents.html">UncaughtErrorEvents</a></code><br /><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/events/UncaughtErrorEvent.html" target="">UncaughtErrorEvent</a><br /><a href="LoaderInfo.html#uncaughtErrorEvents" target="">LoaderInfo.uncaughtErrorEvents</a></div><span id="pageFilter"><br /><span class="label"> &#20363; &#160;(&#13;
                <span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span>)&#13;
            </span><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;&#12525;&#12540;&#12489;&#12375;&#12383; SWF &#20869;&#12398;&#19981;&#26126;&#12394;&#12456;&#12521;&#12540;&#12434;&#26908;&#20986;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#19981;&#26126;&#12456;&#12521;&#12540;&#12452;&#12505;&#12531;&#12488;&#12495;&#12531;&#12489;&#12521;&#12540;&#12398;&#20351;&#29992;&#26041;&#27861;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;&#19981;&#26126;&#12394;&#12456;&#12521;&#12540;&#12434;&#26908;&#20986;&#12377;&#12427; <code>uncaughtError</code> &#12452;&#12505;&#12531;&#12488;&#12495;&#12531;&#12489;&#12521;&#12540;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#13;
 &#13;
 <p>&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12289;&#12467;&#12540;&#12489;&#12399; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>uncaughtErrorEvents</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#36865;&#20986;&#12375;&#12383; <code>uncaughtError</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#12522;&#12473;&#12490;&#12540;&#12434;&#30331;&#37682;&#12375;&#12414;&#12377;&#12290; </p>&#13;
 &#13;
 <p><code>uncaughtErrorHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12391;&#12289;&#12467;&#12540;&#12489;&#12399; <code>error</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12540;&#12479;&#22411;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;&#12381;&#12398;&#22411;&#12395;&#24540;&#12376;&#12383;&#24540;&#31572;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>&#13;
<div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
package&#13;
{&#13;
    import flash.display.Loader;&#13;
    import flash.display.Sprite;&#13;
    import flash.events.ErrorEvent;&#13;
    import flash.events.UncaughtErrorEvent;&#13;
    import flash.net.URLRequest;&#13;
&#13;
    public class LoaderUncaughtErrorEventExample extends Sprite&#13;
    {&#13;
        private var ldr:Loader;&#13;
        &#13;
        public function LoaderUncaughtErrorEventExample()&#13;
        {&#13;
            ldr = new Loader();&#13;
            ldr.load(new URLRequest("child.swf"));&#13;
            ldr.uncaughtErrorEvents.addEventListener(UncaughtErrorEvent.UNCAUGHT_ERROR, uncaughtErrorHandler);&#13;
        }&#13;
        &#13;
        private function uncaughtErrorHandler(event:UncaughtErrorEvent):void&#13;
        {&#13;
            if (event.error is Error)&#13;
            {&#13;
                var error:Error = event.error as Error;&#13;
                // do something with the error&#13;
            }&#13;
            else if (event.error is ErrorEvent)&#13;
            {&#13;
                var errorEvent:ErrorEvent = event.error as ErrorEvent;&#13;
                // do something with the error&#13;
            }&#13;
            else&#13;
            {&#13;
                // a non-Error, non-ErrorEvent type was thrown and uncaught&#13;
            }&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span></div></span><a name="constructorDetail" id="constructorDetail"></a><div class="detailSectionHeader">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Constructor/Loader()" class="dashAnchor" id="//apple_ref/cpp/Constructor/Loader()"></a><a name="Loader()" id="Loader()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>Loader</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;</td></tr></table><div class="detailBody"><code>public function Loader()</code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p>&#13;
     SWF&#12289;JPEG&#12289;GIF&#12289;&#12414;&#12383;&#12399; PNG &#12394;&#12393;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#35501;&#12415;&#36796;&#12415;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12450;&#12475;&#12483;&#12488;&#12434; Loader &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#23376;&#12392;&#12375;&#12390;&#35501;&#12415;&#36796;&#12416;&#12395;&#12399;&#12289;<code>load()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#24460;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#34920;&#31034;&#12522;&#12473;&#12488;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;DisplayObjectContainer &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398; <code>addChild()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#12450;&#12475;&#12483;&#12488;&#12399;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12392;&#12473;&#12486;&#12540;&#12472;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p>Loader &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434; "&#12522;&#12473;&#12488;&#22806;" &#12391;&#12289;&#12388;&#12414;&#12426;&#12289;&#34920;&#31034;&#12522;&#12473;&#12488;&#19978;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12467;&#12531;&#12486;&#12490;&#12395;&#36861;&#21152;&#12375;&#12394;&#12367;&#12390;&#12418;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12398;&#22580;&#21512;&#12289;Loader &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36861;&#21152;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; </p>&#13;
     &#13;
     <p>SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#35501;&#12415;&#36796;&#12415;&#12364;&#23436;&#20102;&#12375;&#12383;&#12371;&#12392;&#12434;&#26908;&#20986;&#12377;&#12427;&#12395;&#12399;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>contentLoaderInfo</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383; LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12452;&#12505;&#12531;&#12488;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12398;&#26178;&#28857;&#12391;&#12289;&#12514;&#12472;&#12517;&#12540;&#12523; SWF &#12501;&#12449;&#12452;&#12523;&#20869;&#12398;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12375;&#12289;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21021;&#26399;&#21270;&#12375;&#12390;&#12289;&#38283;&#22987;&#12391;&#12365;&#12414;&#12377;&#12290;&#12522;&#12473;&#12488;&#22806;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;Loader &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12414;&#12383;&#12399;&#12513;&#12487;&#12451;&#12450;&#12450;&#12475;&#12483;&#12488;&#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12418;&#12289;LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12452;&#12505;&#12531;&#12488;&#36890;&#30693;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12375;&#12383;&#12371;&#12392;&#12434;&#26908;&#20986;&#12391;&#12365;&#12414;&#12377;&#12290; &#12381;&#12398;&#26178;&#28857;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#20869;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12513;&#12487;&#12451;&#12450;&#12450;&#12475;&#12483;&#12488;&#12398;&#20351;&#29992;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12381;&#12428;&#12425;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12450;&#12475;&#12483;&#12488;&#12434;&#34920;&#12377; ActionScript 3.0 &#12463;&#12521;&#12473;&#12434;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#34892;&#12356;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12434;&#21028;&#21029;&#12377;&#12427;&#12395;&#12399;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>contentLoaderInfo</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383; LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#27425;&#12398;&#12452;&#12505;&#12531;&#12488;&#12434;&#30435;&#35222;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <ul><li><code>open</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#35501;&#12415;&#36796;&#12415;&#12364;&#38283;&#22987;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>ioError</code> &#12414;&#12383;&#12399; <code>securityError</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12417;&#12394;&#12356;&#22580;&#21512;&#12289;&#12354;&#12427;&#12356;&#12399;&#35501;&#12415;&#36796;&#12415;&#20013;&#12395;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12383;&#22580;&#21512;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; </li><li><code>progress</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;&#35501;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#38291;&#12289;&#32153;&#32154;&#30340;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</li><li><code>complete</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12371;&#12398;&#26178;&#28857;&#12391;&#12399;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12512;&#12540;&#12499;&#12540;&#12463;&#12522;&#12483;&#12503;&#12398;&#12513;&#12477;&#12483;&#12489;&#12392;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12414;&#12384;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; </li><li><code>init</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12362;&#12424;&#12403;&#12513;&#12477;&#12483;&#12489;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12289;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;&#21508;&#31278;&#12398;&#25805;&#20316;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12452;&#12505;&#12531;&#12488;&#12399;&#12289;<code>complete</code> &#12495;&#12531;&#12489;&#12521;&#12540;&#12398;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12473;&#12488;&#12522;&#12540;&#12511;&#12531;&#12464; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#21512;&#12289;<code>init</code> &#12452;&#12505;&#12531;&#12488;&#12399; <code>complete</code> &#12452;&#12505;&#12531;&#12488;&#12424;&#12426;&#12418;&#12363;&#12394;&#12426;&#21069;&#12395;&#30330;&#29983;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12289;<code>init</code> &#12495;&#12531;&#12489;&#12521;&#12540;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</li></ul><p><b>&#27880;&#24847;&#65288;iOS &#12398;&#12415;&#65289;&#65306;</b>iOS &#12391;&#12398; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12363;&#12425;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;ActionScript &#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#21046;&#32004;&#12391;&#12399;&#12289;ActionScript &#21521;&#12369;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12383;&#12463;&#12521;&#12473;&#21517;&#12434;&#21547;&#12416;&#12450;&#12475;&#12483;&#12488;&#12394;&#12393;&#12398;&#12289;&#12354;&#12425;&#12422;&#12427; ActionScript &#12364;&#23550;&#35937;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12354;&#12425;&#12422;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#35242; SWF &#12392;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390; SWF &#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>AIR 3.6 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12363;&#12425;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#32076;&#30001;&#12391;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12525;&#12540;&#12489;&#12391;&#12365;&#12427;&#12398;&#12399; ActionScript &#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12434;&#21547;&#12414;&#12394;&#12356; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12415;&#12391;&#12377;&#12290;ActionScript &#12434;&#21547;&#12416;&#22806;&#37096; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#20195;&#12431;&#12426;&#12395;&#12289;SWC &#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#20316;&#25104;&#12375;&#12289;&#12381;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#12513;&#12452;&#12531; SWF &#12395;&#12522;&#12531;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12428;&#12425;&#12398;&#21046;&#32004;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434; iOS &#12471;&#12511;&#12517;&#12524;&#12540;&#12479;&#12540;&#65288;ipa-test-interpreter-simulator &#12418;&#12375;&#12367;&#12399; ipa-debug-interpreter-simulator&#65289;&#12414;&#12383;&#12399;&#12452;&#12531;&#12479;&#12540;&#12503;&#12522;&#12479;&#12540;&#12514;&#12540;&#12489;&#65288;ipa-test-interpreter &#12418;&#12375;&#12367;&#12399; ipa-debug-interpreter&#65289;&#12391;&#23455;&#34892;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Loader.html#load()" target="">flash.display.Loader.load()</a><br /><a href="LoaderInfo.html" target="">flash.display.LoaderInfo</a></div></div></span><a name="methodDetail" id="methodDetail"></a><div class="detailSectionHeader">&#12513;&#12477;&#12483;&#12489;&#12398;&#35443;&#32048;</div><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/close()" class="dashAnchor" id="//apple_ref/cpp/Method/close()"></a><a name="close()" id="close()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>close</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td></tr></table><div class="detailBody"><code> public function close():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     Loader &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#29694;&#22312;&#36914;&#34892;&#20013;&#12398; <code>load()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#20966;&#29702;&#12434;&#12461;&#12515;&#12531;&#12475;&#12523;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Loader.html#load()" target="">flash.display.Loader.load()</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/load()" class="dashAnchor" id="//apple_ref/cpp/Method/load()"></a><a name="load()" id="load()"></a><a name="load(flash.net.URLRequest,flash.system.LoaderContext)" id="load(flash.net.URLRequest,flash.system.LoaderContext)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>load</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function load(request:<a href="../../flash/net/URLRequest.html">URLRequest</a>, context:<a href="../../flash/system/LoaderContext.html">LoaderContext</a> = null):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     SWF&#12289;JPEG&#12289;&#12503;&#12525;&#12464;&#12524;&#12483;&#12471;&#12502; JPEG&#12289;&#38750;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531; GIF&#12289;&#12414;&#12383;&#12399; PNG &#12501;&#12449;&#12452;&#12523;&#12434;&#12289;&#12371;&#12398; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#12391;&#12354;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531; GIF &#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12416;&#12392;&#12289;&#20808;&#38957;&#12398;&#12501;&#12524;&#12540;&#12512;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#23376;&#12434; 1 &#12388;&#12384;&#12369;&#12375;&#12363;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12289;&#24460;&#32154;&#12398; <code>load()</code> &#35201;&#27714;&#12434;&#30330;&#34892;&#12377;&#12427;&#12392;&#30452;&#21069;&#12398;&#35201;&#27714;&#65288;&#20445;&#30041;&#20013;&#12391;&#12354;&#12428;&#12400;&#65289;&#12434;&#32066;&#20102;&#12375;&#12289;&#26032;&#12383;&#12395;&#35501;&#12415;&#36796;&#12415;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><b>&#27880;&#24847;</b>&#65306;AIR 1.5 &#12362;&#12424;&#12403; Flash Player 10 &#12391;&#12399;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12452;&#12513;&#12540;&#12472;&#12398;&#26368;&#22823;&#12469;&#12452;&#12474;&#12399;&#24133;&#12414;&#12383;&#12399;&#39640;&#12373;&#12364; 8,191 &#12500;&#12463;&#12475;&#12523;&#12391;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#32207;&#12500;&#12463;&#12475;&#12523;&#25968;&#12364; 16,777,215 &#12500;&#12463;&#12475;&#12523;&#12434;&#36229;&#12360;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#65288;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12452;&#12513;&#12540;&#12472;&#12398;&#24133;&#12364; 8,191 &#12500;&#12463;&#12475;&#12523;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#12289;&#39640;&#12373;&#12399; 2,048 &#12500;&#12463;&#12475;&#12523;&#12414;&#12391;&#12375;&#12363;&#25351;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#65289;&#12290;Flash Player 9 &#20197;&#21069;&#12362;&#12424;&#12403; AIR 1.1 &#20197;&#21069;&#12391;&#12399;&#12289;&#39640;&#12373;&#12398;&#38480;&#30028;&#12399; 2,880 &#12500;&#12463;&#12475;&#12523;&#12391;&#24133;&#12398;&#38480;&#30028;&#12399; 2,880 &#12500;&#12463;&#12475;&#12523;&#12391;&#12377;&#12290;</p>&#13;
     &#13;
     <p>Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35501;&#12415;&#36796;&#12435;&#12384; SWF &#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12452;&#12513;&#12540;&#12472;&#12399;&#12289;&#12381;&#12398; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35242;&#12398;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20301;&#32622;&#12289;&#22238;&#36578;&#12289;&#12362;&#12424;&#12403;&#25313;&#22823; / &#32302;&#23567;&#12398;&#21508;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32153;&#25215;&#12375;&#12414;&#12377;&#12290; </p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12512;&#12540;&#12499;&#12540;&#12414;&#12383;&#12399;&#12452;&#12513;&#12540;&#12472;&#12434;&#21066;&#38500;&#12375;&#12383;&#12426;&#12289;&#36914;&#34892;&#20013;&#12398;&#35501;&#12415;&#36796;&#12415;&#20966;&#29702;&#12434;&#12461;&#12515;&#12531;&#12475;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289;<code>unload()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;SWF &#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427; HTML &#12506;&#12540;&#12472;&#12395; <code>allowNetworking</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65288;<code>object</code> &#12479;&#12464;&#12362;&#12424;&#12403; <code>embed</code> &#12479;&#12464;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#65289;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><b>iOS &#12398;&#22580;&#21512;&#12398;&#27880;&#24847;&#28857;</b></p>&#13;
     <p>iOS &#12391;&#12398; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12363;&#12425;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;ActionScript &#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#21046;&#32004;&#12391;&#12399;&#12289;ActionScript &#21521;&#12369;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12383;&#12463;&#12521;&#12473;&#21517;&#12434;&#21547;&#12416;&#12450;&#12475;&#12483;&#12488;&#12394;&#12393;&#12398;&#12289;&#12354;&#12425;&#12422;&#12427; ActionScript &#12364;&#23550;&#35937;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12354;&#12425;&#12422;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#20197;&#19979;&#12398;&#20363;&#12398;&#12424;&#12358;&#12395;&#12289;&#35242; SWF &#12392;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390; SWF &#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
     var loader:Loader = new Loader();&#13;
     var url:URLRequest = new URLRequest("swfs/SecondarySwf.swf");&#13;
     var loaderContext:LoaderContext = new LoaderContext(false, ApplicationDomain.currentDomain, null);&#13;
     loader.load(url, loaderContext);</pre></div>&#13;
     &#13;
     <p>&#12414;&#12383;&#12289;iOS &#12391;&#12399;&#12289;ActionScript &#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#65288;ABC&#65289;&#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12390;&#12363;&#12425;&#12450;&#12531;&#12525;&#12540;&#12489;&#12375;&#12289;&#20877;&#24230;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12434;&#34892;&#12362;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12456;&#12521;&#12540; 3764 &#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>AIR 3.6 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12363;&#12425;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#32076;&#30001;&#12391;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12525;&#12540;&#12489;&#12391;&#12365;&#12427;&#12398;&#12399; ActionScript &#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12434;&#21547;&#12414;&#12394;&#12356; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12415;&#12391;&#12377;&#12290;ActionScript &#12434;&#21547;&#12416;&#22806;&#37096; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#20195;&#12431;&#12426;&#12395;&#12289;SWC &#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#20316;&#25104;&#12375;&#12289;&#12381;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#12513;&#12452;&#12531; SWF &#12395;&#12522;&#12531;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12428;&#12425;&#12398;&#21046;&#32004;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434; iOS &#12471;&#12511;&#12517;&#12524;&#12540;&#12479;&#12540;&#65288;ipa-test-interpreter-simulator &#12418;&#12375;&#12367;&#12399; ipa-debug-interpreter-simulator&#65289;&#12414;&#12383;&#12399;&#12452;&#12531;&#12479;&#12540;&#12503;&#12522;&#12479;&#12540;&#12514;&#12540;&#12489;&#65288;ipa-test-interpreter &#12418;&#12375;&#12367;&#12399; ipa-debug-interpreter&#65289;&#12391;&#23455;&#34892;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p><b>Loader &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</b></p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;Loader &#12463;&#12521;&#12473;&#12398;&#35500;&#26126;&#12395;&#12354;&#12427; Flash Player &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12514;&#12487;&#12523;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>&#13;
     &#13;
     <p> Flash Player 10 &#20197;&#38477;&#12391;&#12399;&#12289;"multipart/form-data" &#12394;&#12393;&#12398;&#12510;&#12523;&#12481;&#12497;&#12540;&#12488; Content-Type &#12395;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12392;&#65288;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399; POST &#12508;&#12487;&#12451;&#20869;&#12398; "content-disposition" &#12504;&#12483;&#12480;&#12540;&#12398; "filename" &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12391;&#31034;&#12373;&#12428;&#12414;&#12377;&#65289;&#12289;&#12381;&#12398;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35215;&#21063;&#12395;&#12424;&#12387;&#12390; POST &#20966;&#29702;&#12364;&#25304;&#26463;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     <ul><li>POST &#20966;&#29702;&#12399;&#12289;&#12510;&#12454;&#12473;&#12398;&#12463;&#12522;&#12483;&#12463;&#12420;&#12461;&#12540;&#12398;&#25276;&#19979;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#38283;&#22987;&#12375;&#12383;&#12450;&#12463;&#12471;&#12519;&#12531;&#12395;&#24540;&#31572;&#12375;&#12390;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</li><li>POST &#20966;&#29702;&#12364;&#12463;&#12525;&#12473;&#12489;&#12513;&#12452;&#12531;&#12391;&#12354;&#12427;&#65288;POST &#12479;&#12540;&#12466;&#12483;&#12488;&#12364;&#12289;POST &#35201;&#27714;&#12434;&#36865;&#20449;&#20013;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12392;&#21516;&#12376;&#12469;&#12540;&#12496;&#12540;&#19978;&#12395;&#12394;&#12356;&#65289;&#22580;&#21512;&#12399;&#12289;&#12463;&#12525;&#12473;&#12489;&#12513;&#12452;&#12531;&#12450;&#12463;&#12475;&#12473;&#12434;&#35377;&#21487;&#12377;&#12427; URL &#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#12479;&#12540;&#12466;&#12483;&#12488;&#12469;&#12540;&#12496;&#12540;&#12364;&#25552;&#20379;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</li></ul><p>&#12414;&#12383;&#12289;&#12377;&#12409;&#12390;&#12398;&#12510;&#12523;&#12481;&#12497;&#12540;&#12488; Content-Type &#12391;&#12399;&#12289;RFC2046 &#27161;&#28310;&#12395;&#28310;&#25312;&#12375;&#12383;&#26377;&#21177;&#12394;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12364;&#26377;&#21177;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35215;&#21063;&#12395;&#12424;&#12387;&#12390; POST &#20966;&#29702;&#12364;&#25304;&#26463;&#12373;&#12428;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">request</span>:<a href="../../flash/net/URLRequest.html">URLRequest</a></code> &#8212;  &#35501;&#12415;&#36796;&#12416; SWF&#12289;JPEG&#12289;GIF&#12289;&#12414;&#12383;&#12399; PNG &#12501;&#12449;&#12452;&#12523;&#12398;&#32118;&#23550; URL &#12414;&#12383;&#12399;&#30456;&#23550; URL &#12391;&#12377;&#12290;&#30456;&#23550;&#12497;&#12473;&#12398;&#22580;&#21512;&#12399;&#12289;&#12513;&#12452;&#12531; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#22522;&#28310;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#32118;&#23550; URL &#12398;&#22580;&#21512;&#12399;&#12289;http:// &#12420; file:/// &#12394;&#12393;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#21442;&#29031;&#12418;&#21547;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12501;&#12449;&#12452;&#12523;&#21517;&#12395;&#12399;&#12289;&#12489;&#12521;&#12452;&#12502;&#25351;&#23450;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">context</span>:<a href="../../flash/system/LoaderContext.html">LoaderContext</a></code> (default = <code>null</code>)<code></code> &#8212; &#27425;&#12398;&#23450;&#32681;&#12434;&#34892;&#12358;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12354;&#12427;&#12289;LoaderContext &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#13;
     &#13;
     <ul><li>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;&#26178;&#12395;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12398;&#23384;&#22312;&#12434;&#30906;&#35469;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;</li><li>&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; ApplicationDomain</li><li>&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; SecurityDomain</li><li>&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12452;&#12513;&#12540;&#12472;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; ImageDecodingPolicy</li></ul><p><code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12414;&#12383;&#12399; null &#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12399;&#12381;&#12428;&#33258;&#36523;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12489;&#12513;&#12452;&#12531;&#12395;&#32622;&#12363;&#12428;&#12383;&#12414;&#12414;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><b>iOS &#12398;&#12415;</b>&#65306;AIR for iOS &#12391; <code>load()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12377;&#22580;&#21512;&#12399;&#12289;LoaderContext &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12513;&#12452;&#12531;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65288;<code>ApplicationDomain.currentDomain</code>&#65289;&#12290;</p>&#13;
     &#13;
     <p>&#23436;&#20840;&#12394;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="../system/LoaderContext.html">LoaderContext</a> &#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35500;&#26126;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#12452;&#12505;&#12531;&#12488;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><b>asyncError</b>:<a href="../../flash/events/AsyncErrorEvent.html"><code>AsyncErrorEvent</code></a></code> &#8212; <code>LoaderContext.requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12363;&#12388;&#25351;&#23450;&#12373;&#12428;&#12383; DisplayObjectContainer &#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#23376;&#12392;&#12375;&#12390;&#36861;&#21152;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289; <code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364; <code>flash.display.AVM1Movie</code> &#12391;&#12354;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399; <code>addChild()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12364;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12383;&#22580;&#21512;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>complete</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395; <code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>complete</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#24120;&#12395;&#12289;<code>init</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>httpStatus</b>:<a href="../../flash/events/HTTPStatusEvent.html"><code>HTTPStatusEvent</code></a></code> &#8212; &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#35201;&#27714;&#12364; HTTP &#19978;&#12391;&#34892;&#12431;&#12428;&#12289;Flash Player &#12364; HTTP &#12473;&#12486;&#12540;&#12479;&#12473;&#12467;&#12540;&#12489;&#12434;&#26908;&#20986;&#12391;&#12365;&#12427;&#22580;&#21512;&#12395; <code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>init</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12362;&#12424;&#12403;&#12513;&#12477;&#12483;&#12489;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#22580;&#21512;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>init</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#24120;&#12395;&#12289;<code>complete</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>ioError</b>:<a href="../../flash/events/IOErrorEvent.html"><code>IOErrorEvent</code></a></code> &#8212; &#20837;&#20986;&#21147;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12390;&#12525;&#12540;&#12489;&#20966;&#29702;&#12364;&#22833;&#25943;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>open</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12525;&#12540;&#12489;&#20966;&#29702;&#12364;&#38283;&#22987;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>progress</b>:<a href="../../flash/events/ProgressEvent.html"><code>ProgressEvent</code></a></code> &#8212; &#12525;&#12540;&#12489;&#20966;&#29702;&#12434;&#23455;&#34892;&#20013;&#12395;&#12487;&#12540;&#12479;&#12434;&#21463;&#20449;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>securityError</b>:<a href="../../flash/events/SecurityErrorEvent.html"><code>SecurityErrorEvent</code></a></code> &#8212; &#12525;&#12540;&#12459;&#12523;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20869;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#25509;&#32154;&#12375;&#12383;&#12525;&#12540;&#12459;&#12523;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20869;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12363;&#12289;&#12414;&#12383;&#12399;&#12381;&#12398;&#36870;&#12398;&#22580;&#21512;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>securityError</b>:<a href="../../flash/events/SecurityErrorEvent.html"><code>SecurityErrorEvent</code></a></code> &#8212; <code>LoaderContext.requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;<code>LoaderContext.requestedContentParent</code> &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427; SWF &#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#25345;&#12383;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>unload</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/errors/IOError.html">IOError</a> </code> &#8212; <code>request</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>digest</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>null</code> &#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;URLRequest &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>digest</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;<code>URLLoader.load()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12390; SWZ &#12501;&#12449;&#12452;&#12523;&#65288;Adobe &#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#65289;&#12434;&#35501;&#12415;&#36796;&#12416;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; <code>LoaderContext.securityDomain</code> &#12398;&#20516;&#12399;&#12289;<code>null</code> &#12414;&#12383;&#12399; <code>SecurityDomain.currentDomain</code> &#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12513;&#12487;&#12451;&#12450;&#12399;&#12289;&#36890;&#24120;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12414;&#12383;&#12399;&#29420;&#33258;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12375;&#12363;&#37197;&#32622;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#24460;&#32773;&#12398;&#22580;&#21512;&#12399;&#12289;&#12509;&#12522;&#12471;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#12525;&#12540;&#12459;&#12523; SWF &#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#12289;<code>LoaderContext.securityDomain</code> &#12395; <code>null</code> &#20197;&#22806;&#12398;&#20516;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;&#12525;&#12540;&#12459;&#12523;&#12391;&#12394;&#12356;&#12513;&#12487;&#12451;&#12450;&#12398;&#12525;&#12540;&#12459;&#12523;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12408;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12289;&#12362;&#12424;&#12403;&#12525;&#12540;&#12459;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#36890;&#24120;&#12398;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#20197;&#22806;&#12398;&#22580;&#25152;&#12408;&#12398;&#37197;&#32622;&#12399;&#35377;&#21487;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#13;
     &#13;
      </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212;  &#19968;&#33324;&#30340;&#12394;&#20104;&#32004;&#12509;&#12540;&#12488;&#12395;&#12399;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#36974;&#26029;&#12373;&#12428;&#12383;&#12509;&#12540;&#12488;&#12398;&#35443;&#12375;&#12356;&#12522;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12302;ActionScript 3.0 &#38283;&#30330;&#12460;&#12452;&#12489;<i></i>&#12303;&#12398;&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463; API &#12398;&#21046;&#38480;&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; <code>applicationDomain</code> &#12414;&#12383;&#12399; <code>securityDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;&#12364;&#12289;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12489;&#12513;&#12452;&#12531;&#12398;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#12525;&#12540;&#12459;&#12523; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12289;<code>securityDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;&#12434;&#20351;&#29992;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#22580;&#21512;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; <code>requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;&#12364; <code>Loader</code> &#12398;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; <code>LoaderContext.parameters</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; null &#20197;&#22806;&#12391;&#12289;Strings &#22411;&#20197;&#22806;&#12398;&#20516;&#12434;&#25345;&#12388;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; iOS &#12391;&#12289;&#12513;&#12452;&#12531;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#20197;&#22806;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12391; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; iOS &#12391;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12450;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12392;&#12289;ABC &#12467;&#12540;&#12489;&#12434;&#21547;&#12416; SWF &#12434;&#12522;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../Error.html">Error</a> </code> &#8212; iOS &#12391;&#12289;ActionScript &#12467;&#12540;&#12489;&#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12398;&#22806;&#37096;&#12363;&#12425;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#22580;&#21512;&#12290;&#12371;&#12398;&#12456;&#12521;&#12540;&#12399;&#12461;&#12515;&#12483;&#12481;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12456;&#12521;&#12540;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#30011;&#38754;&#19978;&#12395;&#12300;ActionScript &#12364;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12301;&#12392;&#12356;&#12358;&#12479;&#12452;&#12488;&#12523;&#12398;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;AIR 3.6 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12371;&#12398;&#12456;&#12521;&#12540;&#12399; ActionScript &#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#65288;SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#22806;&#37096;&#12395;&#12354;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12391;&#12418;&#30330;&#29983;&#65289;&#12290;&#13;
     &#13;
     </td></tr></table><p id="moreExamples"><span class="label">&#12373;&#12425;&#12395;&#20363;&#12434;&#21442;&#29031;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e13.html" target="_blank">&#34920;&#31034;&#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#21205;&#30340;&#12525;&#12540;&#12489;</a></div><p id="learnMore"><span class="label">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7de0.html" target="_blank">&#12525;&#12540;&#12489;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#25351;&#23450;</a><br /></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Loader.html#contentLoaderInfo" target="">contentLoaderInfo</a><br /><a href="../../flash/net/URLRequest.html" target="">flash.net.URLRequest</a><br /><a href="DisplayObject.html" target="">flash.display.DisplayObject</a><br /><a href="Loader.html#unload()" target="">flash.display.Loader.unload()</a><br /><a href="LoaderInfo.html" target="">flash.display.LoaderInfo</a><br /><a href="../../flash/system/LoaderContext.html" target="">flash.system.LoaderContext</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/loadBytes()" class="dashAnchor" id="//apple_ref/cpp/Method/loadBytes()"></a><a name="loadBytes()" id="loadBytes()"></a><a name="loadBytes(flash.utils.ByteArray,flash.system.LoaderContext)" id="loadBytes(flash.utils.ByteArray,flash.system.LoaderContext)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>loadBytes</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function loadBytes(bytes:<a href="../../flash/utils/ByteArray.html">ByteArray</a>, context:<a href="../../flash/system/LoaderContext.html">LoaderContext</a> = null):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     ByteArray &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#20445;&#31649;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12452;&#12490;&#12522;&#12487;&#12540;&#12479;&#12363;&#12425;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><code>loadBytes()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#38750;&#21516;&#26399;&#12398;&#12513;&#12477;&#12483;&#12489;&#12391;&#12377;&#12290;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#21069;&#12395;&#12300;init&#12301;&#12452;&#12505;&#12531;&#12488;&#12434;&#24453;&#27231;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;Loader &#12463;&#12521;&#12473;&#12398;&#35500;&#26126;&#12395;&#12354;&#12427; Flash Player &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12514;&#12487;&#12523;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>&#13;
     &#13;
     &#13;
     <p><b>&#27880;&#24847;&#65288;iOS &#12398;&#12415;&#65289;&#65306;</b>iOS &#12391;&#12398; AIR &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12363;&#12425;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;ActionScript &#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#21046;&#32004;&#12391;&#12399;&#12289;ActionScript &#21521;&#12369;&#12395;&#26360;&#12365;&#20986;&#12373;&#12428;&#12383;&#12463;&#12521;&#12473;&#21517;&#12434;&#21547;&#12416;&#12450;&#12475;&#12483;&#12488;&#12394;&#12393;&#12398;&#12289;&#12354;&#12425;&#12422;&#12427; ActionScript &#12364;&#23550;&#35937;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12354;&#12425;&#12422;&#12427; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#35242; SWF &#12392;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390; SWF &#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>AIR 3.6 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;iOS &#12391;&#12399;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21177;&#26524;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">bytes</span>:<a href="../../flash/utils/ByteArray.html">ByteArray</a></code> &#8212; ByteArray &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;ByteArray &#12398;&#20869;&#23481;&#12392;&#12375;&#12390;&#12399;&#12289;Loader &#12463;&#12521;&#12473;&#12364;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427; SWF&#12289;GIF&#12289;JPEG&#12289;PNG &#12398;&#12358;&#12385;&#12398;&#20219;&#24847;&#12398;&#12501;&#12449;&#12452;&#12523;&#24418;&#24335;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">context</span>:<a href="../../flash/system/LoaderContext.html">LoaderContext</a></code> (default = <code>null</code>)<code></code> &#8212; LoaderContext &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;LoaderContext &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>applicationDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12415;&#12364;&#36969;&#29992;&#12373;&#12428;&#12289;LoaderContext &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>checkPolicyFile</code> &#12362;&#12424;&#12403; <code>securityDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#13;
     &#13;
     <p><code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12414;&#12383;&#12399; null &#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12399;&#29694;&#22312;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12489;&#12513;&#12452;&#12531;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;Flash Player &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#35500;&#26126;&#12391;&#12399;&#12289;&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12434;&#12300;&#35501;&#12415;&#36796;&#12415;&#12525;&#12540;&#12489;&#12301;&#12392;&#21628;&#12403;&#12414;&#12377;&#12290;&#20855;&#20307;&#30340;&#12395;&#12399;&#12289;&#12525;&#12540;&#12489;&#12377;&#12427;&#20596;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12289;&#12467;&#12540;&#12489;&#12395;&#12522;&#12514;&#12540;&#12488; SWF &#12434;&#32068;&#12415;&#36796;&#12416;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12522;&#12514;&#12540;&#12488; SWF &#12434;&#26126;&#31034;&#30340;&#12395;&#20449;&#38972;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12428;&#33258;&#36523;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12489;&#12513;&#12452;&#12531;&#12395;&#30452;&#25509;&#12522;&#12514;&#12540;&#12488; SWF &#12434;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#12452;&#12505;&#12531;&#12488;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><b>asyncError</b>:<a href="../../flash/events/AsyncErrorEvent.html"><code>AsyncErrorEvent</code></a></code> &#8212; <code>LoaderContext.requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12363;&#12388;&#25351;&#23450;&#12373;&#12428;&#12383; DisplayObjectContainer &#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#23376;&#12392;&#12375;&#12390;&#36861;&#21152;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289; <code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364; <code>flash.display.AVM1Movie</code> &#12391;&#12354;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399; <code>addChild()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12364;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12383;&#22580;&#21512;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>complete</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#25805;&#20316;&#12364;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>complete</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#24120;&#12395;&#12289;<code>init</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>init</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12362;&#12424;&#12403;&#12513;&#12477;&#12483;&#12489;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#22580;&#21512;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>init</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#24120;&#12395;&#12289;<code>complete</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>ioError</b>:<a href="../../flash/events/IOErrorEvent.html"><code>IOErrorEvent</code></a></code> &#8212; &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12496;&#12452;&#12488;&#37197;&#21015;&#20869;&#12398;&#12487;&#12540;&#12479;&#12434;&#35299;&#26512;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>open</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#25805;&#20316;&#12364;&#38283;&#22987;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>progress</b>:<a href="../../flash/events/ProgressEvent.html"><code>ProgressEvent</code></a></code> &#8212; &#12487;&#12540;&#12479;&#12364;&#12513;&#12514;&#12522;&#12395;&#36578;&#36865;&#12373;&#12428;&#12427;&#12392;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>securityError</b>:<a href="../../flash/events/SecurityErrorEvent.html"><code>SecurityErrorEvent</code></a></code> &#8212; <code>LoaderContext.requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;<code>LoaderContext.requestedContentParent</code> &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427; SWF &#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#25345;&#12383;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>unload</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; ByteArray &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>length</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; 0 &#20197;&#19979;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; <code>checkPolicyFile</code> &#12414;&#12383;&#12399; <code>securityDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;&#12364; null &#20197;&#22806;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; <code>requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;&#12364; <code>Loader</code> &#12398;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; <code>LoaderContext.parameters</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; null &#20197;&#22806;&#12391;&#12289;Strings &#22411;&#20197;&#22806;&#12398;&#20516;&#12434;&#25345;&#12388;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; iOS &#12391;&#12289;&#12513;&#12452;&#12531;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#20197;&#22806;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12391; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; iOS &#12391;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12450;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12289;ABC &#12467;&#12540;&#12489;&#12434;&#21547;&#12416; SWF &#12434;&#12522;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../Error.html">Error</a> </code> &#8212; iOS &#12391;&#12289;ActionScript &#12467;&#12540;&#12489;&#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#12398;&#22806;&#37096;&#12363;&#12425;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#22580;&#21512;&#12290;&#12371;&#12398;&#12456;&#12521;&#12540;&#12399;&#12461;&#12515;&#12483;&#12481;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12456;&#12521;&#12540;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#30011;&#38754;&#19978;&#12395;&#12300;ActionScript &#12364;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12301;&#12392;&#12356;&#12358;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21547;&#12416;&#12480;&#12452;&#12450;&#12525;&#12464;&#12508;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;AIR 3.6 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12371;&#12398;&#12456;&#12521;&#12540;&#12399; ActionScript &#12434;&#21547;&#12416; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#65288;SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#22806;&#37096;&#12395;&#12354;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12391;&#12418;&#30330;&#29983;&#65289;&#12290;&#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; <code>applicationDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;&#21463;&#12369;&#21462;&#12387;&#12383; <code>context</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;&#12364;&#12289;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12489;&#12513;&#12452;&#12531;&#12398;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#13;
     &#13;
      </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../SecurityError.html">SecurityError</a> </code> &#8212; &#19968;&#33324;&#30340;&#12394;&#20104;&#32004;&#12509;&#12540;&#12488;&#12395;&#12399;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#36974;&#26029;&#12373;&#12428;&#12383;&#12509;&#12540;&#12488;&#12398;&#35443;&#12375;&#12356;&#12522;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12302;ActionScript 3.0 &#38283;&#30330;&#12460;&#12452;&#12489;<i></i>&#12303;&#12398;&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463; API &#12398;&#21046;&#38480;&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#13;
     &#13;
     </td></tr></table><p id="learnMore"><span class="label">&#35443;&#32048;</span></p><div class="seeAlso"><a href="http://help.adobe.com/ja_JP/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e13.html" target="_blank">&#34920;&#31034;&#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#21205;&#30340;&#12525;&#12540;&#12489;</a><br /></div><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/utils/ByteArray.html" target="">flash.utils.ByteArray</a><br /><a href="../../flash/system/LoaderContext.html#applicationDomain" target="">flash.system.LoaderContext.applicationDomain</a></div></div></span><span id="pageFilter" runtime="AIR::2.5##"><a name="//apple_ref/cpp/Method/loadFilePromise()" class="dashAnchor" id="//apple_ref/cpp/Method/loadFilePromise()"></a><a name="loadFilePromise()" id="loadFilePromise()"></a><a name="loadFilePromise(flash.desktop.IFilePromise,flash.system.LoaderContext)" id="loadFilePromise(flash.desktop.IFilePromise,flash.system.LoaderContext)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3><span class="sprite AirIcon12x12" alt="AIR-only" title="AIR &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12398;&#12415;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;">&#160;&#160;&#160;</span>&#160;loadFilePromise</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function loadFilePromise(promise:<a href="../../flash/desktop/IFilePromise.html">IFilePromise</a>, context:<a href="../../flash/system/LoaderContext.html">LoaderContext</a> = null):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 2.5</td></tr></table><p></p><p></p><p>&#13;
	 IFilePromise &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#13;
	 &#13;
 	 </p><p><code>loadFilePromise</code> &#12513;&#12477;&#12483;&#12489;&#12399; <code>IFilePromise</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#29992;&#12375;&#12289;&#12496;&#12452;&#12490;&#12522;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#12290;&#12499;&#12487;&#12458;&#12394;&#12393;&#12289;&#12487;&#12540;&#12479;&#12364;&#12503;&#12525;&#12464;&#12524;&#12483;&#12471;&#12502;&#12473;&#12488;&#12522;&#12540;&#12512;&#12398;&#22580;&#21512;&#12289;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#21069;&#12395;&#12289;"init" &#12414;&#12383;&#12399; progress &#12452;&#12505;&#12531;&#12488;&#12434;&#24453;&#12385;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;&#12487;&#12540;&#12479;&#12364;&#23436;&#20840;&#12395;&#35501;&#12415;&#36796;&#12414;&#12428;&#12383;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427; complete &#12452;&#12505;&#12531;&#12488;&#12434;&#24453;&#12385;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	 <p>&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;Loader &#12463;&#12521;&#12473;&#12398;&#35500;&#26126;&#12395;&#12354;&#12427; Flash Player &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12514;&#12487;&#12523;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>&#13;
	 &#13;
	 <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">promise</span>:<a href="../../flash/desktop/IFilePromise.html">IFilePromise</a></code> &#8212; IFilePromise &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#12399;&#12289;Loader &#12463;&#12521;&#12473;&#12364;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427; SWF&#12289;GIF&#12289;JPEG&#12289;PNG &#12398;&#12358;&#12385;&#12398;&#20219;&#24847;&#12398;&#12501;&#12449;&#12452;&#12523;&#24418;&#24335;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#13;
	 &#13;
	 </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><span class="label">context</span>:<a href="../../flash/system/LoaderContext.html">LoaderContext</a></code> (default = <code>null</code>)<code></code> &#8212; LoaderContext &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;LoaderContext &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>applicationDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12415;&#12364;&#36969;&#29992;&#12373;&#12428;&#12289;LoaderContext &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>checkPolicyFile</code> &#12362;&#12424;&#12403; <code>securityDomain</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#13;
	 &#13;
	 <p><code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12414;&#12383;&#12399; null &#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12399;&#29694;&#22312;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12489;&#12513;&#12452;&#12531;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;Flash Player &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#35500;&#26126;&#12391;&#12399;&#12289;&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12434;&#12300;&#35501;&#12415;&#36796;&#12415;&#12525;&#12540;&#12489;&#12301;&#12392;&#21628;&#12403;&#12414;&#12377;&#12290;&#20855;&#20307;&#30340;&#12395;&#12399;&#12289;&#12525;&#12540;&#12489;&#12377;&#12427;&#20596;&#12398; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#12289;&#12467;&#12540;&#12489;&#12395;&#12522;&#12514;&#12540;&#12488; SWF &#12434;&#32068;&#12415;&#36796;&#12416;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12522;&#12514;&#12540;&#12488; SWF &#12434;&#26126;&#31034;&#30340;&#12395;&#20449;&#38972;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12428;&#33258;&#36523;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12489;&#12513;&#12452;&#12531;&#12395;&#30452;&#25509;&#12522;&#12514;&#12540;&#12488; SWF &#12434;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
	 &#13;
	 <p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;Flash Player &#12487;&#12505;&#12525;&#12483;&#12497;&#12540;&#12475;&#12531;&#12479;&#12540;&#12398;&#12488;&#12500;&#12483;&#12463;&#65306;<a href="http://www.adobe.com/go/devnet_security_jp" target="external">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
	 &#13;
	 </td></tr></table><br /><span class="label">&#12452;&#12505;&#12531;&#12488;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><b>asyncError</b>:<a href="../../flash/events/AsyncErrorEvent.html"><code>AsyncErrorEvent</code></a></code> &#8212; <code>LoaderContext.requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12363;&#12388;&#25351;&#23450;&#12373;&#12428;&#12383; DisplayObjectContainer &#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#23376;&#12392;&#12375;&#12390;&#36861;&#21152;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289; <code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364; <code>flash.display.AVM1Movie</code> &#12391;&#12354;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399; <code>addChild()</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12364;&#12456;&#12521;&#12540;&#12434;&#12473;&#12525;&#12540;&#12375;&#12383;&#22580;&#21512;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>complete</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#25805;&#20316;&#12364;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>complete</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#24120;&#12395;&#12289;<code>init</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#24460;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>init</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12362;&#12424;&#12403;&#12513;&#12477;&#12483;&#12489;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#22580;&#21512;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;<code>init</code> &#12452;&#12505;&#12531;&#12488;&#12399;&#12289;&#24120;&#12395;&#12289;<code>complete</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#21069;&#12395;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>ioError</b>:<a href="../../flash/events/IOErrorEvent.html"><code>IOErrorEvent</code></a></code> &#8212; &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12398;&#12487;&#12540;&#12479;&#12434;&#35299;&#26512;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;&#12414;&#12383;&#12399;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12473;&#12488;&#12522;&#12540;&#12512;&#12364;&#35501;&#12415;&#21462;&#12426;&#19981;&#21487;&#33021;&#12394;&#22580;&#21512;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>open</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#25805;&#20316;&#12364;&#38283;&#22987;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>progress</b>:<a href="../../flash/events/ProgressEvent.html"><code>ProgressEvent</code></a></code> &#8212; &#12487;&#12540;&#12479;&#12364;&#12513;&#12514;&#12522;&#12395;&#36578;&#36865;&#12373;&#12428;&#12427;&#12392;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>securityError</b>:<a href="../../flash/events/SecurityErrorEvent.html"><code>SecurityErrorEvent</code></a></code> &#8212; <code>LoaderContext.requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;<code>LoaderContext.requestedContentParent</code> &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427; SWF &#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#25345;&#12383;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290; &#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20px"></td><td><code><b>unload</b>:<a href="../../flash/events/Event.html"><code>Event</code></a></code> &#8212; &#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;<code>contentLoaderInfo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><br /><span class="label">&#20363;&#22806;</span><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; <code>requestedContentParent</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#65288;<code>context</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#65289;&#12364; <code>Loader</code> &#12398;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../flash/errors/IllegalOperationError.html">IllegalOperationError</a> </code> &#8212; <code>LoaderContext.parameters</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364; null &#20197;&#22806;&#12391;&#12289;Strings &#22411;&#20197;&#22806;&#12398;&#20516;&#12434;&#25345;&#12388;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr><tr><td class="paramSpacer">&#160;</td></tr><tr><td width="20"></td><td><code><a href="../../ArgumentError.html">ArgumentError</a> </code> &#8212; &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12392;&#12375;&#12390;&#28193;&#12373;&#12428;&#12383; <code>IFilePromise</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; null &#12398;&#22580;&#21512;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="../../flash/media/MediaPromise.html" target="">MediaPromise</a><br /><a href="../../flash/media/CameraRoll.html#browseForImage()" target="">CameraRoll.browseForImage()</a><br /><a href="../../flash/media/CameraUI.html" target="">CameraUI</a></div></div></span><span id="pageFilter" runtime="Flash::9##Lite::4##"><a name="//apple_ref/cpp/Method/unload()" class="dashAnchor" id="//apple_ref/cpp/Method/unload()"></a><a name="unload()" id="unload()"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>unload</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function unload():<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>AIR 1.0, Flash Player 9, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     <code>load()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12289;&#12371;&#12398; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#38306;&#36899;&#12375;&#12383; LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>property</code> &#12399; <code>null</code> &#12395;&#12522;&#12475;&#12483;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#20182;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21442;&#29031;&#12375;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;&#23376;&#12399;&#24517;&#12378;&#12375;&#12418;&#30772;&#26820;&#12373;&#12428;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23376;&#12391;&#12399;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><p><code>unload()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>contentLoaderInfo</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>null</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;SWF &#12392;&#19968;&#32210;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#35222;&#35226;&#30340;&#12450;&#12475;&#12483;&#12488;&#12364;&#12450;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12289;&#12513;&#12514;&#12522;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#20869;&#12398; ActionScript &#12463;&#12521;&#12473;&#23450;&#32681;&#12399;&#12513;&#12514;&#12522;&#20869;&#12395;&#27531;&#12373;&#12428;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12392;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398;&#12467;&#12540;&#12489;&#12391;&#12371;&#12428;&#12425;&#12398;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><b>&#27880;&#24847;&#65288;iOS &#12398;&#12415;&#65289;</b>&#65306;AIR 3.6 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;iOS &#12391;&#12399;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21177;&#26524;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p>&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#35299;&#25918;&#12377;&#12427;&#21069;&#12395;&#12289;LocalConnection&#12289;NetConnection&#12289;NetStream&#12289;Sound &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12394;&#12393;&#12289;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#12377;&#12409;&#12390;&#26126;&#31034;&#30340;&#12395;&#38281;&#12376;&#12390;&#12362;&#12367;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;&#12381;&#12358;&#12375;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12364;&#35299;&#25918;&#12373;&#12428;&#12383;&#24460;&#12418;&#12289;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12458;&#12540;&#12487;&#12451;&#12458;&#12398;&#20877;&#29983;&#12364;&#32154;&#12367;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12473;&#12488;&#12522;&#12540;&#12512;&#12434;&#38281;&#12376;&#12427;&#12395;&#12399;&#12289;<code>unload</code> &#12452;&#12505;&#12531;&#12488;&#12434;&#21463;&#12369;&#21462;&#12427;&#23376;&#12395;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#35242;&#12364; <code>Loader.unload()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;<code>unload</code> &#12452;&#12505;&#12531;&#12488;&#12364;&#23376;&#12395;&#23550;&#12375;&#12390;&#36865;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#27425;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#20966;&#29702;&#12434;&#34892;&#12358;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>&#13;
<pre>&#13;
function closeAllStreams(evt:Event) { &#13;
    myNetStream.close();&#13;
    mySound.close();&#13;
    myNetConnection.close();&#13;
    myLocalConnection.close();&#13;
}&#13;
&#13;
myMovieClip.loaderInfo.addEventListener(Event.UNLOAD, closeAllStreams);</pre>&#13;
     &#13;
     <p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="Loader.html#load()" target="">Loader.load()</a><br /><a href="../../flash/media/Sound.html#close()" target="">flash.media.Sound.close()</a><br /><a href="../../flash/net/LocalConnection.html#close()" target="">flash.net.LocalConnection.close()</a><br /><a href="../../flash/net/NetConnection.html#close()" target="">flash.net.NetConnection.close()</a><br /><a href="../../flash/net/NetStream.html#close()" target="">flash.net.NetStream.close()</a><br /><a href="../../operators.html#delete" target="">delete &#28436;&#31639;&#23376;</a></div></div></span><span id="pageFilter" runtime="Flash::10##AIR::1.5##Lite::4##"><a name="//apple_ref/cpp/Method/unloadAndStop()" class="dashAnchor" id="//apple_ref/cpp/Method/unloadAndStop()"></a><a name="unloadAndStop()" id="unloadAndStop()"></a><a name="unloadAndStop(Boolean)" id="unloadAndStop(Boolean)"></a><table class="detailHeader" cellpadding="0" cellspacing="0"><tr><td class="detailHeaderName"><h3>unloadAndStop</h3></td><td class="detailHeaderParens">()</td><td class="detailHeaderType">&#12513;&#12477;&#12483;&#12489;</td><td class="detailHeaderRule">&#160;</td></tr></table><div class="detailBody"><code> public function unloadAndStop(gc:<a href="../../Boolean.html">Boolean</a> = true):<a href="../../specialTypes.html#void">void</a></code><p></p><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#35328;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>ActionScript 3.0</td></tr></table><table cellpadding="0" cellspacing="0" border="0"><tr><td style="white-space:nowrap" valign="top"><b>&#12521;&#12531;&#12479;&#12452;&#12512;&#12496;&#12540;&#12472;&#12519;&#12531;:&#160;</b></td><td>Flash Player 10, AIR 1.5, Flash Lite 4</td></tr></table><p></p><p></p><p>&#13;
     &#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12398;&#12450;&#12531;&#12525;&#12540;&#12489;&#12434;&#35430;&#12415;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12467;&#12510;&#12531;&#12489;&#12398;&#23455;&#34892;&#12434;&#20013;&#27490;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;<code>Loader.load()</code> &#12414;&#12383;&#12399; <code>Loader.loadBytes()</code> &#12434;&#20351;&#29992;&#12375;&#12390;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12450;&#12531;&#12525;&#12540;&#12489;&#12434;&#35430;&#12415;&#12414;&#12377;&#12290;&#12371;&#12398;&#12383;&#12417;&#12395;&#12289;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398; EventDispatcher&#12289;NetConnection&#12289;Timer&#12289;Sound&#12289;&#12414;&#12383;&#12399; Video &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#32080;&#26524;&#12289;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12362;&#12424;&#12403;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#34920;&#31034;&#12522;&#12473;&#12488;&#12391;&#20197;&#19979;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#13;
     &#13;
     </p><ul><li>&#12469;&#12454;&#12531;&#12489;&#12364;&#20572;&#27490;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>Stage &#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>enterFrame</code>&#12289;<code>frameConstructed</code>&#12289;<code>exitFrame</code>&#12289;<code>activate</code>&#12289;&#12362;&#12424;&#12403; <code>deactivate</code> &#12398;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>&#12479;&#12452;&#12510;&#12540;&#12364;&#20572;&#27490;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>Camera &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12362;&#12424;&#12403; Microphone &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12487;&#12479;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>&#12512;&#12540;&#12499;&#12540;&#12463;&#12522;&#12483;&#12503;&#12364;&#20572;&#27490;&#12373;&#12428;&#12414;&#12377;&#12290;</li></ul><p><code>unloadAndStop()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#21628;&#12403;&#20986;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>contentLoaderInfo</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12364; <code>null</code> &#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;SWF &#12392;&#19968;&#32210;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#35222;&#35226;&#30340;&#12450;&#12475;&#12483;&#12488;&#12364;&#12450;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12289;&#12513;&#12514;&#12522;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#20869;&#12398; ActionScript &#12463;&#12521;&#12473;&#23450;&#32681;&#12399;&#12513;&#12514;&#12522;&#20869;&#12395;&#27531;&#12373;&#12428;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383; SWF &#12392;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398;&#12467;&#12540;&#12489;&#12391;&#12371;&#12428;&#12425;&#12398;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>&#13;
     &#13;
     <p><b>&#27880;&#24847;&#65288;iOS &#12398;&#12415;&#65289;</b>&#65306;AIR 3.6 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;iOS &#12391;&#12399;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#21177;&#26524;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>&#13;
     &#13;
     <p><span class="label"> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540; </span></p><table cellpadding="0" cellspacing="0" border="0"><tr><td width="20px"></td><td><code><span class="label">gc</span>:<a href="../../Boolean.html">Boolean</a></code> (default = <code>true</code>)<code></code> &#8212; &#23376; SWF &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12479;&#12540;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12498;&#12531;&#12488;&#12434;&#25552;&#20379;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#65288;<code>true</code> &#12414;&#12383;&#12399; <code>false</code>&#65289;&#12290;&#22810;&#25968;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38750;&#21516;&#26399;&#12391;&#12450;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;<code>gc</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434; <code>false</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#21521;&#19978;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434; <code>false</code> &#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;<code>unloadAndStop()</code> &#12467;&#12510;&#12531;&#12489;&#12398;&#23455;&#34892;&#24460;&#12418;&#23376; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12513;&#12487;&#12451;&#12450;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12362;&#12424;&#12403;&#34920;&#31034;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12513;&#12514;&#12522;&#12395;&#27531;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#13;
     &#13;
     </td></tr></table><p><span class="label">&#38306;&#36899;&#12377;&#12427; API &#12456;&#12524;&#12513;&#12531;&#12488;</span></p><div class="seeAlso"><a href="DisplayObject.html" target="">flash.display.DisplayObject</a><br /><a href="Loader.html#load()" target="">flash.display.Loader.load()</a></div></div></span><a name="includeExamplesSummary" id="includeExamplesSummary"></a><div class="detailSectionHeader">&#20363;<span class="usage"><a href="http://www.adobe.com/go/learn_as3_usingexamples_jp"> &#12371;&#12398;&#20363;&#12398;&#20351;&#29992;&#26041;&#27861; </a></span></div><span id="pageFilter"><div class="exampleHeader">LoaderExample.as</div><br /><div class="detailBody"> &#27425;&#12398;&#20363;&#12391;&#12399;&#12289;LoaderExample &#12463;&#12521;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#27096;&#12293;&#12394;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12398;&#20351;&#29992;&#26041;&#27861;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12479;&#12473;&#12463;&#12399;&#12289;&#20197;&#19979;&#12398;&#25163;&#38918;&#12391;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
 <ol><li><code>url</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12452;&#12513;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#25152;&#12392;&#21517;&#21069;&#12391;&#12377;&#12290;</li><li><code>LoaderExample</code> &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12391;&#12289;<code>loader</code> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#26032;&#12375;&#12356; Loader &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;&#25163;&#38918; 3 &#12391;&#35500;&#26126;&#12377;&#12427; <code>configureListeners()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12540;&#12399;&#12289;<code>request</code> &#12392;&#12356;&#12358; URLRequest &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26032;&#12375;&#12356;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12364;&#12289;&#12381;&#12398;&#21069;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#21517;&#12392;&#22580;&#25152;&#12364;&#20998;&#12363;&#12427;&#12424;&#12358;&#12395; <code>url</code> &#12434;&#28193;&#12375;&#12414;&#12377;&#12290;</li><li><code>request</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; <code>loader</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <code>load()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12452;&#12513;&#12540;&#12472;&#12364;&#34920;&#31034;&#12522;&#12473;&#12488;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>clickHandler</code> &#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12364;&#12525;&#12540;&#12480;&#12540;&#12398; <code>click</code> &#12452;&#12505;&#12531;&#12488;&#12395;&#23550;&#12375;&#12390;&#30331;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;&#12510;&#12454;&#12473;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12452;&#12513;&#12540;&#12472;&#12399;&#12450;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>configureListeners()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#27425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;7 &#12388;&#12398;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12540;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#13;
  <ul><li><code>completeHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12452;&#12513;&#12540;&#12472;&#12398;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>httpStatusHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12452;&#12513;&#12540;&#12472;&#12364;&#12525;&#12540;&#12459;&#12523;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12391;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#35201;&#27714;&#12434;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;Flash Player &#12364;&#12381;&#12428;&#12434;&#26908;&#20986;&#12391;&#12365;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>initHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;<code>completeHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#21069;&#12289;<code>progressHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12398;&#24460;&#12391;&#12377;&#12290;&#19968;&#33324;&#30340;&#12395;&#12399;&#12289;SWF &#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12392;&#12365;&#12289;<code>init</code> &#12452;&#12505;&#12531;&#12488;&#12398;&#26041;&#12364;&#20415;&#21033;&#12391;&#12377;&#12290;</li><li><code>ioErrorHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12452;&#12513;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12363;&#12289;&#12452;&#12513;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>openHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12452;&#12513;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12364;&#26368;&#21021;&#12395;&#38283;&#12363;&#12428;&#12383;&#12392;&#12365;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>progressHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12452;&#12513;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12489;&#12364;&#38283;&#22987;&#12375;&#12383;&#12392;&#12365;&#12395;&#23455;&#34892;&#12373;&#12428;&#12289;&#12452;&#12513;&#12540;&#12472;&#12398;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#20877;&#12403;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li><code>unLoadHandler()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12452;&#12513;&#12540;&#12472;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#12392;&#12365;&#12395; <code>unload()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12452;&#12513;&#12540;&#12472;&#12364;&#12450;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</li></ul></li></ol><p> &#27425;&#12398;&#35201;&#20214;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>&#13;
 &#13;
 <ul><li>&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;Image.gif &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#12467;&#12531;&#12497;&#12452;&#12523;&#28168;&#12415; SWF &#12501;&#12449;&#12452;&#12523;&#12392;&#21516;&#12376;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12513;&#12452;&#12531; SWF &#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474;&#20869;&#12395;&#21454;&#12414;&#12427;&#38936;&#22495;&#12434;&#25345;&#12388;&#12452;&#12513;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</li><li>&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;LoaderInfo &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#21487;&#33021;&#12394;&#12377;&#12409;&#12390;&#12398;&#12452;&#12505;&#12531;&#12488;&#12434;&#21033;&#29992;&#12375;&#12414;&#12377;&#12364;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12289;&#24517;&#35201;&#12395;&#12394;&#12427;&#12398;&#12399; 1 &#12388;&#12398;&#12469;&#12502;&#12475;&#12483;&#12488;&#12398;&#12415;&#12391;&#12377;&#12290;&#29305;&#12395;&#12289;&#12452;&#12513;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12384;&#12369;&#12398;&#22580;&#21512;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12452;&#12513;&#12540;&#12472;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12392;&#12365;&#12398; <code>complete</code> &#12452;&#12505;&#12531;&#12488;&#65288;&#12362;&#12424;&#12403;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390; <code>ioError</code> &#12452;&#12505;&#12531;&#12488;&#65289;&#12391;&#21313;&#20998;&#12391;&#12377;&#12290;</li></ul><div class="listing"><div class="clipcopy"><a href="#" class="copyText">&#12467;&#12500;&#12540;</a></div><pre>&#13;
package {&#13;
    import flash.display.Loader;&#13;
    import flash.display.Sprite;&#13;
    import flash.events.*;&#13;
    import flash.net.URLRequest;&#13;
&#13;
    public class LoaderExample extends Sprite {&#13;
        private var url:String = "Image.gif";&#13;
&#13;
        public function LoaderExample() {&#13;
            var loader:Loader = new Loader();&#13;
            configureListeners(loader.contentLoaderInfo);&#13;
            loader.addEventListener(MouseEvent.CLICK, clickHandler);&#13;
&#13;
            var request:URLRequest = new URLRequest(url);&#13;
            loader.load(request);&#13;
&#13;
            addChild(loader);&#13;
        }&#13;
&#13;
        private function configureListeners(dispatcher:IEventDispatcher):void {&#13;
            dispatcher.addEventListener(Event.COMPLETE, completeHandler);&#13;
            dispatcher.addEventListener(HTTPStatusEvent.HTTP_STATUS, httpStatusHandler);&#13;
            dispatcher.addEventListener(Event.INIT, initHandler);&#13;
            dispatcher.addEventListener(IOErrorEvent.IO_ERROR, ioErrorHandler);&#13;
            dispatcher.addEventListener(Event.OPEN, openHandler);&#13;
            dispatcher.addEventListener(ProgressEvent.PROGRESS, progressHandler);&#13;
            dispatcher.addEventListener(Event.UNLOAD, unLoadHandler);&#13;
        }&#13;
&#13;
        private function completeHandler(event:Event):void {&#13;
            trace("completeHandler: " + event);&#13;
        }&#13;
&#13;
        private function httpStatusHandler(event:HTTPStatusEvent):void {&#13;
            trace("httpStatusHandler: " + event);&#13;
        }&#13;
&#13;
        private function initHandler(event:Event):void {&#13;
            trace("initHandler: " + event);&#13;
        }&#13;
&#13;
        private function ioErrorHandler(event:IOErrorEvent):void {&#13;
            trace("ioErrorHandler: " + event);&#13;
        }&#13;
&#13;
        private function openHandler(event:Event):void {&#13;
            trace("openHandler: " + event);&#13;
        }&#13;
&#13;
        private function progressHandler(event:ProgressEvent):void {&#13;
            trace("progressHandler: bytesLoaded=" + event.bytesLoaded + " bytesTotal=" + event.bytesTotal);&#13;
        }&#13;
&#13;
        private function unLoadHandler(event:Event):void {&#13;
            trace("unLoadHandler: " + event);&#13;
        }&#13;
&#13;
        private function clickHandler(event:MouseEvent):void {&#13;
            trace("clickHandler: " + event);&#13;
            var loader:Loader = Loader(event.target);&#13;
            loader.unload();&#13;
        }&#13;
    }&#13;
}&#13;
</pre></div></div></span><br /><br /><hr /><br /></div><p xmlns:xd="http://www.pnp-software.com/XSLTdoc"></p><center class="copyright"> &#169; 2013 Adobe Systems Incorporated. All rights reserved. <br />Fri Apr 26 2013, 11:59 AM -07:00  </center></div>&#13;
				<div class="contentfooter"><div class="separator">&#160;</div><!--BEGIN IONCOMMENTS--><div id="ionComHere"></div><!--END IONCOMMENTS--><div style="display: none;">
<!-- SiteCatalyst -->
<noscript><img src="http://stats.adobe.com/b/ss/mxmacromedia/1/H.15-XELvs/0?pageName=http%3A//www.adobe.com%3A%20noscript&amp;ch=http%3A//www.adobe.com%3A%20noscript&amp;g=http%3A//www.adobe.com" height="1" width="1" border="0" alt="" /></noscript>
<!-- End SiteCatalyst -->
</div>

<p id="creativecommons" class="creativecommons"><a href="http://creativecommons.org/licenses/by-nc-sa/3.0/" target="external"><span class="sprite CC">&#160;</span></a></p><p id="cpsPromo"><a href="http://www.adobe.com/community/publishing/download.html" target="_blank" class="sprite CC_promo"></a></p><a class="legal" target="external" href="http://help.adobe.com/ja_JP/legalnotices/index.html">&#27861;&#24459;&#19978;&#12398;&#27880;&#24847;</a>&#160;|&#160;<a class="privacy" href="http://www.adobe.com/misc/privacy.html" target="external">&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12509;&#12522;&#12471;&#12540;</a></div>&#13;
			</div>&#13;
		</div>&#13;
		<div class="footer">&#13;
		</div>&#13;
		<div id="whyEnglishContent">&#13;
			<div id="light" class="white_content">&#13;
				<div class="white_content_title">&#13;
					<span style="float:right"><a href="javascript:void(0)" onclick="document.getElementById('light').style.display='none';document.getElementById('fade').style.display='none'">[ X ]</a></span><span style="float:left">&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#29702;&#30001;</span>&#13;
				</div>&#13;
				<div class="white_content_body">&#13;
					<b>ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</b><br /><br />&#13;
					ActionScript 3.0 &#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12364;&#12377;&#12409;&#12390;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#35328;&#35486;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#12393;&#12398;&#35328;&#35486;&#12395;&#12418;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12460;&#12452;&#12489;&#12398;&#26085;&#26412;&#35486;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;ga.controls.HelpBox &#12463;&#12521;&#12473;&#12399;&#33521;&#35486;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#13;
				</div>&#13;
			</div>&#13;
			<div id="fade" class="black_overlay"></div>&#13;
		</div>&#13;
		&#13;
		&#13;
		</body></html>